------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replication/3-re
> plication-package/Output/table2_logfile.log
  log type:  text
 opened on:   1 Feb 2026, 21:17:14

. 
. 
. 
. eststo clear 

. set graphics off

. ***********************************
. use "${replication_dir}/Data/03_clean/end1_end2.dta", clear     

. 
. 
.         
. **Comment: MHT Correction - The Romano-Wolf Multiple Hypothesis Correction
. **Calculates Romano-Wolf stepdown adjusted p-values, which control the FWER and allows for dependenc
> e among p-values by bootstrap resampling
. *NOTE:  The Romano-Wolf correction (asymptotically) controls the familywise error rate (FWER), that 
> is, the probability of rejecting at least one true null hypothesis in a family of hypotheses under t
> est (Clarke et al. 2020)
. 
. local y_list1 unableCall7days1 unableToCOVID1 digitborrow1 digitloan1

. local y_list2 totExp7days1 c1 c2 e1 e2 e3 e4 e5

. local y_list3 threatenPartner1 hitPartner1 logk101 severe_distress1

. local t_list1 tmt_all

. // local t_list2 tmt01 tmt02
.  
. foreach y_list in y_list1 y_list2 y_list3 { //  
  2.         foreach t_list in t_list1 { // t_list2
  3.                 
.                 ** more reps for some tests
.                 if ("`y_list'" == "y_list1" | "`y_list'" == "y_list2") & "`t_list'" == "t_list1" loc
> al reps_option "reps(499)"
  4.                 else local reps_option ""
  5.                 
.                 ** calculate RW p-values
.                 rwolf ``y_list'', indepvar(``t_list'') seed(124) `reps_option'
  6.                 
.                 ereturn list
  7.                 ** collect outcomes
.                 foreach y in ``y_list'' {
  8.                         foreach t in ``t_list'' {
  9.                                 dis "y: `y'. t: `t'"
 10.                                 if "`t_list'" == "t_list1" local rw_`y'         = string(e(rw_`y'
> ),     "%15.3fc")
 11.                                 if "`t_list'" == "t_list2" local rw_`y'_`t' = string(e(rw_`y'_`t'
> ), "%15.3fc")
 12.                         }
 13.                 }
 14.         }
 15. }
Bootstrap replications (499). This may take some time.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5
..................................................     50
..................................................     100
..................................................     150
..................................................     200
..................................................     250
..................................................     300
..................................................     350
..................................................     400
..................................................     450
.................................................



Romano-Wolf step-down adjusted p-values


Independent variable:  tmt_all
Outcome variables:   unableCall7days1 unableToCOVID1 digitborrow1 digitloan1
Number of resamples: 499


------------------------------------------------------------------------------
   Outcome Variable | Model p-value    Resample p-value    Romano-Wolf p-value
--------------------+---------------------------------------------------------
   unableCall7days1 |    0.0000             0.0020              0.0020
     unableToCOVID1 |    0.0000             0.0020              0.0020
       digitborrow1 |    0.0000             0.0020              0.0020
         digitloan1 |    0.0021             0.0080              0.0080
------------------------------------------------------------------------------

scalars:
                  e(N) =  2050
              e(sum_w) =  2050
               e(df_m) =  1
               e(df_r) =  2048
                  e(F) =  11.41549940226552
                 e(r2) =  .0055430773467418
               e(rmse) =  .2159323381716936
                e(mss) =  .5322679183554868
                e(rss) =  95.49163452066743
               e(r2_a) =  .0050575026774775
                 e(ll) =  234.3963426833461
               e(ll_0) =  228.6988830444267
               e(rank) =  2
  e(rw_unableCall7day
    s1)                =  .002
  e(rw_unableToCOVID1) =  .002
    e(rw_digitborrow1) =  .002
      e(rw_digitloan1) =  .008

macros:
            e(cmdline) : "regress digitloan1 tmt_all     [ ], "
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "ols"
             e(depvar) : "digitloan1"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2
                 e(RW) :  4 x 3
               e(beta) :  1 x 1

functions:
             e(sample)   
y: unableCall7days1. t: tmt_all
y: unableToCOVID1. t: tmt_all
y: digitborrow1. t: tmt_all
y: digitloan1. t: tmt_all
Bootstrap replications (499). This may take some time.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5
..................................................     50
..................................................     100
..................................................     150
..................................................     200
..................................................     250
..................................................     300
..................................................     350
..................................................     400
..................................................     450
.................................................



Romano-Wolf step-down adjusted p-values


Independent variable:  tmt_all
Outcome variables:   totExp7days1 c1 c2 e1 e2 e3 e4 e5
Number of resamples: 499


------------------------------------------------------------------------------
   Outcome Variable | Model p-value    Resample p-value    Romano-Wolf p-value
--------------------+---------------------------------------------------------
       totExp7days1 |    0.2538             0.2260              0.5840
                 c1 |    0.1634             0.1560              0.5240
                 c2 |    0.2200             0.2180              0.5840
                 e1 |    0.0138             0.0160              0.0980
                 e2 |    0.0952             0.1300              0.4540
                 e3 |    0.5854             0.5580              0.6000
                 e4 |    0.3481             0.3900              0.6000
                 e5 |    0.0001             0.0020              0.0040
------------------------------------------------------------------------------

scalars:
                  e(N) =  2050
              e(sum_w) =  2050
               e(df_m) =  1
               e(df_r) =  2048
                  e(F) =  21.77313122865862
                 e(r2) =  .010519573812292
               e(rmse) =  56.167515506894
                e(mss) =  68689.65227541607
                e(rss) =  6461009.50674878
               e(r2_a) =  .0100364290729424
                 e(ll) =  -11165.91758142681
               e(ll_0) =  -11176.75725947155
               e(rank) =  2
    e(rw_totExp7days1) =  .584
              e(rw_c1) =  .524
              e(rw_c2) =  .584
              e(rw_e1) =  .098
              e(rw_e2) =  .454
              e(rw_e3) =  .6
              e(rw_e4) =  .6
              e(rw_e5) =  .004

macros:
            e(cmdline) : "regress e5 tmt_all     [ ], "
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "ols"
             e(depvar) : "e5"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2
                 e(RW) :  8 x 3
               e(beta) :  1 x 1

functions:
             e(sample)   
y: totExp7days1. t: tmt_all
y: c1. t: tmt_all
y: c2. t: tmt_all
y: e1. t: tmt_all
y: e2. t: tmt_all
y: e3. t: tmt_all
y: e4. t: tmt_all
y: e5. t: tmt_all
Bootstrap replications (100). This may take some time.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5
..................................................     50
..................................................     100




Romano-Wolf step-down adjusted p-values


Independent variable:  tmt_all
Outcome variables:   threatenPartner1 hitPartner1 logk101 severe_distress1
Number of resamples: 100


------------------------------------------------------------------------------
   Outcome Variable | Model p-value    Resample p-value    Romano-Wolf p-value
--------------------+---------------------------------------------------------
   threatenPartner1 |    0.0328             0.0693              0.1287
        hitPartner1 |    0.4025             0.4158              0.6337
            logk101 |    0.0000             0.0099              0.0099
   severe_distress1 |    0.5304             0.5050              0.6337
------------------------------------------------------------------------------

scalars:
                  e(N) =  2034
              e(sum_w) =  2034
               e(df_m) =  1
               e(df_r) =  2032
                  e(F) =  .644794218051717
                 e(r2) =  .0003172193291646
               e(rmse) =  .1608137779154745
                e(mss) =  .0166750691613942
                e(rss) =  52.54969661225347
               e(r2_a) =  -.0001747505432128
                 e(ll) =  832.0312803742365
               e(ll_0) =  831.7086171362622
               e(rank) =  2
  e(rw_threatenPartne
    r1)                =  .1287128712871287
     e(rw_hitPartner1) =  .6336633663366337
         e(rw_logk101) =  .0099009900990099
  e(rw_severe_distres
    s1)                =  .6336633663366337

macros:
            e(cmdline) : "regress severe_distress1 tmt_all     [ ], "
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "ols"
             e(depvar) : "severe_distress1"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2
                 e(RW) :  4 x 3
               e(beta) :  1 x 1

functions:
             e(sample)   
y: threatenPartner1. t: tmt_all
y: hitPartner1. t: tmt_all
y: logk101. t: tmt_all
y: severe_distress1. t: tmt_all

. 
. 
. ** Table A7 (metaEffects_mitigate)
. ** meta Effects
. ** mitigate "unexpected" comm probl?
.         leebounds unableCall7days1 tmt_all, level(90) cieffect tight() 

Lee (2009) treatment effect bounds

Number of obs.                     =   2260
Number of selected obs.            =   2045
Trimming porportion                =   0.0576
Effect 90% conf. interval          : [-0.4582  -0.3358]

------------------------------------------------------------------------------
unableCall~1 | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
tmt_all      |
       lower |  -.4247363   .0260914   -16.28   0.000    -.4676529   -.3818197
       upper |  -.3636521   .0216813   -16.77   0.000    -.3993146   -.3279895
------------------------------------------------------------------------------

.         local lee_lower = string(e(b)[1,1], "%15.3fc") // Lee (2009)

.         local lee_upper = string(e(b)[1,2], "%15.3fc")

.         local lee_bounds = "[`lee_lower'; `lee_upper']" 

.         local im_lower = string(e(cilower), "%15.3fc") // Imbens-Manski (2004)

.         local im_upper = string(e(ciupper), "%15.3fc")

.         local im_bounds = "[`im_lower'; `im_upper']"

.         
. eststo: reg unableCall7days1 tmt_all, r cluster(districtX)

Linear regression                               Number of obs     =      2,045
                                                F(1, 191)         =     244.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1625
                                                Root MSE          =     .39562

                            (Std. err. adjusted for 192 clusters in districtX)
------------------------------------------------------------------------------
             |               Robust
unableCall~1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.3714151   .0237516   -15.64   0.000    -.4182642   -.3245661
       _cons |    .498503    .022043    22.62   0.000     .4550241    .5419819
------------------------------------------------------------------------------
(est1 stored)

. sum unableCall7days1 if tmt_all == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
unableCall~1 |        668     .498503    .5003724          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.499"

. estadd local district_FE "No", replace

added macro:
        e(district_FE) : "No"

. estadd local survey_FE   "No", replace

added macro:
          e(survey_FE) : "No"

. estadd local controls    "None", replace

added macro:
           e(controls) : "None"

. estadd local rw_stat `rw_unableCall7days1', replace

added macro:
            e(rw_stat) : "0.002"

. estadd local lee_bounds `lee_bounds', replace

added macro:
         e(lee_bounds) : "[-0.425; -0.364]"

. estadd local im_bounds `im_bounds', replace

added macro:
          e(im_bounds) : "[-0.458; -0.336]"

. 
.         
. eststo: pdslasso unableCall7days1 tmt_all (i.districtX i.dateinterviewend unableCall7days female0 ak
> an0 married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var unableCall7days1...
Warning: unable to store lasso estimation
Selected: 5122020.dateinterviewend 8122020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend unableCall7days
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (33):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableCall7days female0 akan0
                                       married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (6):                 5122020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 10112020.dateinterviewend
                                       30112020.dateinterviewend unableCall7days
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0076704     -0.1618655
        30112020  |       0.0389208      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableCall~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.3655305   .0215065   -17.00   0.000    -.4076824   -.3233786
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableCall~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.3549951   .0211003   -16.82   0.000     -.396351   -.3136393
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
unableCall7days1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |   -.356523   .0214482   -16.62   0.000    -.3985607   -.3144853
                 |
dateinterviewend |
        5122020  |   .1053703   .0431533     2.44   0.015     .0207914    .1899491
        8122020  |   .4176149   .0955093     4.37   0.000     .2304202    .6048096
        9112020  |  -.2824241   .0369822    -7.64   0.000    -.3549078   -.2099404
       10112020  |  -.2032269   .0306482    -6.63   0.000    -.2632963   -.1431574
       30112020  |   .0100814   .0299356     0.34   0.736    -.0485912    .0687541
                 |
 unableCall7days |   .1148626   .0198011     5.80   0.000     .0760533     .153672
                 |
       districtX |
            102  |  -.0076543   .1223991    -0.06   0.950    -.2475522    .2322435
            103  |   .1411508    .163054     0.87   0.387    -.1784292    .4607309
            104  |    .108423   .0890156     1.22   0.223    -.0660443    .2828904
            105  |   .1679997   .1071324     1.57   0.117     -.041976    .3779753
            106  |   .2146069   .1729591     1.24   0.215    -.1243867    .5536005
            107  |  -.1259642   .0903916    -1.39   0.163    -.3031285    .0512001
            108  |   .1988092   .1329092     1.50   0.135     -.061688    .4593064
            109  |   .1277953    .143877     0.89   0.374    -.1541985     .409789
            110  |   -.017279   .1280768    -0.13   0.893     -.268305    .2337469
            111  |   .1615487   .1612217     1.00   0.316      -.15444    .4775374
            112  |  -.0513219   .1124196    -0.46   0.648    -.2716602    .1690164
            113  |   .0437023   .1018076     0.43   0.668    -.1558369    .2432414
            114  |  -.0224965   .1264252    -0.18   0.859    -.2702853    .2252923
            115  |   .2408135   .1128701     2.13   0.033     .0195922    .4620348
            116  |   .4744842   .0882793     5.37   0.000       .30146    .6475083
            117  |  -.2631978   .1436456    -1.83   0.067    -.5447381    .0183424
            201  |   .2672723   .1253799     2.13   0.033     .0215322    .5130124
            202  |   .1605498   .1301674     1.23   0.217    -.0945736    .4156733
            203  |   .2733626   .1285164     2.13   0.033     .0214751      .52525
            204  |   .0942145   .1021602     0.92   0.356    -.1060158    .2944447
            205  |   .1531435   .1660926     0.92   0.357     -.172392     .478679
            206  |   .3536365   .1541183     2.29   0.022     .0515702    .6557027
            207  |    .038102   .1080428     0.35   0.724    -.1736579     .249862
            208  |   .2739477   .1411838     1.94   0.052    -.0027674    .5506629
            209  |   .3164491   .1795538     1.76   0.078      -.03547    .6683681
            210  |   .2314905   .1699862     1.36   0.173    -.1016763    .5646572
            211  |   .2792069   .1186405     2.35   0.019     .0466759    .5117379
            212  |   .3749266   .1349514     2.78   0.005     .1104267    .6394265
            213  |   .1689038   .1145156     1.47   0.140    -.0555427    .3933503
            214  |   .1621876   .1129496     1.44   0.151    -.0591895    .3835648
            215  |   .1697345   .2045439     0.83   0.407    -.2311641    .5706332
            217  |   .1628089   .1597782     1.02   0.308    -.1503507    .4759685
            218  |   .3847427   .1707293     2.25   0.024     .0501194     .719366
            219  |   .2255838   .1861258     1.21   0.226    -.1392161    .5903836
            220  |  -.0313796    .101058    -0.31   0.756    -.2294497    .1666904
            301  |   .1359745   .1046269     1.30   0.194    -.0690905    .3410395
            302  |   .2422942    .163361     1.48   0.138    -.0778874    .5624758
            303  |   .0843061   .0907035     0.93   0.353    -.0934695    .2620817
            304  |   .1036432   .0992362     1.04   0.296    -.0908562    .2981426
            305  |   .0319155   .0971013     0.33   0.742    -.1583996    .2222306
            306  |   .0793603   .1146426     0.69   0.489    -.1453351    .3040556
            307  |   .2461002   .1436461     1.71   0.087    -.0354411    .5276414
            308  |   .1275326   .1417789     0.90   0.368    -.1503489    .4054142
            309  |   .4744842   .0882793     5.37   0.000       .30146    .6475083
            310  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            311  |  -.0318119   .0990495    -0.32   0.748    -.2259454    .1623216
            312  |    .000216   .1181365     0.00   0.999    -.2313272    .2317593
            313  |  -.0564744   .1133042    -0.50   0.618    -.2785466    .1655978
            314  |  -.1218819   .1659615    -0.73   0.463    -.4471604    .2033967
            315  |  -.0897599   .1184657    -0.76   0.449    -.3219484    .1424286
            316  |   .4019403   .1780376     2.26   0.024     .0529931    .7508876
            401  |    .133436   .1170954     1.14   0.254    -.0960667    .3629387
            402  |   .1480364   .1621034     0.91   0.361    -.1696806    .4657533
            403  |   .1173446   .1512253     0.78   0.438    -.1790515    .4137408
            404  |   .0768433   .0958082     0.80   0.423    -.1109373    .2646239
            405  |  -.0020004   .1446044    -0.01   0.989    -.2854199     .281419
            406  |  -.1016777   .1093957    -0.93   0.353    -.3160894    .1127339
            408  |    .074405   .1148152     0.65   0.517    -.1506285    .2994386
            410  |   .0954929   .0890444     1.07   0.284     -.079031    .2700167
            411  |   .1637204   .1269938     1.29   0.197    -.0851829    .4126238
            412  |   .2479899   .3032246     0.82   0.413    -.3463194    .8422991
            413  |  -.1476062   .1290158    -1.14   0.253    -.4004726    .1052602
            414  |   .5237937   .2691195     1.95   0.052    -.0036708    1.051258
            415  |  -.0305566    .090006    -0.34   0.734    -.2069651     .145852
            417  |  -.0129553   .1257931    -0.10   0.918    -.2595052    .2335947
            418  |  -.0863993   .1101835    -0.78   0.433    -.3023549    .1295564
            419  |   .2793951   .1648238     1.70   0.090    -.0436536    .6024438
            421  |    .074791   .0885496     0.84   0.398    -.0987631    .2483452
            422  |   .0293951   .0968737     0.30   0.762    -.1604739    .2192641
            423  |   .0709603   .1295935     0.55   0.584    -.1830382    .3249588
            424  |   .4792303   .3274434     1.46   0.143    -.1625469    1.121008
            425  |    .421799   .0887088     4.75   0.000      .247933     .595665
            501  |   .1656926   .1466494     1.13   0.259    -.1217349    .4531202
            502  |   .1446687   .1513362     0.96   0.339    -.1519448    .4412821
            503  |   .0482955   .0940415     0.51   0.608    -.1360225    .2326134
            504  |   .2726545   .1671429     1.63   0.103    -.0549396    .6002485
            505  |   .1640691   .1603967     1.02   0.306    -.1503027    .4784408
            506  |  -.0762349   .1284622    -0.59   0.553    -.3280162    .1755463
            507  |  -.0450232   .0969389    -0.46   0.642      -.23502    .1449736
            508  |  -.3725465   .0951429    -3.92   0.000    -.5590231   -.1860698
            509  |      -.066   .1241234    -0.53   0.595    -.3092774    .1772775
            510  |  -.2037773   .1547454    -1.32   0.188    -.5070727     .099518
            512  |   .1265547   .1050634     1.20   0.228    -.0793657    .3324751
            513  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            514  |  -.2669182   .2274348    -1.17   0.241    -.7126823    .1788458
            515  |   .0672362   .0912605     0.74   0.461     -.111631    .2461035
            516  |  -.0266009   .0931593    -0.29   0.775    -.2091897     .155988
            517  |   .3510547   .1505096     2.33   0.020     .0560612    .6460481
            518  |  -.0585621   .1412122    -0.41   0.678    -.3353329    .2182087
            519  |  -.0207697   .0974968    -0.21   0.831    -.2118599    .1703206
            522  |  -.0351242   .1397288    -0.25   0.802    -.3089877    .2387393
            523  |  -.2671762   .0907162    -2.95   0.003    -.4449767   -.0893757
            524  |   .0821127   .1536058     0.53   0.593    -.2189491    .3831745
            525  |  -.0372711   .1314442    -0.28   0.777    -.2948969    .2203547
            526  |   .2744188   .2172814     1.26   0.207    -.1514449    .7002825
            601  |   .0047481   .0911825     0.05   0.958    -.1739663    .1834625
            602  |  -.2037773   .1547454    -1.32   0.188    -.5070727     .099518
            603  |   .1179612     .08989     1.31   0.189      -.05822    .2941423
            604  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            605  |    .103951   .1524617     0.68   0.495    -.1948685    .4027706
            606  |   .1197547   .2331512     0.51   0.608    -.3372133    .5767226
            608  |   .0773114   .1412294     0.55   0.584    -.1994931    .3541159
            609  |   .4744842   .0882793     5.37   0.000       .30146    .6475083
            611  |   .0103534   .0935895     0.11   0.912    -.1730787    .1937855
            612  |   .1156962   .0881099     1.31   0.189    -.0569959    .2883883
            613  |   .0893468   .0889541     1.00   0.315    -.0850001    .2636937
            614  |   .0670696   .0971846     0.69   0.490    -.1234086    .2575479
            615  |   .1156962   .0881099     1.31   0.189    -.0569959    .2883883
            616  |   .2962227   .2456579     1.21   0.228     -.185258    .7777033
            618  |  -.0345173   .1970739    -0.18   0.861    -.4207751    .3517405
            619  |    .103654   .1275035     0.81   0.416    -.1462484    .3535563
            621  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            622  |   .1459556    .131313     1.11   0.266    -.1114131    .4033243
            623  |   .0360853   .1981208     0.18   0.855    -.3522243    .4243949
            627  |   .2860407   .1594897     1.79   0.073    -.0265534    .5986347
            628  |   .0288105   .1563019     0.18   0.854    -.2775356    .3351567
            701  |    .565276   .0895776     6.31   0.000     .3897071    .7408449
            702  |   .1581328   .1410422     1.12   0.262    -.1183048    .4345704
            703  |   .2666337   .1662046     1.60   0.109    -.0591213    .5923887
            704  |   .2926378   .1536925     1.90   0.057     -.008594    .5938696
            705  |   .0090932   .1771878     0.05   0.959    -.3381885     .356375
            706  |   .2830514   .1512885     1.87   0.061    -.0134686    .5795713
            707  |   .1988849   .1339674     1.48   0.138    -.0636865    .4614563
            708  |   .2069902   .1409662     1.47   0.142    -.0692985    .4832789
            709  |     .43734   .1732437     2.52   0.012     .0977886    .7768913
            710  |    .131875   .1704443     0.77   0.439    -.2021898    .4659397
            711  |   .0793797   .1878844     0.42   0.673    -.2888669    .4476263
            712  |   .2532483   .1237124     2.05   0.041     .0107764    .4957201
            713  |   .1091295   .1328929     0.82   0.412    -.1513359    .3695948
            714  |   .2621308   .1684901     1.56   0.120    -.0681038    .5923653
            715  |   .2631777   .1244428     2.11   0.034     .0192742    .5070811
            716  |   .0219764   .1538392     0.14   0.886    -.2795429    .3234957
            717  |   .2727365   .1393641     1.96   0.050    -.0004122    .5458851
            718  |   .3556432   .1830878     1.94   0.052    -.0032024    .7144887
            719  |   .3156151   .2050998     1.54   0.124    -.0863731    .7176032
            720  |   .1846821   .1352029     1.37   0.172    -.0803108     .449675
            721  |  -.0859309   .1025665    -0.84   0.402    -.2869575    .1150957
            722  |    .186767   .2580737     0.72   0.469    -.3190481    .6925821
            723  |  -.0618636   .1083236    -0.57   0.568    -.2741741    .1504468
            724  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            725  |  -.0280362   .0888503    -0.32   0.752    -.2021795    .1461071
            726  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            727  |   .0437023   .1018076     0.43   0.668    -.1558369    .2432414
            801  |   .2059594    .185972     1.11   0.268     -.158539    .5704578
            803  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            804  |   .4163193   .1432195     2.91   0.004     .1356142    .6970244
            805  |   .5058993   .2313174     2.19   0.029     .0525256     .959273
            806  |   .2375981    .146121     1.63   0.104    -.0487938      .52399
            807  |   .1997792   .1284397     1.56   0.120    -.0519579    .4515163
            808  |   .2596387   .1378417     1.88   0.060    -.0105262    .5298035
            809  |   .3668287   .1994838     1.84   0.066    -.0241524    .7578098
            810  |   .2548475   .2278532     1.12   0.263    -.1917366    .7014316
            811  |   .2805298   .1189398     2.36   0.018      .047412    .5136475
            812  |   .1714148   .1983231     0.86   0.387    -.2172913    .5601208
            813  |   .1785533    .152039     1.17   0.240    -.1194377    .4765443
            814  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            815  |   .1698919   .1322046     1.29   0.199    -.0892244    .4290082
            816  |   .2074428   .2063773     1.01   0.315    -.1970492    .6119348
            817  |   .0701355   .0997372     0.70   0.482    -.1253458    .2656168
            818  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            819  |   .5389954   .2026921     2.66   0.008     .1417262    .9362646
            820  |   .1544607   .3139609     0.49   0.623    -.4608914    .7698128
            821  |  -.3820388     .08989    -4.25   0.000      -.55822   -.2058577
            822  |   .0760976   .0892661     0.85   0.394    -.0988607    .2510559
            823  |    .245815   .1564381     1.57   0.116    -.0607981     .552428
            825  |   .0871704   .1920877     0.45   0.650    -.2893145    .4636553
            826  |  -.3820388     .08989    -4.25   0.000      -.55822   -.2058577
            901  |   .3393468   .1990645     1.70   0.088    -.0508126    .7295061
            902  |   .3802201   .1426556     2.67   0.008     .1006203    .6598199
            903  |   .3072872   .1234694     2.49   0.013     .0652917    .5492828
            904  |   .2577603   .1098409     2.35   0.019      .042476    .4730446
            905  |   .1777968    .116173     1.53   0.126    -.0498981    .4054917
            906  |   .1390107   .1110999     1.25   0.211    -.0787411    .3567625
            907  |   .2058987   .1151174     1.79   0.074    -.0197272    .4315245
            908  |   .3568691   .1139358     3.13   0.002     .1335589    .5801792
            909  |   .3922194   .1138967     3.44   0.001      .168986    .6154529
            910  |   .4074566   .1371837     2.97   0.003     .1385815    .6763317
            911  |   .2723071   .1364283     2.00   0.046     .0049125    .5397017
            912  |    .247657   .1137011     2.18   0.029      .024807     .470507
            913  |   .2866602   .1160423     2.47   0.013     .0592215    .5140989
           1001  |   .0223098    .096611     0.23   0.817    -.1670442    .2116638
           1002  |   .1384973    .150656     0.92   0.358    -.1567831    .4337777
           1003  |   .2037566   .1480161     1.38   0.169    -.0863496    .4938628
           1004  |   .3431881   .1816648     1.89   0.059    -.0128683    .6992445
           1005  |   .0566266   .0916202     0.62   0.537    -.1229457    .2361989
           1006  |   .1160311   .1240601     0.94   0.350    -.1271222    .3591844
           1007  |  -.0882062   .1098674    -0.80   0.422    -.3035424      .12713
           1008  |   .0040699   .1458443     0.03   0.978    -.2817798    .2899195
           1009  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
           1010  |    .079643   .1149819     0.69   0.489    -.1457175    .3050034
           1011  |   .0382808   .2180869     0.18   0.861    -.3891617    .4657233
                 |
           _cons |   .2671762   .0907162     2.95   0.003     .0893757    .4449767
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------
(est2 stored)

. sum unableCall7days1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
unableCall~1 |        668     .498503    .5003724          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.499"

. estadd local district_FE "Yes", replace

added macro:
        e(district_FE) : "Yes"

. estadd local survey_FE   "Yes", replace

added macro:
          e(survey_FE) : "Yes"

. estadd local controls    "PD Lasso", replace

added macro:
           e(controls) : "PD Lasso"

. estadd local rw_stat "", replace

added macro:
            e(rw_stat) : ""

. estadd local lee_bounds "", replace

added macro:
         e(lee_bounds) : ""

. estadd local im_bounds "", replace

added macro:
          e(im_bounds) : ""

. 
. *dyna fig
. pdslasso unableCall7days1 c.tmt_all#c.round1 c.tmt_all#c.round2 (i.districtX i.dateinterviewend unab
> leCall7days female0 akan0 married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var unableCall7days1...
Warning: unable to store lasso estimation
Selected: 5122020.dateinterviewend 8122020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend unableCall7days
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round1...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2122020.dateinterviewend 3122020.dateinterviewend
          4122020.dateinterviewend 5122020.dateinterviewend 6122020.dateinterviewend
          7122020.dateinterviewend 29112020.dateinterviewend 30112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round2...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2112020.dateinterviewend 3112020.dateinterviewend
          4112020.dateinterviewend 5112020.dateinterviewend 6112020.dateinterviewend
          7112020.dateinterviewend 8112020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend 11112020.dateinterviewend 29112020.dateinterviewend
          30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (2):                         c.tmt_all#c.round1 c.tmt_all#c.round2
High-dim controls (33):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableCall7days female0 akan0
                                       married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (21):                1122020.dateinterviewend 2112020.dateinterviewend
                                       2122020.dateinterviewend 3112020.dateinterviewend
                                       3122020.dateinterviewend 4112020.dateinterviewend
                                       4122020.dateinterviewend 5112020.dateinterviewend
                                       5122020.dateinterviewend 6112020.dateinterviewend
                                       6122020.dateinterviewend 7112020.dateinterviewend
                                       7122020.dateinterviewend 8112020.dateinterviewend
                                       8122020.dateinterviewend 9112020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       29112020.dateinterviewend 30112020.dateinterviewend
                                       unableCall7days
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

Structural equation:

OLS using CHS lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
  unableCall7days1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.4059693       .025   -16.24   0.000    -.4549684   -.3569702
                   |
c.tmt_all#c.round2 |   -.314707   .0285951   -11.01   0.000    -.3707523   -.2586617
------------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
  unableCall7days1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.3741309   .0250513   -14.93   0.000    -.4232305   -.3250313
                   |
c.tmt_all#c.round2 |  -.3077353   .0294882   -10.44   0.000    -.3655312   -.2499395
------------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
  unableCall7days1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.3842539   .0253175   -15.18   0.000    -.4338754   -.3346325
                   |
c.tmt_all#c.round2 |  -.3317832   .0307333   -10.80   0.000    -.3920193   -.2715471
                   |
  dateinterviewend |
          1122020  |  -.0935173   .0665934    -1.40   0.160    -.2240379    .0370033
          2112020  |   .0334918   .0643202     0.52   0.603    -.0925734     .159557
          2122020  |  -.0934552   .0689943    -1.35   0.176    -.2286815    .0417711
          3112020  |  -.0900826   .0659406    -1.37   0.172    -.2193237    .0391585
          3122020  |  -.0447867   .0697445    -0.64   0.521    -.1814833      .09191
          4112020  |  -.1261722   .0622339    -2.03   0.043    -.2481484   -.0041959
          4122020  |  -.0490562   .0725998    -0.68   0.499    -.1913491    .0932368
          5112020  |  -.1733317   .0651358    -2.66   0.008    -.3009955    -.045668
          5122020  |  -.0202734   .0726474    -0.28   0.780    -.1626597    .1221129
          6112020  |  -.0859013   .0657624    -1.31   0.191    -.2147932    .0429905
          6122020  |   -.149301   .0777028    -1.92   0.055    -.3015956    .0029937
          7112020  |  -.1460066   .0649182    -2.25   0.025    -.2732438   -.0187693
          7122020  |   .0957028   .1173062     0.82   0.415     -.134213    .3256187
          8112020  |  -.2197697   .0622772    -3.53   0.000    -.3418307   -.0977087
          8122020  |   .3138391   .1061993     2.96   0.003     .1056923    .5219859
          9112020  |   -.369518   .0660751    -5.59   0.000    -.4990228   -.2400133
         10112020  |  -.2857065   .0632516    -4.52   0.000    -.4096773   -.1617357
         11112020  |  -.2458112   .0812952    -3.02   0.002    -.4051469   -.0864755
         29112020  |  -.1748303   .0722754    -2.42   0.016    -.3164874   -.0331732
         30112020  |  -.1101894   .0673276    -1.64   0.102    -.2421491    .0217703
                   |
   unableCall7days |   .1119727   .0196679     5.69   0.000     .0734244     .150521
                   |
         districtX |
              102  |   -.058003      .1595    -0.36   0.716    -.3706172    .2546113
              103  |   .1306284   .1671001     0.78   0.434    -.1968818    .4581386
              104  |   .0794288   .1047351     0.76   0.448    -.1258482    .2847059
              105  |   .1373026   .1158649     1.19   0.236    -.0897885    .3643937
              106  |   .1819682   .1657444     1.10   0.272    -.1428848    .5068213
              107  |  -.1099971    .103125    -1.07   0.286    -.3121183    .0921241
              108  |   .1706304   .1411595     1.21   0.227    -.1060372    .4472979
              109  |   .1176433   .1432729     0.82   0.412    -.1631665     .398453
              110  |  -.0262827   .1384827    -0.19   0.849    -.2977039    .2451384
              111  |   .1353257    .157097     0.86   0.389    -.1725788    .4432302
              112  |  -.0714601   .1187464    -0.60   0.547    -.3041987    .1612785
              113  |    .002139   .1081932     0.02   0.984    -.2099158    .2141939
              114  |  -.0502209   .1290941    -0.39   0.697    -.3032407     .202799
              115  |   .2344844   .1218924     1.92   0.054    -.0044204    .4733891
              116  |   .4473086   .1019184     4.39   0.000     .2475522    .6470649
              117  |  -.2946767   .1522912    -1.93   0.053    -.5931619    .0038085
              201  |   .2255831   .1341874     1.68   0.093    -.0374194    .4885855
              202  |   .1256415   .1350207     0.93   0.352    -.1389943    .3902773
              203  |    .255567   .1418576     1.80   0.072    -.0224687    .5336028
              204  |   .0834868   .1111337     0.75   0.453    -.1343313    .3013049
              205  |   .1745663   .1745378     1.00   0.317    -.1675215     .516654
              206  |   .3346373   .1601099     2.09   0.037     .0208276     .648447
              207  |   .0413786   .1208299     0.34   0.732    -.1954436    .2782008
              208  |   .2554051   .1500068     1.70   0.089    -.0386029     .549413
              209  |   .3148555     .18059     1.74   0.081    -.0390943    .6688053
              210  |   .2392622   .1695291     1.41   0.158    -.0930087    .5715331
              211  |   .2659837   .1271741     2.09   0.036     .0167271    .5152403
              212  |   .3819722   .1402823     2.72   0.006     .1070239    .6569204
              213  |   .1615555   .1230989     1.31   0.189    -.0797139     .402825
              214  |   .1773318   .1234782     1.44   0.151    -.0646811    .4193447
              215  |   .1868785   .2145634     0.87   0.384     -.233658     .607415
              217  |   .2155534   .1554835     1.39   0.166    -.0891886    .5202954
              218  |    .401121   .1711161     2.34   0.019     .0657396    .7365023
              219  |   .2719002   .1958271     1.39   0.165    -.1119139    .6557143
              220  |  -.0269851   .1128118    -0.24   0.811     -.248092    .1941219
              301  |   .1512944   .1114717     1.36   0.175    -.0671861     .369775
              302  |   .2402151   .1626639     1.48   0.140    -.0786002    .5590305
              303  |    .088748   .1031201     0.86   0.389    -.1133637    .2908597
              304  |     .11441   .1084808     1.05   0.292    -.0982085    .3270286
              305  |   .0420621   .1079453     0.39   0.697    -.1695069     .253631
              306  |   .0733116   .1238404     0.59   0.554    -.1694111    .3160344
              307  |   .2417575   .1424082     1.70   0.090    -.0373575    .5208725
              308  |   .1304584     .15429     0.85   0.398    -.1719444    .4328612
              309  |    .486453   .1013719     4.80   0.000     .2877677    .6851383
              310  |   .5653794   .1034466     5.47   0.000     .3626277     .768131
              311  |  -.0776077   .1116479    -0.70   0.487    -.2964335    .1412181
              312  |   .0151331   .1328091     0.11   0.909    -.2451679    .2754341
              313  |  -.0518038   .1265297    -0.41   0.682    -.2997974    .1961898
              314  |  -.0828481   .1681723    -0.49   0.622    -.4124598    .2467635
              315  |  -.0519124   .1313095    -0.40   0.693    -.3092742    .2054494
              316  |   .3984903   .1817099     2.19   0.028     .0423454    .7546352
              401  |   .1448831   .1298192     1.12   0.264     -.109558    .3993241
              402  |    .155122   .1670033     0.93   0.353    -.1721984    .4824425
              403  |   .1261838    .159917     0.79   0.430    -.1872478    .4396154
              404  |   .0888866   .1066725     0.83   0.405    -.1201876    .2979608
              405  |   .0120285   .1467058     0.08   0.935    -.2755096    .2995667
              406  |  -.0975805   .1199023    -0.81   0.416    -.3325847    .1374237
              408  |   .0728561   .1246311     0.58   0.559    -.1714165    .3171286
              410  |   .1096417   .1027544     1.07   0.286    -.0917533    .3110366
              411  |    .168076   .1336489     1.26   0.209    -.0938709     .430023
              412  |   .2453762   .3121238     0.79   0.432    -.3663752    .8571277
              413  |  -.1480118   .1398335    -1.06   0.290    -.4220804    .1260569
              414  |   .5427877   .2777052     1.95   0.051    -.0015044     1.08708
              415  |  -.0850119    .101444    -0.84   0.402    -.2838385    .1138147
              417  |  -.0343727   .1254035    -0.27   0.784    -.2801589    .2114136
              418  |  -.1088411   .1164849    -0.93   0.350    -.3371473    .1194651
              419  |   .2563297   .1916239     1.34   0.181    -.1192463    .6319056
              421  |   .0493345   .1007156     0.49   0.624    -.1480644    .2467333
              422  |   .0466229   .1094143     0.43   0.670    -.1678252     .261071
              423  |   .0806739   .1444137     0.56   0.576    -.2023718    .3637196
              424  |   .5058484   .3318112     1.52   0.127    -.1444896    1.156186
              425  |   .4734419   .1009687     4.69   0.000     .2755468    .6713369
              501  |   .1612259   .1539134     1.05   0.295    -.1404387    .4628906
              502  |   .1409692   .1569024     0.90   0.369     -.166554    .4484923
              503  |   .0491087   .1032573     0.48   0.634     -.153272    .2514893
              504  |    .261688   .1744179     1.50   0.134    -.0801648    .6035408
              505  |    .171658    .146103     1.17   0.240    -.1146986    .4580147
              506  |    -.08016   .1327636    -0.60   0.546     -.340372    .1800519
              507  |  -.0428219    .107292    -0.40   0.690    -.2531104    .1674665
              508  |  -.3491332    .105555    -3.31   0.001    -.5560172   -.1422492
              509  |  -.0534148   .1329385    -0.40   0.688    -.3139694    .2071399
              510  |  -.2147556   .1387813    -1.55   0.122    -.4867618    .0572507
              512  |    .116865   .1238454     0.94   0.345    -.1258675    .3595974
              513  |  -.0078983   .1013293    -0.08   0.938       -.2065    .1907035
              514  |  -.2674366   .2369113    -1.13   0.259    -.7317742    .1969009
              515  |   .0643004   .1037476     0.62   0.535    -.1390413     .267642
              516  |  -.0469397   .1009358    -0.47   0.642    -.2447702    .1508908
              517  |    .345042   .1593883     2.16   0.030     .0326467    .6574373
              518  |  -.0588665   .1480573    -0.40   0.691    -.3490534    .2313205
              519  |   .0191801   .1186325     0.16   0.872    -.2133352    .2516955
              522  |  -.1082867   .1771309    -0.61   0.541     -.455457    .2388835
              523  |  -.2797283   .1044662    -2.68   0.007    -.4844783   -.0749782
              524  |   .0819651   .1649831     0.50   0.619    -.2413958     .405326
              525  |   -.043374   .1325308    -0.33   0.743    -.3031295    .2163816
              526  |   .2865165   .2094244     1.37   0.171    -.1239479    .6969808
              601  |     .02775   .1118263     0.25   0.804    -.1914255    .2469255
              602  |  -.1792246   .1821017    -0.98   0.325    -.5361375    .1776883
              603  |   .1060359   .1044524     1.02   0.310     -.098687    .3107587
              604  |  -.0654561    .102381    -0.64   0.523    -.2661193     .135207
              605  |   .1246644   .1609689     0.77   0.439    -.1908289    .4401578
              606  |   .0922657   .2429303     0.38   0.704     -.383869    .5684003
              608  |   .0451509   .1599107     0.28   0.778    -.2682684    .3585702
              609  |   .4663176   .1018929     4.58   0.000     .2666111     .666024
              611  |   .0285126   .1022582     0.28   0.780    -.1719098     .228935
              612  |    .108157    .099619     1.09   0.278    -.0870926    .3034065
              613  |   .0782903   .1026469     0.76   0.446    -.1228939    .2794745
              614  |   .0910539   .1080059     0.84   0.399    -.1206338    .3027416
              615  |   .1081259   .0999755     1.08   0.279    -.0878224    .3040743
              616  |   .2436531   .2624503     0.93   0.353    -.2707401    .7580463
              618  |  -.0393991   .1871214    -0.21   0.833    -.4061503    .3273521
              619  |   .1185212   .1446734     0.82   0.413    -.1650335    .4020758
              621  |   .6662745   .1033254     6.45   0.000     .4637605    .8687885
              622  |   .1044755   .1401371     0.75   0.456    -.1701881    .3791391
              623  |   .0319932   .2016526     0.16   0.874    -.3632387     .427225
              627  |   .2588895    .146272     1.77   0.077    -.0277983    .5455774
              628  |   .0083599   .1649319     0.05   0.960    -.3149006    .3316204
              701  |   .6154233   .1016012     6.06   0.000     .4162887    .8145579
              702  |   .1570272   .1494605     1.05   0.293      -.13591    .4499643
              703  |   .2442533   .1767139     1.38   0.167    -.1020996    .5906061
              704  |   .2701756   .1609419     1.68   0.093    -.0452647     .585616
              705  |  -.0295302   .1793576    -0.16   0.869    -.3810646    .3220042
              706  |   .2697089   .1709505     1.58   0.115     -.065348    .6047657
              707  |   .1902602   .1375326     1.38   0.167    -.0792988    .4598193
              708  |   .2045871   .1484119     1.38   0.168    -.0862949     .495469
              709  |   .4084351   .1738097     2.35   0.019     .0677744    .7490959
              710  |     .11988   .1812238     0.66   0.508    -.2353122    .4750722
              711  |   .1005027   .1938432     0.52   0.604    -.2794231    .4804285
              712  |   .2512343   .1343892     1.87   0.062    -.0121637    .5146323
              713  |   .1048172   .1468398     0.71   0.475    -.1829834    .3926178
              714  |   .2777143   .1702819     1.63   0.103    -.0560321    .6114608
              715  |   .2678556   .1363755     1.96   0.050     .0005646    .5351466
              716  |   .0363142   .1595591     0.23   0.820    -.2764159    .3490442
              717  |   .2661086   .1479825     1.80   0.072    -.0239317    .5561489
              718  |   .3930378   .1790906     2.19   0.028     .0420267     .744049
              719  |    .341275   .2072767     1.65   0.100    -.0649798    .7475299
              720  |   .2097406   .1431063     1.47   0.143    -.0707426    .4902239
              721  |  -.0485695   .1236927    -0.39   0.695    -.2910027    .1938636
              722  |    .228867   .2566222     0.89   0.372    -.2741032    .7318373
              723  |  -.0742384   .1153224    -0.64   0.520    -.3002662    .1517894
              724  |   .0332518   .1010931     0.33   0.742    -.1648871    .2313907
              725  |    .007385   .1002407     0.07   0.941    -.1890832    .2038532
              726  |   .0089175   .1017858     0.09   0.930     -.190579     .208414
              727  |   .1223875    .109404     1.12   0.263    -.0920404    .3368154
              801  |   .2080326   .1738773     1.20   0.232    -.1327608    .5488259
              803  |   .7383905   .1056789     6.99   0.000     .5312636    .9455173
              804  |   .4216999   .1511898     2.79   0.005     .1253735    .7180264
              805  |   .4790817    .227579     2.11   0.035      .033035    .9251284
              806  |   .2652457   .1508121     1.76   0.079    -.0303406     .560832
              807  |   .2372946   .1392814     1.70   0.088    -.0356919    .5102812
              808  |   .2799336   .1513233     1.85   0.064    -.0166547    .5765219
              809  |   .3800856   .2177729     1.75   0.081    -.0467415    .8069126
              810  |   .2232658   .2345011     0.95   0.341    -.2363479    .6828795
              811  |   .3002793   .1261258     2.38   0.017     .0530773    .5474814
              812  |   .1750667   .1838186     0.95   0.341    -.1852112    .5353446
              813  |   .2176165   .1629124     1.34   0.182    -.1016858    .5369189
              814  |   .7383905   .1056789     6.99   0.000     .5312636    .9455173
              815  |   .1899102   .1409061     1.35   0.178    -.0862607    .4660811
              816  |    .170477   .1802871     0.95   0.344    -.1828793    .5238332
              817  |   .1265044   .1109923     1.14   0.254    -.0910365    .3440453
              818  |   -.013516   .1009787    -0.13   0.894    -.2114306    .1843987
              819  |   .5871955   .1997404     2.94   0.003     .1957116    .9786794
              820  |   .1540038   .3108175     0.50   0.620    -.4551873    .7631949
              821  |  -.2616095   .1056789    -2.48   0.013    -.4687364   -.0544827
              822  |   .0662512   .1013038     0.65   0.513    -.1323005    .2648029
              823  |   .2687345   .1613154     1.67   0.096    -.0474379     .584907
              825  |   .1147227   .2006982     0.57   0.568    -.2786384    .5080839
              826  |  -.3954779   .1077309    -3.67   0.000    -.6066266   -.1843292
              901  |   .3708902   .2050761     1.81   0.071    -.0310515    .7728319
              902  |   .3928952    .153066     2.57   0.010     .0928915     .692899
              903  |    .310888   .1313977     2.37   0.018     .0533532    .5684229
              904  |   .2708848   .1195931     2.27   0.024     .0364866    .5052829
              905  |   .2238493   .1239651     1.81   0.071    -.0191178    .4668165
              906  |   .1714563   .1175179     1.46   0.145    -.0588745    .4017871
              907  |    .210696   .1265628     1.66   0.096    -.0373626    .4587546
              908  |   .3630249   .1206477     3.01   0.003     .1265598    .5994901
              909  |   .4161717   .1207306     3.45   0.001     .1795441    .6527993
              910  |   .4341688   .1461299     2.97   0.003     .1477595    .7205782
              911  |   .2998491   .1451911     2.07   0.039     .0152798    .5844183
              912  |   .2703893   .1176988     2.30   0.022     .0397039    .5010746
              913  |   .3159165   .1203272     2.63   0.009     .0800795    .5517535
             1001  |   .0501796   .1096207     0.46   0.647     -.164673    .2650323
             1002  |   .1468643   .1544494     0.95   0.342    -.1558509    .4495794
             1003  |   .2303524   .1413394     1.63   0.103    -.0466678    .5073726
             1004  |   .3458354   .1961009     1.76   0.078    -.0385153    .7301862
             1005  |   .0722631     .10298     0.70   0.483    -.1295739    .2741001
             1006  |   .1414337   .1348324     1.05   0.294     -.122833    .4057004
             1007  |    -.07344    .117743    -0.62   0.533     -.304212    .1573319
             1008  |  -.0067618   .1433363    -0.05   0.962    -.2876958    .2741722
             1009  |  -.0315608   .1017913    -0.31   0.757    -.2310681    .1679466
             1010  |   .0794652   .1110444     0.72   0.474    -.1381778    .2971083
             1011  |   .0451403   .2369207     0.19   0.849    -.4192157    .5094964
                   |
             _cons |   .3694066   .1122858     3.29   0.001     .1493305    .5894826
------------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    c.tmt_all#c.round1 c.tmt_all#c.round2
------------------------------------------------------------------------------

. coefplot, keep(c.tmt_all#c.round1 c.tmt_all#c.round2) yline(0, lcolor(black) lw(thin) lp(dash)) vert
> ical xlab(, angle(45) labsize(medium)) level(90) graphregion(color(white)) plotregion(fcolor(white))
>  ylab(, nogrid) ///
> coeflabels(c.tmt_all#c.round1="Endline (round 1): Assignment" c.tmt_all#c.round2="Endline (round 2):
>  Assignment") title("Survey-level: unable to communicate or call in past 7 days 0-1", size(med))
(note:  named style med not found in class gsize, default attributes used)

. gr export "${replication_dir}/Output/Figures/figure_a6_1.eps", replace // meta_unableCall7days
file
    /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replication/3-replicati
    > on-package/Output/Figures/figure_a6_1.eps saved as EPS format

. 
. *robust-indivi-level clustering?
. pdslasso unableCall7days1 tmt_all (i.districtX i.dateinterviewend unableCall7days female0 akan0 marr
> ied0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var unableCall7days1...
Warning: unable to store lasso estimation
Selected: 5122020.dateinterviewend 8122020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend unableCall7days
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (33):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableCall7days female0 akan0
                                       married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (6):                 5122020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 10112020.dateinterviewend
                                       30112020.dateinterviewend unableCall7days
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0076704     -0.1618655
        30112020  |       0.0389208      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableCall~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.3655305   .0215065   -17.00   0.000    -.4076824   -.3233786
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableCall~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.3549951   .0211003   -16.82   0.000     -.396351   -.3136393
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
unableCall7days1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |   -.356523   .0214482   -16.62   0.000    -.3985607   -.3144853
                 |
dateinterviewend |
        5122020  |   .1053703   .0431533     2.44   0.015     .0207914    .1899491
        8122020  |   .4176149   .0955093     4.37   0.000     .2304202    .6048096
        9112020  |  -.2824241   .0369822    -7.64   0.000    -.3549078   -.2099404
       10112020  |  -.2032269   .0306482    -6.63   0.000    -.2632963   -.1431574
       30112020  |   .0100814   .0299356     0.34   0.736    -.0485912    .0687541
                 |
 unableCall7days |   .1148626   .0198011     5.80   0.000     .0760533     .153672
                 |
       districtX |
            102  |  -.0076543   .1223991    -0.06   0.950    -.2475522    .2322435
            103  |   .1411508    .163054     0.87   0.387    -.1784292    .4607309
            104  |    .108423   .0890156     1.22   0.223    -.0660443    .2828904
            105  |   .1679997   .1071324     1.57   0.117     -.041976    .3779753
            106  |   .2146069   .1729591     1.24   0.215    -.1243867    .5536005
            107  |  -.1259642   .0903916    -1.39   0.163    -.3031285    .0512001
            108  |   .1988092   .1329092     1.50   0.135     -.061688    .4593064
            109  |   .1277953    .143877     0.89   0.374    -.1541985     .409789
            110  |   -.017279   .1280768    -0.13   0.893     -.268305    .2337469
            111  |   .1615487   .1612217     1.00   0.316      -.15444    .4775374
            112  |  -.0513219   .1124196    -0.46   0.648    -.2716602    .1690164
            113  |   .0437023   .1018076     0.43   0.668    -.1558369    .2432414
            114  |  -.0224965   .1264252    -0.18   0.859    -.2702853    .2252923
            115  |   .2408135   .1128701     2.13   0.033     .0195922    .4620348
            116  |   .4744842   .0882793     5.37   0.000       .30146    .6475083
            117  |  -.2631978   .1436456    -1.83   0.067    -.5447381    .0183424
            201  |   .2672723   .1253799     2.13   0.033     .0215322    .5130124
            202  |   .1605498   .1301674     1.23   0.217    -.0945736    .4156733
            203  |   .2733626   .1285164     2.13   0.033     .0214751      .52525
            204  |   .0942145   .1021602     0.92   0.356    -.1060158    .2944447
            205  |   .1531435   .1660926     0.92   0.357     -.172392     .478679
            206  |   .3536365   .1541183     2.29   0.022     .0515702    .6557027
            207  |    .038102   .1080428     0.35   0.724    -.1736579     .249862
            208  |   .2739477   .1411838     1.94   0.052    -.0027674    .5506629
            209  |   .3164491   .1795538     1.76   0.078      -.03547    .6683681
            210  |   .2314905   .1699862     1.36   0.173    -.1016763    .5646572
            211  |   .2792069   .1186405     2.35   0.019     .0466759    .5117379
            212  |   .3749266   .1349514     2.78   0.005     .1104267    .6394265
            213  |   .1689038   .1145156     1.47   0.140    -.0555427    .3933503
            214  |   .1621876   .1129496     1.44   0.151    -.0591895    .3835648
            215  |   .1697345   .2045439     0.83   0.407    -.2311641    .5706332
            217  |   .1628089   .1597782     1.02   0.308    -.1503507    .4759685
            218  |   .3847427   .1707293     2.25   0.024     .0501194     .719366
            219  |   .2255838   .1861258     1.21   0.226    -.1392161    .5903836
            220  |  -.0313796    .101058    -0.31   0.756    -.2294497    .1666904
            301  |   .1359745   .1046269     1.30   0.194    -.0690905    .3410395
            302  |   .2422942    .163361     1.48   0.138    -.0778874    .5624758
            303  |   .0843061   .0907035     0.93   0.353    -.0934695    .2620817
            304  |   .1036432   .0992362     1.04   0.296    -.0908562    .2981426
            305  |   .0319155   .0971013     0.33   0.742    -.1583996    .2222306
            306  |   .0793603   .1146426     0.69   0.489    -.1453351    .3040556
            307  |   .2461002   .1436461     1.71   0.087    -.0354411    .5276414
            308  |   .1275326   .1417789     0.90   0.368    -.1503489    .4054142
            309  |   .4744842   .0882793     5.37   0.000       .30146    .6475083
            310  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            311  |  -.0318119   .0990495    -0.32   0.748    -.2259454    .1623216
            312  |    .000216   .1181365     0.00   0.999    -.2313272    .2317593
            313  |  -.0564744   .1133042    -0.50   0.618    -.2785466    .1655978
            314  |  -.1218819   .1659615    -0.73   0.463    -.4471604    .2033967
            315  |  -.0897599   .1184657    -0.76   0.449    -.3219484    .1424286
            316  |   .4019403   .1780376     2.26   0.024     .0529931    .7508876
            401  |    .133436   .1170954     1.14   0.254    -.0960667    .3629387
            402  |   .1480364   .1621034     0.91   0.361    -.1696806    .4657533
            403  |   .1173446   .1512253     0.78   0.438    -.1790515    .4137408
            404  |   .0768433   .0958082     0.80   0.423    -.1109373    .2646239
            405  |  -.0020004   .1446044    -0.01   0.989    -.2854199     .281419
            406  |  -.1016777   .1093957    -0.93   0.353    -.3160894    .1127339
            408  |    .074405   .1148152     0.65   0.517    -.1506285    .2994386
            410  |   .0954929   .0890444     1.07   0.284     -.079031    .2700167
            411  |   .1637204   .1269938     1.29   0.197    -.0851829    .4126238
            412  |   .2479899   .3032246     0.82   0.413    -.3463194    .8422991
            413  |  -.1476062   .1290158    -1.14   0.253    -.4004726    .1052602
            414  |   .5237937   .2691195     1.95   0.052    -.0036708    1.051258
            415  |  -.0305566    .090006    -0.34   0.734    -.2069651     .145852
            417  |  -.0129553   .1257931    -0.10   0.918    -.2595052    .2335947
            418  |  -.0863993   .1101835    -0.78   0.433    -.3023549    .1295564
            419  |   .2793951   .1648238     1.70   0.090    -.0436536    .6024438
            421  |    .074791   .0885496     0.84   0.398    -.0987631    .2483452
            422  |   .0293951   .0968737     0.30   0.762    -.1604739    .2192641
            423  |   .0709603   .1295935     0.55   0.584    -.1830382    .3249588
            424  |   .4792303   .3274434     1.46   0.143    -.1625469    1.121008
            425  |    .421799   .0887088     4.75   0.000      .247933     .595665
            501  |   .1656926   .1466494     1.13   0.259    -.1217349    .4531202
            502  |   .1446687   .1513362     0.96   0.339    -.1519448    .4412821
            503  |   .0482955   .0940415     0.51   0.608    -.1360225    .2326134
            504  |   .2726545   .1671429     1.63   0.103    -.0549396    .6002485
            505  |   .1640691   .1603967     1.02   0.306    -.1503027    .4784408
            506  |  -.0762349   .1284622    -0.59   0.553    -.3280162    .1755463
            507  |  -.0450232   .0969389    -0.46   0.642      -.23502    .1449736
            508  |  -.3725465   .0951429    -3.92   0.000    -.5590231   -.1860698
            509  |      -.066   .1241234    -0.53   0.595    -.3092774    .1772775
            510  |  -.2037773   .1547454    -1.32   0.188    -.5070727     .099518
            512  |   .1265547   .1050634     1.20   0.228    -.0793657    .3324751
            513  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            514  |  -.2669182   .2274348    -1.17   0.241    -.7126823    .1788458
            515  |   .0672362   .0912605     0.74   0.461     -.111631    .2461035
            516  |  -.0266009   .0931593    -0.29   0.775    -.2091897     .155988
            517  |   .3510547   .1505096     2.33   0.020     .0560612    .6460481
            518  |  -.0585621   .1412122    -0.41   0.678    -.3353329    .2182087
            519  |  -.0207697   .0974968    -0.21   0.831    -.2118599    .1703206
            522  |  -.0351242   .1397288    -0.25   0.802    -.3089877    .2387393
            523  |  -.2671762   .0907162    -2.95   0.003    -.4449767   -.0893757
            524  |   .0821127   .1536058     0.53   0.593    -.2189491    .3831745
            525  |  -.0372711   .1314442    -0.28   0.777    -.2948969    .2203547
            526  |   .2744188   .2172814     1.26   0.207    -.1514449    .7002825
            601  |   .0047481   .0911825     0.05   0.958    -.1739663    .1834625
            602  |  -.2037773   .1547454    -1.32   0.188    -.5070727     .099518
            603  |   .1179612     .08989     1.31   0.189      -.05822    .2941423
            604  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            605  |    .103951   .1524617     0.68   0.495    -.1948685    .4027706
            606  |   .1197547   .2331512     0.51   0.608    -.3372133    .5767226
            608  |   .0773114   .1412294     0.55   0.584    -.1994931    .3541159
            609  |   .4744842   .0882793     5.37   0.000       .30146    .6475083
            611  |   .0103534   .0935895     0.11   0.912    -.1730787    .1937855
            612  |   .1156962   .0881099     1.31   0.189    -.0569959    .2883883
            613  |   .0893468   .0889541     1.00   0.315    -.0850001    .2636937
            614  |   .0670696   .0971846     0.69   0.490    -.1234086    .2575479
            615  |   .1156962   .0881099     1.31   0.189    -.0569959    .2883883
            616  |   .2962227   .2456579     1.21   0.228     -.185258    .7777033
            618  |  -.0345173   .1970739    -0.18   0.861    -.4207751    .3517405
            619  |    .103654   .1275035     0.81   0.416    -.1462484    .3535563
            621  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            622  |   .1459556    .131313     1.11   0.266    -.1114131    .4033243
            623  |   .0360853   .1981208     0.18   0.855    -.3522243    .4243949
            627  |   .2860407   .1594897     1.79   0.073    -.0265534    .5986347
            628  |   .0288105   .1563019     0.18   0.854    -.2775356    .3351567
            701  |    .565276   .0895776     6.31   0.000     .3897071    .7408449
            702  |   .1581328   .1410422     1.12   0.262    -.1183048    .4345704
            703  |   .2666337   .1662046     1.60   0.109    -.0591213    .5923887
            704  |   .2926378   .1536925     1.90   0.057     -.008594    .5938696
            705  |   .0090932   .1771878     0.05   0.959    -.3381885     .356375
            706  |   .2830514   .1512885     1.87   0.061    -.0134686    .5795713
            707  |   .1988849   .1339674     1.48   0.138    -.0636865    .4614563
            708  |   .2069902   .1409662     1.47   0.142    -.0692985    .4832789
            709  |     .43734   .1732437     2.52   0.012     .0977886    .7768913
            710  |    .131875   .1704443     0.77   0.439    -.2021898    .4659397
            711  |   .0793797   .1878844     0.42   0.673    -.2888669    .4476263
            712  |   .2532483   .1237124     2.05   0.041     .0107764    .4957201
            713  |   .1091295   .1328929     0.82   0.412    -.1513359    .3695948
            714  |   .2621308   .1684901     1.56   0.120    -.0681038    .5923653
            715  |   .2631777   .1244428     2.11   0.034     .0192742    .5070811
            716  |   .0219764   .1538392     0.14   0.886    -.2795429    .3234957
            717  |   .2727365   .1393641     1.96   0.050    -.0004122    .5458851
            718  |   .3556432   .1830878     1.94   0.052    -.0032024    .7144887
            719  |   .3156151   .2050998     1.54   0.124    -.0863731    .7176032
            720  |   .1846821   .1352029     1.37   0.172    -.0803108     .449675
            721  |  -.0859309   .1025665    -0.84   0.402    -.2869575    .1150957
            722  |    .186767   .2580737     0.72   0.469    -.3190481    .6925821
            723  |  -.0618636   .1083236    -0.57   0.568    -.2741741    .1504468
            724  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            725  |  -.0280362   .0888503    -0.32   0.752    -.2021795    .1461071
            726  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            727  |   .0437023   .1018076     0.43   0.668    -.1558369    .2432414
            801  |   .2059594    .185972     1.11   0.268     -.158539    .5704578
            803  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            804  |   .4163193   .1432195     2.91   0.004     .1356142    .6970244
            805  |   .5058993   .2313174     2.19   0.029     .0525256     .959273
            806  |   .2375981    .146121     1.63   0.104    -.0487938      .52399
            807  |   .1997792   .1284397     1.56   0.120    -.0519579    .4515163
            808  |   .2596387   .1378417     1.88   0.060    -.0105262    .5298035
            809  |   .3668287   .1994838     1.84   0.066    -.0241524    .7578098
            810  |   .2548475   .2278532     1.12   0.263    -.1917366    .7014316
            811  |   .2805298   .1189398     2.36   0.018      .047412    .5136475
            812  |   .1714148   .1983231     0.86   0.387    -.2172913    .5601208
            813  |   .1785533    .152039     1.17   0.240    -.1194377    .4765443
            814  |   .6179612     .08989     6.87   0.000       .44178    .7941423
            815  |   .1698919   .1322046     1.29   0.199    -.0892244    .4290082
            816  |   .2074428   .2063773     1.01   0.315    -.1970492    .6119348
            817  |   .0701355   .0997372     0.70   0.482    -.1253458    .2656168
            818  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
            819  |   .5389954   .2026921     2.66   0.008     .1417262    .9362646
            820  |   .1544607   .3139609     0.49   0.623    -.4608914    .7698128
            821  |  -.3820388     .08989    -4.25   0.000      -.55822   -.2058577
            822  |   .0760976   .0892661     0.85   0.394    -.0988607    .2510559
            823  |    .245815   .1564381     1.57   0.116    -.0607981     .552428
            825  |   .0871704   .1920877     0.45   0.650    -.2893145    .4636553
            826  |  -.3820388     .08989    -4.25   0.000      -.55822   -.2058577
            901  |   .3393468   .1990645     1.70   0.088    -.0508126    .7295061
            902  |   .3802201   .1426556     2.67   0.008     .1006203    .6598199
            903  |   .3072872   .1234694     2.49   0.013     .0652917    .5492828
            904  |   .2577603   .1098409     2.35   0.019      .042476    .4730446
            905  |   .1777968    .116173     1.53   0.126    -.0498981    .4054917
            906  |   .1390107   .1110999     1.25   0.211    -.0787411    .3567625
            907  |   .2058987   .1151174     1.79   0.074    -.0197272    .4315245
            908  |   .3568691   .1139358     3.13   0.002     .1335589    .5801792
            909  |   .3922194   .1138967     3.44   0.001      .168986    .6154529
            910  |   .4074566   .1371837     2.97   0.003     .1385815    .6763317
            911  |   .2723071   .1364283     2.00   0.046     .0049125    .5397017
            912  |    .247657   .1137011     2.18   0.029      .024807     .470507
            913  |   .2866602   .1160423     2.47   0.013     .0592215    .5140989
           1001  |   .0223098    .096611     0.23   0.817    -.1670442    .2116638
           1002  |   .1384973    .150656     0.92   0.358    -.1567831    .4337777
           1003  |   .2037566   .1480161     1.38   0.169    -.0863496    .4938628
           1004  |   .3431881   .1816648     1.89   0.059    -.0128683    .6992445
           1005  |   .0566266   .0916202     0.62   0.537    -.1229457    .2361989
           1006  |   .1160311   .1240601     0.94   0.350    -.1271222    .3591844
           1007  |  -.0882062   .1098674    -0.80   0.422    -.3035424      .12713
           1008  |   .0040699   .1458443     0.03   0.978    -.2817798    .2899195
           1009  |  -.0255158   .0882793    -0.29   0.773      -.19854    .1475083
           1010  |    .079643   .1149819     0.69   0.489    -.1457175    .3050034
           1011  |   .0382808   .2180869     0.18   0.861    -.3891617    .4657233
                 |
           _cons |   .2671762   .0907162     2.95   0.003     .0893757    .4449767
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------

.         
.         
.         leebounds unableToCOVID1 tmt_all, level(90) cieffect tight() 

Lee (2009) treatment effect bounds

Number of obs.                     =   2260
Number of selected obs.            =   2045
Trimming porportion                =   0.0576
Effect 90% conf. interval          : [-0.2732  -0.1486]

------------------------------------------------------------------------------
unableToCO~1 | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
tmt_all      |
       lower |  -.2396253   .0261425    -9.17   0.000    -.2826259   -.1966247
       upper |   -.178541   .0233794    -7.64   0.000    -.2169968   -.1400853
------------------------------------------------------------------------------

.         local lee_lower = string(e(b)[1,1], "%15.3fc") // Lee (2009)

.         local lee_upper = string(e(b)[1,2], "%15.3fc")

.         local lee_bounds = "[`lee_lower'; `lee_upper']" 

.         local im_lower = string(e(cilower), "%15.3fc") // Imbens-Manski (2004)

.         local im_upper = string(e(ciupper), "%15.3fc")

.         local im_bounds = "[`im_lower'; `im_upper']"

.         
. eststo: reg unableToCOVID1 tmt_all, r cluster(districtX)

Linear regression                               Number of obs     =      2,045
                                                F(1, 191)         =      54.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0381
                                                Root MSE          =     .45821

                            (Std. err. adjusted for 192 clusters in districtX)
------------------------------------------------------------------------------
             |               Robust
unableToCO~1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |   -.194289   .0262013    -7.42   0.000      -.24597    -.142608
       _cons |   .4520958   .0252382    17.91   0.000     .4023143    .5018773
------------------------------------------------------------------------------
(est3 stored)

. sum unableToCOVID1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
unableToCO~1 |        668    .4520958    .4980728          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.452"

. estadd local district_FE "No", replace

added macro:
        e(district_FE) : "No"

. estadd local survey_FE   "No", replace

added macro:
          e(survey_FE) : "No"

. estadd local controls    "None", replace

added macro:
           e(controls) : "None"

. estadd local rw_stat `rw_unableToCOVID1', replace

added macro:
            e(rw_stat) : "0.002"

. estadd local lee_bounds `lee_bounds', replace

added macro:
         e(lee_bounds) : "[-0.240; -0.179]"

. estadd local im_bounds `im_bounds', replace

added macro:
          e(im_bounds) : "[-0.273; -0.149]"

. 
. eststo: pdslasso unableToCOVID1 tmt_all (i.districtX i.dateinterviewend unableToCOVID female0 akan0 
> married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var unableToCOVID1...
Warning: unable to store lasso estimation
Selected: 3112020.dateinterviewend 10112020.dateinterviewend 30112020.dateinterviewend unableToCOVID
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (33):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableToCOVID female0 akan0 married0
                                       ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (5):                 3112020.dateinterviewend 5122020.dateinterviewend
                                       10112020.dateinterviewend 30112020.dateinterviewend
                                       unableToCOVID
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0076704     -0.1618655
        30112020  |       0.0389208      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableToCO~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.1818352   .0214592    -8.47   0.000    -.2238944    -.139776
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableToCO~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.1711724   .0211658    -8.09   0.000    -.2126567   -.1296882
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
  unableToCOVID1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |  -.1718966   .0214852    -8.00   0.000    -.2140068   -.1297864
                 |
dateinterviewend |
        3112020  |   .1434435   .0402722     3.56   0.000     .0645115    .2223756
        5122020  |  -.0054475   .0419505    -0.13   0.897     -.087669    .0767739
       10112020  |  -.1325908   .0423884    -3.13   0.002    -.2156705    -.049511
       30112020  |  -.1214066   .0304399    -3.99   0.000    -.1810677   -.0617455
                 |
   unableToCOVID |    .280488   .0213011    13.17   0.000     .2387385    .3222375
                 |
       districtX |
            102  |  -.0175978   .1137312    -0.15   0.877    -.2405069    .2053113
            103  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            104  |   .1469784   .1546928     0.95   0.342     -.156214    .4501708
            105  |   .1299884   .1341324     0.97   0.332    -.1329061     .392883
            106  |   .3943537    .240446     1.64   0.101    -.0769119    .8656193
            107  |  -.0241418   .1148932    -0.21   0.834    -.2493283    .2010448
            108  |  -.2630893   .1386528    -1.90   0.058    -.5348437    .0086651
            109  |   .0148368   .1823397     0.08   0.935    -.3425424    .3722159
            110  |  -.0724758   .1434975    -0.51   0.614    -.3537257     .208774
            111  |   .1351323    .179845     0.75   0.452    -.2173574    .4876221
            112  |  -.1387565   .2629263    -0.53   0.598    -.6540826    .3765695
            113  |   .0921582    .336686     0.27   0.784    -.5677343    .7520506
            114  |  -.0170631   .1571717    -0.11   0.914     -.325114    .2909877
            115  |   .0462709   .1841893     0.25   0.802    -.3147335    .4072754
            116  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            117  |  -.2341694   .1386167    -1.69   0.091    -.5058532    .0375143
            201  |   .2496397   .1605083     1.56   0.120    -.0649508    .5642301
            202  |   .1815993   .1572542     1.15   0.248    -.1266133     .489812
            203  |   .0587332   .1661956     0.35   0.724    -.2670042    .3844705
            204  |   .2321064   .1412767     1.64   0.100    -.0447908    .5090037
            205  |   .1684842   .1739773     0.97   0.333    -.1725049    .5094734
            206  |   .1893113   .1717038     1.10   0.270    -.1472219    .5258446
            207  |   .0729932   .1156616     0.63   0.528    -.1536994    .2996858
            208  |    .097171   .1493899     0.65   0.515    -.1956277    .3899698
            209  |   .5693998   .2110545     2.70   0.007     .1557405     .983059
            210  |   .3685638   .1406793     2.62   0.009     .0928374    .6442901
            211  |   .2905922   .1551477     1.87   0.061    -.0134917    .5946761
            212  |    .147036   .1757487     0.84   0.403     -.197425    .4914971
            213  |   .2549985   .1498159     1.70   0.089    -.0386352    .5486322
            214  |   .3413837   .1363328     2.50   0.012     .0741763    .6085911
            215  |    .371761   .1986639     1.87   0.061     -.017613     .761135
            217  |   .3520261    .157308     2.24   0.025     .0437081     .660344
            218  |   .3131684    .163978     1.91   0.056    -.0082226    .6345594
            219  |   .1310157   .1823251     0.72   0.472    -.2263348    .4883663
            220  |  -.0264438    .158796    -0.17   0.868    -.3376782    .2847907
            301  |   .1253383   .1479719     0.85   0.397    -.1646813    .4153578
            302  |   .3455755   .1691542     2.04   0.041     .0140394    .6771117
            303  |   .1367364   .1167147     1.17   0.241    -.0920203     .365493
            304  |   .0772721   .1255013     0.62   0.538    -.1687059    .3232502
            305  |   .2879988   .1516844     1.90   0.058    -.0092972    .5852948
            306  |   .0133142   .1332046     0.10   0.920    -.2477619    .2743903
            307  |   .0915507   .1692369     0.54   0.589    -.2401475     .423249
            308  |   .0868178   .1715226     0.51   0.613    -.2493603    .4229959
            309  |   .6477548    .114702     5.65   0.000     .4229431    .8725665
            310  |   .4758582   .1148932     4.14   0.000     .2506717    .7010448
            311  |   .0115985   .1342916     0.09   0.931    -.2516082    .2748052
            312  |   .2450247    .127667     1.92   0.055    -.0051981    .4952474
            313  |   .0075728   .1205566     0.06   0.950    -.2287138    .2438595
            314  |  -.2634399   .2162062    -1.22   0.223    -.6871964    .1603166
            315  |  -.0532043   .1702959    -0.31   0.755    -.3869782    .2805696
            316  |    .229689   .1691789     1.36   0.175    -.1018955    .5612735
            401  |  -.1349215   .1225091    -1.10   0.271     -.375035     .105192
            402  |    .093361   .1483523     0.63   0.529    -.1974042    .3841262
            403  |   .0592924    .137145     0.43   0.665    -.2095069    .3280916
            404  |  -.0921713   .1239283    -0.74   0.457    -.3350662    .1507237
            405  |  -.2766781   .1346265    -2.06   0.040    -.5405412    -.012815
            406  |  -.2446683   .1521694    -1.61   0.108    -.5429149    .0535782
            408  |  -.0300632   .1531885    -0.20   0.844    -.3303071    .2701808
            410  |   .4860023   .1942474     2.50   0.012     .1052845    .8667202
            411  |  -.0182929   .1394741    -0.13   0.896    -.2916571    .2550714
            412  |  -.1723807   .1871415    -0.92   0.357    -.5391714      .19441
            413  |   -.071321   .1479089    -0.48   0.630     -.361217    .2185751
            414  |   .0393356   .1225439     0.32   0.748    -.2008461    .2795172
            415  |  -.0110539   .1141943    -0.10   0.923    -.2348706    .2127628
            417  |  -.1292944   .2139819    -0.60   0.546    -.5486912    .2901024
            418  |   -.181082   .1266755    -1.43   0.153    -.4293613    .0671974
            419  |  -.1816495   .1665429    -1.09   0.275    -.5080676    .1447686
            421  |  -.2662359   .2142989    -1.24   0.214     -.686254    .1537821
            422  |  -.0414055   .1161149    -0.36   0.721    -.2689866    .1861755
            423  |  -.2688461   .1318485    -2.04   0.041    -.5272643   -.0104278
            424  |  -.3495214   .1152043    -3.03   0.002    -.5753176   -.1237252
            425  |   .1504786   .1152043     1.31   0.191    -.0753176    .3762748
            501  |  -.0337292   .1423933    -0.24   0.813    -.3128149    .2453565
            502  |   .0872187   .2942203     0.30   0.767    -.4894425    .6638799
            503  |  -.0581528   .1144664    -0.51   0.611    -.2825028    .1661972
            504  |  -.1769614   .1351947    -1.31   0.191    -.4419381    .0880152
            505  |  -.0049753   .1893303    -0.03   0.979    -.3760559    .3661053
            506  |  -.2253021   .1260943    -1.79   0.074    -.4724424    .0218381
            507  |  -.2264978   .1367832    -1.66   0.098     -.494588    .0415923
            508  |  -.2382063   .1196316    -1.99   0.046    -.4726799   -.0037326
            509  |   -.172242   .1365615    -1.26   0.207    -.4398976    .0954136
            510  |  -.1577055   .1297247    -1.22   0.224    -.4119612    .0965502
            512  |  -.1820684   .1360862    -1.34   0.181    -.4487925    .0846557
            513  |  -.2120012   .1516844    -1.40   0.162    -.5092972    .0852948
            514  |  -.0979611   .1395739    -0.70   0.483     -.371521    .1755988
            515  |   -.171105   .1303976    -1.31   0.189    -.4266795    .0844695
            516  |  -.2403776   .1271322    -1.89   0.059    -.4895522     .008797
            517  |   .2078088   .1767813     1.18   0.240    -.1386761    .5542938
            518  |  -.3383881   .1584491    -2.14   0.033    -.6489425   -.0278336
            519  |  -.3495214   .1152043    -3.03   0.002    -.5753176   -.1237252
            522  |  -.0815836   .1274325    -0.64   0.522    -.3313467    .1681794
            523  |  -.2436538   .1152306    -2.11   0.034    -.4695016    -.017806
            524  |  -.2478386   .1470558    -1.69   0.092    -.5360627    .0403855
            525  |  -.0664887   .1237007    -0.54   0.591    -.3089377    .1759603
            526  |   .0627015   .2618271     0.24   0.811    -.4504702    .5758731
            601  |  -.3151401   .1567341    -2.01   0.044    -.6223332    -.007947
            602  |  -.2979495   .1973455    -1.51   0.131    -.6847395    .0888406
            603  |  -.0241418   .1148932    -0.21   0.834    -.2493283    .2010448
            604  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            605  |   .0941545   .1558418     0.60   0.546    -.2112898    .3995987
            606  |  -.2255666   .1277028    -1.77   0.077    -.4758594    .0247263
            608  |  -.4368316   .1298553    -3.36   0.001    -.6913432   -.1823199
            609  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            611  |  -.1452193   .1577947    -0.92   0.357    -.4544913    .1640527
            612  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            613  |  -.0717572   .1144766    -0.63   0.531    -.2961271    .1526127
            614  |  -.1796341   .1275234    -1.41   0.159    -.4295754    .0703071
            615  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            616  |   .5618065   .1296746     4.33   0.000      .307649     .815964
            618  |   -.315199   .1550294    -2.03   0.042    -.6190511   -.0113469
            619  |  -.1577055   .1297247    -1.22   0.224    -.4119612    .0965502
            621  |   .4758582   .1148932     4.14   0.000     .2506717    .7010448
            622  |   -.316048   .1177041    -2.69   0.007    -.5467439   -.0853522
            623  |  -.1577055   .1222795    -1.29   0.197     -.397369     .081958
            627  |   -.006622   .2433667    -0.03   0.978     -.483612    .4703681
            628  |  -.2762215   .1302553    -2.12   0.034    -.5315172   -.0209258
            701  |   -.021418   .1150379    -0.19   0.852    -.2468881    .2040521
            702  |   .1742347   .1639545     1.06   0.288    -.1471102    .4955795
            703  |   .0638171   .1615825     0.39   0.693    -.2528788    .3805129
            704  |   .1119634   .1835208     0.61   0.542    -.2477307    .4716575
            705  |   .3303225   .2650337     1.25   0.213    -.1891341     .849779
            706  |   .1874875   .2056056     0.91   0.362     -.215492     .590467
            707  |  -.1079179   .1672957    -0.65   0.519    -.4358115    .2199757
            708  |   .1741395   .1419853     1.23   0.220    -.1041466    .4524256
            709  |    .198015   .2306622     0.86   0.391    -.2540747    .6501047
            710  |   .2625027   .2190995     1.20   0.231    -.1669244    .6919298
            711  |  -.0453616   .1810275    -0.25   0.802     -.400169    .3094457
            712  |   .0222341   .1451317     0.15   0.878    -.2622187    .3066869
            713  |   .0520797   .1629482     0.32   0.749    -.2672929    .3714523
            714  |   .0626929   .2064704     0.30   0.761    -.3419817    .4673675
            715  |   .0584459   .1343015     0.44   0.663    -.2047803    .3216721
            716  |   .0033593   .1333418     0.03   0.980    -.2579858    .2647044
            717  |   .0770505    .205587     0.37   0.708    -.3258926    .4799936
            718  |    .183952   .2224563     0.83   0.408    -.2520544    .6199584
            719  |   .3139203   .2054919     1.53   0.127    -.0888364     .716677
            720  |   .1481446   .1459773     1.01   0.310    -.1379655    .4342548
            721  |   .1749027     .26477     0.66   0.509     -.344037    .6938424
            722  |  -.0472685   .1333047    -0.35   0.723    -.3085409    .2140038
            723  |  -.0823535    .126832    -0.65   0.516    -.3309396    .1662326
            724  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            725  |   .3183505   .2609104     1.22   0.222    -.1930245    .8297255
            726  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            727  |  -.4078418   .1209076    -3.37   0.001    -.6448163   -.1708673
            801  |   .2099637   .2326183     0.90   0.367    -.2459598    .6658871
            803  |   .7563462   .1152306     6.56   0.000     .5304984     .982194
            804  |  -.1395317   .1336388    -1.04   0.296     -.401459    .1223956
            805  |  -.1799123   .1832867    -0.98   0.326    -.5391477    .1793231
            806  |   .0633931   .1669748     0.38   0.704    -.2638716    .3906577
            807  |   .1151451   .1998686     0.58   0.565    -.2765902    .5068803
            808  |   .0299919   .1594517     0.19   0.851    -.2825277    .3425114
            809  |   .3118065   .1635053     1.91   0.057     -.008658    .6322711
            810  |   .2350938    .211683     1.11   0.267    -.1797973    .6499849
            811  |   .1306726   .1366829     0.96   0.339     -.137221    .3985662
            812  |   -.005714   .1399239    -0.04   0.967    -.2799598    .2685317
            813  |   .0660913   .1705111     0.39   0.698    -.2681043     .400287
            814  |  -.2436538   .1152306    -2.11   0.034    -.4695016    -.017806
            815  |  -.0561576    .115688    -0.49   0.627    -.2829019    .1705866
            816  |   .2347046   .1819763     1.29   0.197    -.1219624    .5913716
            817  |  -.0400136   .1149858    -0.35   0.728    -.2653816    .1853545
            818  |  -.0717572   .1144766    -0.63   0.531    -.2961271    .1526127
            819  |   .0810034   .1571399     0.52   0.606    -.2269852    .3889921
            820  |  -.0148018   .1999477    -0.07   0.941    -.4066921    .3770885
            821  |  -.5241418   .1148932    -4.56   0.000    -.7493283   -.2989552
            822  |   .2140502     .11673     1.83   0.067    -.0147364    .4428368
            823  |   .1177984   .1442156     0.82   0.414    -.1648588    .4004557
            825  |   .3443053   .2548729     1.35   0.177    -.1552365    .8438471
            826  |  -.2436538   .1152306    -2.11   0.034    -.4695016    -.017806
            901  |   .1782428   .2117848     0.84   0.400    -.2368479    .5933335
            902  |   .0055144   .1472994     0.04   0.970    -.2831871    .2942158
            903  |   .1228068   .1571963     0.78   0.435    -.1852923    .4309059
            904  |   .1550751   .1434196     1.08   0.280    -.1260221    .4361723
            905  |   .0376736   .1385077     0.27   0.786    -.2337965    .3091437
            906  |  -.0435072   .1312316    -0.33   0.740    -.3007165     .213702
            907  |  -.0991825    .127868    -0.78   0.438    -.3497992    .1514343
            908  |    .132995   .1471518     0.90   0.366    -.1554172    .4214072
            909  |   .1034929   .1360722     0.76   0.447    -.1632037    .3701894
            910  |    .208768   .1636185     1.28   0.202    -.1119185    .5294544
            911  |  -.0419496   .1945271    -0.22   0.829    -.4232158    .3393166
            912  |   .2243519   .1638277     1.37   0.171    -.0967445    .5454483
            913  |   .0461589   .1562633     0.30   0.768    -.2601116    .3524293
           1001  |   .0172853   .1565861     0.11   0.912    -.2896179    .3241885
           1002  |  -.0643561   .1285905    -0.50   0.617    -.3163889    .1876766
           1003  |   .0823333   .2211433     0.37   0.710    -.3510997    .5157663
           1004  |   .2615985    .165237     1.58   0.113    -.0622601    .5854572
           1005  |   .0545538   .1380252     0.40   0.693    -.2159706    .3250782
           1006  |   -.098268   .1620914    -0.61   0.544    -.4159613    .2194254
           1007  |  -.0665226   .1293007    -0.51   0.607    -.3199472    .1869021
           1008  |  -.1316411   .1547598    -0.85   0.395    -.4349647    .1716825
           1009  |  -.1434789   .1160946    -1.24   0.217    -.3710202    .0840623
           1010  |   .0876911   .2627326     0.33   0.739    -.4272554    .6026376
           1011  |   -.010321   .1977613    -0.05   0.958     -.397926     .377284
                 |
           _cons |   .2436538   .1152306     2.11   0.034      .017806    .4695016
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------
(est4 stored)

. sum unableToCOVID1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
unableToCO~1 |        668    .4520958    .4980728          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.452"

. estadd local district_FE "Yes", replace

added macro:
        e(district_FE) : "Yes"

. estadd local survey_FE   "Yes", replace

added macro:
          e(survey_FE) : "Yes"

. estadd local controls    "PD Lasso", replace

added macro:
           e(controls) : "PD Lasso"

. estadd local rw_stat "", replace

added macro:
            e(rw_stat) : ""

. estadd local lee_bounds "", replace

added macro:
         e(lee_bounds) : ""

. estadd local im_bounds "", replace

added macro:
          e(im_bounds) : ""

. 
. *dyna fig
. pdslasso unableToCOVID1 c.tmt_all#c.round1 c.tmt_all#c.round2 (i.districtX i.dateinterviewend unable
> ToCOVID female0 akan0 married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var unableToCOVID1...
Warning: unable to store lasso estimation
Selected: 3112020.dateinterviewend 10112020.dateinterviewend 30112020.dateinterviewend unableToCOVID
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round1...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2122020.dateinterviewend 3122020.dateinterviewend
          4122020.dateinterviewend 5122020.dateinterviewend 6122020.dateinterviewend
          7122020.dateinterviewend 29112020.dateinterviewend 30112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round2...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2112020.dateinterviewend 3112020.dateinterviewend
          4112020.dateinterviewend 5112020.dateinterviewend 6112020.dateinterviewend
          7112020.dateinterviewend 8112020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend 11112020.dateinterviewend 29112020.dateinterviewend
          30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (2):                         c.tmt_all#c.round1 c.tmt_all#c.round2
High-dim controls (33):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableToCOVID female0 akan0 married0
                                       ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (20):                1122020.dateinterviewend 2112020.dateinterviewend
                                       2122020.dateinterviewend 3112020.dateinterviewend
                                       3122020.dateinterviewend 4112020.dateinterviewend
                                       4122020.dateinterviewend 5112020.dateinterviewend
                                       5122020.dateinterviewend 6112020.dateinterviewend
                                       6122020.dateinterviewend 7112020.dateinterviewend
                                       7122020.dateinterviewend 8112020.dateinterviewend
                                       9112020.dateinterviewend 10112020.dateinterviewend
                                       11112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableToCOVID
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

Structural equation:

OLS using CHS lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
    unableToCOVID1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.0927998   .0265414    -3.50   0.000      -.14482   -.0407795
                   |
c.tmt_all#c.round2 |  -.2766222    .028313    -9.77   0.000    -.3321146   -.2211297
------------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
    unableToCOVID1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.0834228   .0258686    -3.22   0.001    -.1341244   -.0327212
                   |
c.tmt_all#c.round2 |  -.2631032   .0287304    -9.16   0.000    -.3194137   -.2067927
------------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
    unableToCOVID1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.0825158   .0262087    -3.15   0.002     -.133884   -.0311476
                   |
c.tmt_all#c.round2 |  -.2770876   .0289123    -9.58   0.000    -.3337546   -.2204206
                   |
  dateinterviewend |
          1122020  |  -.0445153   .0579212    -0.77   0.442    -.1580388    .0690081
          2112020  |   -.050617   .0625894    -0.81   0.419      -.17329     .072056
          2122020  |   .0395114   .0620971     0.64   0.525    -.0821966    .1612194
          3112020  |  -.0011644   .0621485    -0.02   0.985    -.1229733    .1206445
          3122020  |  -.0253199   .0666174    -0.38   0.704    -.1558875    .1052477
          4112020  |  -.0844992   .0615851    -1.37   0.170    -.2052039    .0362055
          4122020  |   .0172875    .069228     0.25   0.803     -.118397    .1529719
          5112020  |  -.0723994   .0660851    -1.10   0.273    -.2019239     .057125
          5122020  |  -.0512647   .0658588    -0.78   0.436    -.1803456    .0778162
          6112020  |  -.1961194   .0625392    -3.14   0.002     -.318694   -.0735449
          6122020  |  -.2295771   .0736512    -3.12   0.002    -.3739309   -.0852233
          7112020  |   -.220174    .064557    -3.41   0.001    -.3467033   -.0936447
          7122020  |   .1160356   .1052573     1.10   0.270    -.0902649    .3223362
          8112020  |  -.1842584   .0631502    -2.92   0.004    -.3080306   -.0604863
          9112020  |  -.3699431   .0700242    -5.28   0.000     -.507188   -.2326983
         10112020  |  -.3123955   .0635511    -4.92   0.000    -.4369534   -.1878376
         11112020  |  -.3616528   .0738234    -4.90   0.000     -.506344   -.2169616
         29112020  |    -.15968   .0687741    -2.32   0.020    -.2944746   -.0248853
         30112020  |  -.1205021   .0583999    -2.06   0.039    -.2349639   -.0060403
                   |
     unableToCOVID |   .2772799   .0214815    12.91   0.000      .235177    .3193828
                   |
         districtX |
              102  |   .0187227   .1293886     0.14   0.885    -.2348743    .2723198
              103  |   .1211253   .1324799     0.91   0.361    -.1385305    .3807811
              104  |   .0520894   .1761785     0.30   0.767    -.2932141    .3973929
              105  |   .0768645   .1440155     0.53   0.594    -.2054007    .3591296
              106  |   .3349427   .2251264     1.49   0.137     -.106297    .7761824
              107  |   .1538538   .1292006     1.19   0.234    -.0993747    .4070823
              108  |  -.3212286     .14551    -2.21   0.027    -.6064229   -.0360343
              109  |   -.020768   .1858769    -0.11   0.911    -.3850801    .3435441
              110  |  -.1326521   .1473097    -0.90   0.368    -.4213738    .1560695
              111  |   .0726263   .1894828     0.38   0.702    -.2987532    .4440057
              112  |  -.1931843   .2503603    -0.77   0.440    -.6838814    .2975128
              113  |   .0393486   .3127974     0.13   0.900     -.573723    .6524202
              114  |   -.034627    .168572    -0.21   0.837     -.365022     .295768
              115  |   .0770375   .1999848     0.39   0.700    -.3149254    .4690005
              116  |   .1390439   .1294664     1.07   0.283    -.1147056    .3927935
              117  |  -.2806062   .1469388    -1.91   0.056    -.5686009    .0073885
              201  |   .1753698   .1628929     1.08   0.282    -.1438944     .494634
              202  |   .1113551   .1657435     0.67   0.502    -.2134962    .4362065
              203  |   .0142843   .1809689     0.08   0.937    -.3404082    .3689768
              204  |    .169889   .1504075     1.13   0.259    -.1249043    .4646822
              205  |   .1490267   .1801152     0.83   0.408    -.2039926    .5020461
              206  |   .1422337   .1684846     0.84   0.399      -.18799    .4724574
              207  |   .0698391   .1291018     0.54   0.589    -.1831958     .322874
              208  |   .0361281   .1596657     0.23   0.821     -.276811    .3490671
              209  |   .5176618   .2195578     2.36   0.018     .0873363    .9479872
              210  |   .3079717   .1576921     1.95   0.051    -.0010991    .6170425
              211  |   .2462843    .164601     1.50   0.135    -.0763276    .5688963
              212  |   .0820471   .1831314     0.45   0.654    -.2768837     .440978
              213  |   .2163839   .1586002     1.36   0.172    -.0944667    .5272345
              214  |   .2904134   .1479434     1.96   0.050     .0004495    .5803772
              215  |   .3601284   .2306589     1.56   0.118    -.0919546    .8122115
              217  |   .3714579   .1716847     2.16   0.030     .0349621    .7079537
              218  |   .2391825   .1823775     1.31   0.190    -.1182708    .5966358
              219  |   .0819132   .2033332     0.40   0.687    -.3166126    .4804389
              220  |  -.0556012   .1828241    -0.30   0.761    -.4139297    .3027274
              301  |   .0789519   .1551863     0.51   0.611    -.2252076    .3831115
              302  |   .2914663   .1715865     1.70   0.089    -.0448371    .6277697
              303  |   .0947287   .1270073     0.75   0.456     -.154201    .3436584
              304  |   .0483186   .1358724     0.36   0.722    -.2179864    .3146236
              305  |   .2082122   .1666595     1.25   0.212    -.1184343    .5348587
              306  |  -.0305034   .1436663    -0.21   0.832    -.3120842    .2510774
              307  |   .0500868   .1672535     0.30   0.765    -.2777242    .3778977
              308  |   .0511588   .1774436     0.29   0.773    -.2966243     .398942
              309  |   .5563893   .1281617     4.34   0.000     .3051971    .8075816
              310  |   .3763514   .1311829     2.87   0.004     .1192377     .633465
              311  |  -.0421674   .1392317    -0.30   0.762    -.3150566    .2307217
              312  |   .2401926   .1457102     1.65   0.099    -.0453942    .5257794
              313  |  -.0401652   .1320834    -0.30   0.761     -.299044    .2187135
              314  |  -.2684306   .2580956    -1.04   0.298    -.7742886    .2374275
              315  |  -.0120544   .1621186    -0.07   0.941     -.329801    .3056923
              316  |   .2022789   .1772784     1.14   0.254    -.1451804    .5497381
              401  |  -.1583422   .1331058    -1.19   0.234    -.4192248    .1025405
              402  |   .0399362   .1513352     0.26   0.792    -.2566754    .3365478
              403  |   .0154647   .1498859     0.10   0.918    -.2783064    .3092357
              404  |  -.0918441   .1262386    -0.73   0.467    -.3392671    .1555789
              405  |  -.3004529   .1405679    -2.14   0.033    -.5759608   -.0249449
              406  |  -.2232844     .15078    -1.48   0.139    -.5188079     .072239
              408  |  -.0590042    .162929    -0.36   0.717    -.3783392    .2603308
              410  |    .482587   .1597736     3.02   0.003     .1694364    .7957376
              411  |  -.0429625   .1439813    -0.30   0.765    -.3251607    .2392357
              412  |  -.1771855   .1923844    -0.92   0.357     -.554252    .1998809
              413  |  -.1424805   .1569174    -0.91   0.364     -.450033     .165072
              414  |  -.0022536   .1330169    -0.02   0.986     -.262962    .2584547
              415  |  -.1032651   .1270102    -0.81   0.416    -.3522006    .1456704
              417  |  -.1760156    .203561    -0.86   0.387    -.5749877    .2229565
              418  |  -.2459681   .1357551    -1.81   0.070    -.5120432     .020107
              419  |   -.260255   .1686339    -1.54   0.123    -.5907714    .0702614
              421  |  -.3127397   .1952494    -1.60   0.109    -.6954215    .0699421
              422  |  -.1263274   .1301463    -0.97   0.332    -.3814095    .1287548
              423  |  -.2852366   .1358906    -2.10   0.036    -.5515773   -.0188959
              424  |  -.3982226   .1270885    -3.13   0.002    -.6473115   -.1491337
              425  |   .0957275   .1278389     0.75   0.454    -.1548322    .3462872
              501  |  -.0588871   .1551082    -0.38   0.704    -.3628936    .2451194
              502  |   .0320793   .2973763     0.11   0.914    -.5507676    .6149262
              503  |  -.1269857   .1274679    -1.00   0.319    -.3768181    .1228468
              504  |  -.1942826   .1314945    -1.48   0.140     -.452007    .0634418
              505  |  -.0522407   .1917236    -0.27   0.785     -.428012    .3235306
              506  |  -.2500305   .1365833    -1.83   0.067    -.5177289    .0176679
              507  |  -.2606094   .1492442    -1.75   0.081    -.5531227    .0319038
              508  |  -.3173617   .1316026    -2.41   0.016    -.5752982   -.0594253
              509  |  -.1885273   .1538364    -1.23   0.220    -.4900411    .1129865
              510  |  -.1773011    .142237    -1.25   0.213    -.4560805    .1014784
              512  |  -.2486976   .1403768    -1.77   0.076    -.5238312    .0264359
              513  |   -.268521   .1434514    -1.87   0.061    -.5496804    .0126385
              514  |  -.1328574   .1508557    -0.88   0.378    -.4285291    .1628143
              515  |  -.1921012   .1456008    -1.32   0.187    -.4774735    .0932711
              516  |  -.2679436   .1388242    -1.93   0.054     -.540034    .0041468
              517  |   .1596383   .1894443     0.84   0.399    -.2116657    .5309423
              518  |  -.3917806   .1708039    -2.29   0.022      -.72655   -.0570112
              519  |  -.3453778   .1265764    -2.73   0.006     -.593463   -.0972925
              522  |  -.1535567   .1647013    -0.93   0.351    -.4763653    .1692519
              523  |  -.2903224   .1301685    -2.23   0.026    -.5454479   -.0351968
              524  |  -.2665654    .155883    -1.71   0.087    -.5720905    .0389598
              525  |   -.095743   .1512513    -0.63   0.527    -.3921901     .200704
              526  |   .0281827   .2401197     0.12   0.907    -.4424432    .4988087
              601  |  -.3281732   .1668533    -1.97   0.049    -.6551997   -.0011466
              602  |  -.3420267   .2049947    -1.67   0.095    -.7438089    .0597555
              603  |  -.0660663   .1325964    -0.50   0.618    -.3259504    .1938178
              604  |  -.3260075   .1307431    -2.49   0.013    -.5822594   -.0697557
              605  |   .0885478     .16318     0.54   0.587    -.2312791    .4083748
              606  |  -.2332267   .1371831    -1.70   0.089    -.5021007    .0356473
              608  |   -.491383   .1375532    -3.57   0.000    -.7609823   -.2217837
              609  |  -.3878005   .1282698    -3.02   0.003    -.6392047   -.1363963
              611  |  -.1506143   .1565612    -0.96   0.336    -.4574685      .15624
              612  |  -.2588753   .1253878    -2.06   0.039     -.504631   -.0131197
              613  |  -.1105206   .1285545    -0.86   0.390    -.3624828    .1414415
              614  |  -.1797329   .1367428    -1.31   0.189     -.447744    .0882781
              615  |  -.3008887   .1260753    -2.39   0.017    -.5479917   -.0537857
              616  |   .4848334   .1454978     3.33   0.001     .1996629    .7700038
              618  |  -.3347388   .1590391    -2.10   0.035    -.6464498   -.0230278
              619  |  -.1756093   .1493762    -1.18   0.240    -.4683813    .1171628
              621  |   .5789692   .1306138     4.43   0.000     .3229708    .8349677
              622  |  -.3052428   .1376589    -2.22   0.027    -.5750493   -.0354363
              623  |  -.1750578   .1391179    -1.26   0.208    -.4477239    .0976084
              627  |  -.0861669   .2398087    -0.36   0.719    -.5561834    .3838496
              628  |   -.318461   .1404686    -2.27   0.023    -.5937744   -.0431477
              701  |  -.0840742   .1286402    -0.65   0.513    -.3362043    .1680558
              702  |   .1028333   .1714982     0.60   0.549    -.2332969    .4389636
              703  |    .004466    .167739     0.03   0.979    -.3242964    .3332285
              704  |    .099482   .1898532     0.52   0.600    -.2726236    .4715875
              705  |   .2673979   .2641221     1.01   0.311    -.2502719    .7850676
              706  |   .1734227   .2004826     0.87   0.387    -.2195161    .5663614
              707  |  -.1391762   .1768741    -0.79   0.431    -.4858432    .2074907
              708  |   .1400005   .1554248     0.90   0.368    -.1646264    .4446274
              709  |   .1636481    .225415     0.73   0.468    -.2781572    .6054534
              710  |   .2625782     .24487     1.07   0.284    -.2173583    .7425146
              711  |   .0141735   .1887337     0.08   0.940    -.3557377    .3840848
              712  |  -.0176338   .1580849    -0.11   0.911    -.3274745    .2922069
              713  |   .0360298   .1693544     0.21   0.832    -.2958987    .3679583
              714  |   .0193212   .2124825     0.09   0.928    -.3971369    .4357792
              715  |   .0457992   .1435466     0.32   0.750     -.235547    .3271453
              716  |  -.0356561   .1447727    -0.25   0.805    -.3194055    .2480933
              717  |   .0552501   .2210921     0.25   0.803    -.3780825    .4885827
              718  |   .1983298   .2075714     0.96   0.339    -.2085026    .6051621
              719  |   .2614527   .2087413     1.25   0.210    -.1476727    .6705781
              720  |   .1394366   .1528688     0.91   0.362    -.1601807     .439054
              721  |   .1584859   .2466627     0.64   0.521    -.3249641     .641936
              722  |  -.0910768     .14358    -0.63   0.526    -.3724884    .1903349
              723  |  -.1243509    .137335    -0.91   0.365    -.3935224    .1448207
              724  |    .106269   .1279819     0.83   0.406    -.1445709    .3571089
              725  |   .2659264   .2381085     1.12   0.264    -.2007576    .7326105
              726  |   .1386846   .1282312     1.08   0.279    -.1126438    .3900131
              727  |  -.3763564   .1530033    -2.46   0.014    -.6762374   -.0764754
              801  |   .2532221   .2224513     1.14   0.255    -.1827744    .6892186
              803  |   .8156321   .1320322     6.18   0.000     .5568537     1.07441
              804  |  -.1718627   .1446919    -1.19   0.235    -.4554536    .1117282
              805  |  -.2059178   .1801503    -1.14   0.253     -.559006    .1471704
              806  |   .0979618   .1703412     0.58   0.565    -.2359008    .4318243
              807  |   .1162785   .1984933     0.59   0.558    -.2727613    .5053182
              808  |   .0073734   .1589246     0.05   0.963    -.3041132    .3188599
              809  |   .3058312   .1337503     2.29   0.022     .0436855    .5679769
              810  |   .2173238   .2290237     0.95   0.343    -.2315545     .666202
              811  |   .0997961   .1447687     0.69   0.491    -.1839452    .3835375
              812  |   -.029391   .1429486    -0.21   0.837    -.3095652    .2507832
              813  |   .0560061   .1682438     0.33   0.739    -.2737456    .3857578
              814  |  -.1843679   .1320322    -1.40   0.163    -.4431463    .0744104
              815  |  -.0817974   .1279955    -0.64   0.523     -.332664    .1690691
              816  |    .218992    .167726     1.31   0.192     -.109745     .547729
              817  |  -.1162256   .1336039    -0.87   0.384    -.3780845    .1456332
              818  |  -.1243174   .1280143    -0.97   0.331    -.3752208    .1265861
              819  |   .0594136   .1570872     0.38   0.705    -.2484717    .3672988
              820  |  -.0853664   .2224653    -0.38   0.701    -.5213904    .3506575
              821  |  -.4616478   .1316199    -3.51   0.000    -.7196182   -.2036775
              822  |   .2123508    .128219     1.66   0.098    -.0389538    .4636555
              823  |    .067373   .1591615     0.42   0.672    -.2445778    .3793238
              825  |   .3226599    .264859     1.22   0.223    -.1964542     .841774
              826  |  -.1725069   .1331495    -1.30   0.195    -.4334751    .0884612
              901  |   .1659645   .2195014     0.76   0.450    -.2642503    .5961794
              902  |   .1317191   .1460448     0.90   0.367    -.1545235    .4179618
              903  |   .1322511   .1629984     0.81   0.417    -.1872199    .4517221
              904  |   .1349842   .1543495     0.87   0.382    -.1675352    .4375036
              905  |   .0430935   .1481159     0.29   0.771    -.2472084    .3333953
              906  |  -.0223057   .1392496    -0.16   0.873      -.29523    .2506185
              907  |  -.0976731   .1360003    -0.72   0.473    -.3642289    .1688827
              908  |   .1674994   .1549369     1.08   0.280    -.1361713      .47117
              909  |   .0962779    .146862     0.66   0.512    -.1915663     .384122
              910  |   .2620055   .1807563     1.45   0.147    -.0922704    .6162813
              911  |   .0261743   .1862525     0.14   0.888    -.3388738    .3912224
              912  |   .2738884   .1717062     1.60   0.111    -.0626496    .6104264
              913  |   .0785049   .1648187     0.48   0.634    -.2445338    .4015435
             1001  |  -.0371235   .1634899    -0.23   0.820    -.3575579    .2833108
             1002  |  -.0921352   .1442192    -0.64   0.523    -.3747997    .1905293
             1003  |   .0567927   .2252582     0.25   0.801    -.3847052    .4982907
             1004  |   .2349134   .1989849     1.18   0.238    -.1550898    .6249166
             1005  |   .0234091   .1491668     0.16   0.875    -.2689524    .3157706
             1006  |  -.1273613   .1712207    -0.74   0.457    -.4629478    .2082252
             1007  |  -.1108437   .1398623    -0.79   0.428    -.3849688    .1632813
             1008  |  -.1802066   .1662814    -1.08   0.278    -.5061122    .1456989
             1009  |  -.1659848   .1281988    -1.29   0.195    -.4172499    .0852803
             1010  |   .0377131   .2898918     0.13   0.896    -.5304643    .6058905
             1011  |  -.0696461   .2113647    -0.33   0.742    -.4839134    .3446212
                   |
             _cons |   .3686264   .1378219     2.67   0.007     .0985003    .6387524
------------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    c.tmt_all#c.round1 c.tmt_all#c.round2
------------------------------------------------------------------------------

. coefplot, keep(c.tmt_all#c.round1 c.tmt_all#c.round2) yline(0, lcolor(black) lw(thin) lp(dash)) vert
> ical xlab(, angle(45) labsize(medium)) level(90) graphregion(color(white)) plotregion(fcolor(white))
>  ylab(, nogrid) ///
> coeflabels(c.tmt_all#c.round1="Endline (round 1): Assignment" c.tmt_all#c.round2="Endline (round 2):
>  Assignment") title("Survey-level: unable to communicate or call due to COVID19 0-1", size(med))
(note:  named style med not found in class gsize, default attributes used)

. gr export "${replication_dir}/Output/Figures/figure_a6_2.eps", replace // meta_unableToCOVID
file
    /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replication/3-replicati
    > on-package/Output/Figures/figure_a6_2.eps saved as EPS format

.         
. *robust-indivi-level clustering?
. pdslasso unableToCOVID1 tmt_all (i.districtX i.dateinterviewend unableToCOVID female0 akan0 married0
>  ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var unableToCOVID1...
Warning: unable to store lasso estimation
Selected: 3112020.dateinterviewend 10112020.dateinterviewend 30112020.dateinterviewend unableToCOVID
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (33):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend unableToCOVID female0 akan0 married0
                                       ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (5):                 3112020.dateinterviewend 5122020.dateinterviewend
                                       10112020.dateinterviewend 30112020.dateinterviewend
                                       unableToCOVID
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0076704     -0.1618655
        30112020  |       0.0389208      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableToCO~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.1818352   .0214592    -8.47   0.000    -.2238944    -.139776
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
unableToCO~1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.1711724   .0211658    -8.09   0.000    -.2126567   -.1296882
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
  unableToCOVID1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |  -.1718966   .0214852    -8.00   0.000    -.2140068   -.1297864
                 |
dateinterviewend |
        3112020  |   .1434435   .0402722     3.56   0.000     .0645115    .2223756
        5122020  |  -.0054475   .0419505    -0.13   0.897     -.087669    .0767739
       10112020  |  -.1325908   .0423884    -3.13   0.002    -.2156705    -.049511
       30112020  |  -.1214066   .0304399    -3.99   0.000    -.1810677   -.0617455
                 |
   unableToCOVID |    .280488   .0213011    13.17   0.000     .2387385    .3222375
                 |
       districtX |
            102  |  -.0175978   .1137312    -0.15   0.877    -.2405069    .2053113
            103  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            104  |   .1469784   .1546928     0.95   0.342     -.156214    .4501708
            105  |   .1299884   .1341324     0.97   0.332    -.1329061     .392883
            106  |   .3943537    .240446     1.64   0.101    -.0769119    .8656193
            107  |  -.0241418   .1148932    -0.21   0.834    -.2493283    .2010448
            108  |  -.2630893   .1386528    -1.90   0.058    -.5348437    .0086651
            109  |   .0148368   .1823397     0.08   0.935    -.3425424    .3722159
            110  |  -.0724758   .1434975    -0.51   0.614    -.3537257     .208774
            111  |   .1351323    .179845     0.75   0.452    -.2173574    .4876221
            112  |  -.1387565   .2629263    -0.53   0.598    -.6540826    .3765695
            113  |   .0921582    .336686     0.27   0.784    -.5677343    .7520506
            114  |  -.0170631   .1571717    -0.11   0.914     -.325114    .2909877
            115  |   .0462709   .1841893     0.25   0.802    -.3147335    .4072754
            116  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            117  |  -.2341694   .1386167    -1.69   0.091    -.5058532    .0375143
            201  |   .2496397   .1605083     1.56   0.120    -.0649508    .5642301
            202  |   .1815993   .1572542     1.15   0.248    -.1266133     .489812
            203  |   .0587332   .1661956     0.35   0.724    -.2670042    .3844705
            204  |   .2321064   .1412767     1.64   0.100    -.0447908    .5090037
            205  |   .1684842   .1739773     0.97   0.333    -.1725049    .5094734
            206  |   .1893113   .1717038     1.10   0.270    -.1472219    .5258446
            207  |   .0729932   .1156616     0.63   0.528    -.1536994    .2996858
            208  |    .097171   .1493899     0.65   0.515    -.1956277    .3899698
            209  |   .5693998   .2110545     2.70   0.007     .1557405     .983059
            210  |   .3685638   .1406793     2.62   0.009     .0928374    .6442901
            211  |   .2905922   .1551477     1.87   0.061    -.0134917    .5946761
            212  |    .147036   .1757487     0.84   0.403     -.197425    .4914971
            213  |   .2549985   .1498159     1.70   0.089    -.0386352    .5486322
            214  |   .3413837   .1363328     2.50   0.012     .0741763    .6085911
            215  |    .371761   .1986639     1.87   0.061     -.017613     .761135
            217  |   .3520261    .157308     2.24   0.025     .0437081     .660344
            218  |   .3131684    .163978     1.91   0.056    -.0082226    .6345594
            219  |   .1310157   .1823251     0.72   0.472    -.2263348    .4883663
            220  |  -.0264438    .158796    -0.17   0.868    -.3376782    .2847907
            301  |   .1253383   .1479719     0.85   0.397    -.1646813    .4153578
            302  |   .3455755   .1691542     2.04   0.041     .0140394    .6771117
            303  |   .1367364   .1167147     1.17   0.241    -.0920203     .365493
            304  |   .0772721   .1255013     0.62   0.538    -.1687059    .3232502
            305  |   .2879988   .1516844     1.90   0.058    -.0092972    .5852948
            306  |   .0133142   .1332046     0.10   0.920    -.2477619    .2743903
            307  |   .0915507   .1692369     0.54   0.589    -.2401475     .423249
            308  |   .0868178   .1715226     0.51   0.613    -.2493603    .4229959
            309  |   .6477548    .114702     5.65   0.000     .4229431    .8725665
            310  |   .4758582   .1148932     4.14   0.000     .2506717    .7010448
            311  |   .0115985   .1342916     0.09   0.931    -.2516082    .2748052
            312  |   .2450247    .127667     1.92   0.055    -.0051981    .4952474
            313  |   .0075728   .1205566     0.06   0.950    -.2287138    .2438595
            314  |  -.2634399   .2162062    -1.22   0.223    -.6871964    .1603166
            315  |  -.0532043   .1702959    -0.31   0.755    -.3869782    .2805696
            316  |    .229689   .1691789     1.36   0.175    -.1018955    .5612735
            401  |  -.1349215   .1225091    -1.10   0.271     -.375035     .105192
            402  |    .093361   .1483523     0.63   0.529    -.1974042    .3841262
            403  |   .0592924    .137145     0.43   0.665    -.2095069    .3280916
            404  |  -.0921713   .1239283    -0.74   0.457    -.3350662    .1507237
            405  |  -.2766781   .1346265    -2.06   0.040    -.5405412    -.012815
            406  |  -.2446683   .1521694    -1.61   0.108    -.5429149    .0535782
            408  |  -.0300632   .1531885    -0.20   0.844    -.3303071    .2701808
            410  |   .4860023   .1942474     2.50   0.012     .1052845    .8667202
            411  |  -.0182929   .1394741    -0.13   0.896    -.2916571    .2550714
            412  |  -.1723807   .1871415    -0.92   0.357    -.5391714      .19441
            413  |   -.071321   .1479089    -0.48   0.630     -.361217    .2185751
            414  |   .0393356   .1225439     0.32   0.748    -.2008461    .2795172
            415  |  -.0110539   .1141943    -0.10   0.923    -.2348706    .2127628
            417  |  -.1292944   .2139819    -0.60   0.546    -.5486912    .2901024
            418  |   -.181082   .1266755    -1.43   0.153    -.4293613    .0671974
            419  |  -.1816495   .1665429    -1.09   0.275    -.5080676    .1447686
            421  |  -.2662359   .2142989    -1.24   0.214     -.686254    .1537821
            422  |  -.0414055   .1161149    -0.36   0.721    -.2689866    .1861755
            423  |  -.2688461   .1318485    -2.04   0.041    -.5272643   -.0104278
            424  |  -.3495214   .1152043    -3.03   0.002    -.5753176   -.1237252
            425  |   .1504786   .1152043     1.31   0.191    -.0753176    .3762748
            501  |  -.0337292   .1423933    -0.24   0.813    -.3128149    .2453565
            502  |   .0872187   .2942203     0.30   0.767    -.4894425    .6638799
            503  |  -.0581528   .1144664    -0.51   0.611    -.2825028    .1661972
            504  |  -.1769614   .1351947    -1.31   0.191    -.4419381    .0880152
            505  |  -.0049753   .1893303    -0.03   0.979    -.3760559    .3661053
            506  |  -.2253021   .1260943    -1.79   0.074    -.4724424    .0218381
            507  |  -.2264978   .1367832    -1.66   0.098     -.494588    .0415923
            508  |  -.2382063   .1196316    -1.99   0.046    -.4726799   -.0037326
            509  |   -.172242   .1365615    -1.26   0.207    -.4398976    .0954136
            510  |  -.1577055   .1297247    -1.22   0.224    -.4119612    .0965502
            512  |  -.1820684   .1360862    -1.34   0.181    -.4487925    .0846557
            513  |  -.2120012   .1516844    -1.40   0.162    -.5092972    .0852948
            514  |  -.0979611   .1395739    -0.70   0.483     -.371521    .1755988
            515  |   -.171105   .1303976    -1.31   0.189    -.4266795    .0844695
            516  |  -.2403776   .1271322    -1.89   0.059    -.4895522     .008797
            517  |   .2078088   .1767813     1.18   0.240    -.1386761    .5542938
            518  |  -.3383881   .1584491    -2.14   0.033    -.6489425   -.0278336
            519  |  -.3495214   .1152043    -3.03   0.002    -.5753176   -.1237252
            522  |  -.0815836   .1274325    -0.64   0.522    -.3313467    .1681794
            523  |  -.2436538   .1152306    -2.11   0.034    -.4695016    -.017806
            524  |  -.2478386   .1470558    -1.69   0.092    -.5360627    .0403855
            525  |  -.0664887   .1237007    -0.54   0.591    -.3089377    .1759603
            526  |   .0627015   .2618271     0.24   0.811    -.4504702    .5758731
            601  |  -.3151401   .1567341    -2.01   0.044    -.6223332    -.007947
            602  |  -.2979495   .1973455    -1.51   0.131    -.6847395    .0888406
            603  |  -.0241418   .1148932    -0.21   0.834    -.2493283    .2010448
            604  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            605  |   .0941545   .1558418     0.60   0.546    -.2112898    .3995987
            606  |  -.2255666   .1277028    -1.77   0.077    -.4758594    .0247263
            608  |  -.4368316   .1298553    -3.36   0.001    -.6913432   -.1823199
            609  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            611  |  -.1452193   .1577947    -0.92   0.357    -.4544913    .1640527
            612  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            613  |  -.0717572   .1144766    -0.63   0.531    -.2961271    .1526127
            614  |  -.1796341   .1275234    -1.41   0.159    -.4295754    .0703071
            615  |  -.3522452    .114702    -3.07   0.002    -.5770569   -.1274335
            616  |   .5618065   .1296746     4.33   0.000      .307649     .815964
            618  |   -.315199   .1550294    -2.03   0.042    -.6190511   -.0113469
            619  |  -.1577055   .1297247    -1.22   0.224    -.4119612    .0965502
            621  |   .4758582   .1148932     4.14   0.000     .2506717    .7010448
            622  |   -.316048   .1177041    -2.69   0.007    -.5467439   -.0853522
            623  |  -.1577055   .1222795    -1.29   0.197     -.397369     .081958
            627  |   -.006622   .2433667    -0.03   0.978     -.483612    .4703681
            628  |  -.2762215   .1302553    -2.12   0.034    -.5315172   -.0209258
            701  |   -.021418   .1150379    -0.19   0.852    -.2468881    .2040521
            702  |   .1742347   .1639545     1.06   0.288    -.1471102    .4955795
            703  |   .0638171   .1615825     0.39   0.693    -.2528788    .3805129
            704  |   .1119634   .1835208     0.61   0.542    -.2477307    .4716575
            705  |   .3303225   .2650337     1.25   0.213    -.1891341     .849779
            706  |   .1874875   .2056056     0.91   0.362     -.215492     .590467
            707  |  -.1079179   .1672957    -0.65   0.519    -.4358115    .2199757
            708  |   .1741395   .1419853     1.23   0.220    -.1041466    .4524256
            709  |    .198015   .2306622     0.86   0.391    -.2540747    .6501047
            710  |   .2625027   .2190995     1.20   0.231    -.1669244    .6919298
            711  |  -.0453616   .1810275    -0.25   0.802     -.400169    .3094457
            712  |   .0222341   .1451317     0.15   0.878    -.2622187    .3066869
            713  |   .0520797   .1629482     0.32   0.749    -.2672929    .3714523
            714  |   .0626929   .2064704     0.30   0.761    -.3419817    .4673675
            715  |   .0584459   .1343015     0.44   0.663    -.2047803    .3216721
            716  |   .0033593   .1333418     0.03   0.980    -.2579858    .2647044
            717  |   .0770505    .205587     0.37   0.708    -.3258926    .4799936
            718  |    .183952   .2224563     0.83   0.408    -.2520544    .6199584
            719  |   .3139203   .2054919     1.53   0.127    -.0888364     .716677
            720  |   .1481446   .1459773     1.01   0.310    -.1379655    .4342548
            721  |   .1749027     .26477     0.66   0.509     -.344037    .6938424
            722  |  -.0472685   .1333047    -0.35   0.723    -.3085409    .2140038
            723  |  -.0823535    .126832    -0.65   0.516    -.3309396    .1662326
            724  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            725  |   .3183505   .2609104     1.22   0.222    -.1930245    .8297255
            726  |   .1477548    .114702     1.29   0.198    -.0770569    .3725665
            727  |  -.4078418   .1209076    -3.37   0.001    -.6448163   -.1708673
            801  |   .2099637   .2326183     0.90   0.367    -.2459598    .6658871
            803  |   .7563462   .1152306     6.56   0.000     .5304984     .982194
            804  |  -.1395317   .1336388    -1.04   0.296     -.401459    .1223956
            805  |  -.1799123   .1832867    -0.98   0.326    -.5391477    .1793231
            806  |   .0633931   .1669748     0.38   0.704    -.2638716    .3906577
            807  |   .1151451   .1998686     0.58   0.565    -.2765902    .5068803
            808  |   .0299919   .1594517     0.19   0.851    -.2825277    .3425114
            809  |   .3118065   .1635053     1.91   0.057     -.008658    .6322711
            810  |   .2350938    .211683     1.11   0.267    -.1797973    .6499849
            811  |   .1306726   .1366829     0.96   0.339     -.137221    .3985662
            812  |   -.005714   .1399239    -0.04   0.967    -.2799598    .2685317
            813  |   .0660913   .1705111     0.39   0.698    -.2681043     .400287
            814  |  -.2436538   .1152306    -2.11   0.034    -.4695016    -.017806
            815  |  -.0561576    .115688    -0.49   0.627    -.2829019    .1705866
            816  |   .2347046   .1819763     1.29   0.197    -.1219624    .5913716
            817  |  -.0400136   .1149858    -0.35   0.728    -.2653816    .1853545
            818  |  -.0717572   .1144766    -0.63   0.531    -.2961271    .1526127
            819  |   .0810034   .1571399     0.52   0.606    -.2269852    .3889921
            820  |  -.0148018   .1999477    -0.07   0.941    -.4066921    .3770885
            821  |  -.5241418   .1148932    -4.56   0.000    -.7493283   -.2989552
            822  |   .2140502     .11673     1.83   0.067    -.0147364    .4428368
            823  |   .1177984   .1442156     0.82   0.414    -.1648588    .4004557
            825  |   .3443053   .2548729     1.35   0.177    -.1552365    .8438471
            826  |  -.2436538   .1152306    -2.11   0.034    -.4695016    -.017806
            901  |   .1782428   .2117848     0.84   0.400    -.2368479    .5933335
            902  |   .0055144   .1472994     0.04   0.970    -.2831871    .2942158
            903  |   .1228068   .1571963     0.78   0.435    -.1852923    .4309059
            904  |   .1550751   .1434196     1.08   0.280    -.1260221    .4361723
            905  |   .0376736   .1385077     0.27   0.786    -.2337965    .3091437
            906  |  -.0435072   .1312316    -0.33   0.740    -.3007165     .213702
            907  |  -.0991825    .127868    -0.78   0.438    -.3497992    .1514343
            908  |    .132995   .1471518     0.90   0.366    -.1554172    .4214072
            909  |   .1034929   .1360722     0.76   0.447    -.1632037    .3701894
            910  |    .208768   .1636185     1.28   0.202    -.1119185    .5294544
            911  |  -.0419496   .1945271    -0.22   0.829    -.4232158    .3393166
            912  |   .2243519   .1638277     1.37   0.171    -.0967445    .5454483
            913  |   .0461589   .1562633     0.30   0.768    -.2601116    .3524293
           1001  |   .0172853   .1565861     0.11   0.912    -.2896179    .3241885
           1002  |  -.0643561   .1285905    -0.50   0.617    -.3163889    .1876766
           1003  |   .0823333   .2211433     0.37   0.710    -.3510997    .5157663
           1004  |   .2615985    .165237     1.58   0.113    -.0622601    .5854572
           1005  |   .0545538   .1380252     0.40   0.693    -.2159706    .3250782
           1006  |   -.098268   .1620914    -0.61   0.544    -.4159613    .2194254
           1007  |  -.0665226   .1293007    -0.51   0.607    -.3199472    .1869021
           1008  |  -.1316411   .1547598    -0.85   0.395    -.4349647    .1716825
           1009  |  -.1434789   .1160946    -1.24   0.217    -.3710202    .0840623
           1010  |   .0876911   .2627326     0.33   0.739    -.4272554    .6026376
           1011  |   -.010321   .1977613    -0.05   0.958     -.397926     .377284
                 |
           _cons |   .2436538   .1152306     2.11   0.034      .017806    .4695016
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------

.         
.         
.         leebounds digitborrow1 tmt_all, level(90) cieffect tight() 

Lee (2009) treatment effect bounds

Number of obs.                     =   2260
Number of selected obs.            =   2045
Trimming porportion                =   0.0576
Effect 90% conf. interval          : [-0.3145  -0.1976]

------------------------------------------------------------------------------
digitborrow1 | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
tmt_all      |
       lower |  -.2829662   .0245831   -11.51   0.000    -.3234018   -.2425306
       upper |   -.221882   .0189087   -11.73   0.000     -.252984   -.1907799
------------------------------------------------------------------------------

.         local lee_lower = string(e(b)[1,1], "%15.3fc") // Lee (2009)

.         local lee_upper = string(e(b)[1,2], "%15.3fc")

.         local lee_bounds = "[`lee_lower'; `lee_upper']" 

.         local im_lower = string(e(cilower), "%15.3fc") // Imbens-Manski (2004)

.         local im_upper = string(e(ciupper), "%15.3fc")

.         local im_bounds = "[`im_lower'; `im_upper']"

.         
. eststo: reg digitborrow1 tmt_all, r cluster(districtX)

Linear regression                               Number of obs     =      2,045
                                                F(1, 191)         =     162.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0948
                                                Root MSE          =     .32721

                            (Std. err. adjusted for 192 clusters in districtX)
------------------------------------------------------------------------------
             |               Robust
digitborrow1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.2257413    .017721   -12.74   0.000    -.2606954   -.1907873
       _cons |   .2889222   .0176305    16.39   0.000     .2541466    .3236977
------------------------------------------------------------------------------
(est5 stored)

. sum digitborrow1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
digitborrow1 |        668    .2889222    .4536013          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.289"

. estadd local district_FE "No", replace

added macro:
        e(district_FE) : "No"

. estadd local survey_FE   "No", replace

added macro:
          e(survey_FE) : "No"

. estadd local controls    "None", replace

added macro:
           e(controls) : "None"

. estadd local rw_stat `rw_digitborrow1', replace

added macro:
            e(rw_stat) : "0.002"

. estadd local lee_bounds `lee_bounds', replace

added macro:
         e(lee_bounds) : "[-0.283; -0.222]"

. estadd local im_bounds `im_bounds', replace

added macro:
          e(im_bounds) : "[-0.314; -0.198]"

. 
. eststo: pdslasso digitborrow1 tmt_all (i.districtX i.dateinterviewend female0 akan0 married0 ageYrs0
>  jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var digitborrow1...
Warning: unable to store lasso estimation
Selected: 8112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (32):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend female0 akan0 married0 ageYrs0 jhs0
                                       hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (3):                 5122020.dateinterviewend 8112020.dateinterviewend
                                       30112020.dateinterviewend
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0080418     -0.1618655
        30112020  |       0.0391798      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.2243115   .0181153   -12.38   0.000    -.2598169   -.1888061
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.2212111   .0183335   -12.07   0.000    -.2571442    -.185278
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
    digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |  -.2213772   .0185022   -11.96   0.000     -.257641   -.1851135
                 |
dateinterviewend |
        5122020  |   .0636136   .0392011     1.62   0.105    -.0132191    .1404464
        8112020  |  -.1142514   .0233655    -4.89   0.000     -.160047   -.0684559
       30112020  |  -.0403956   .0215096    -1.88   0.060    -.0825536    .0017625
                 |
       districtX |
            102  |   .2488067   .2988089     0.83   0.405     -.336848    .8344613
            103  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            104  |   .0351449    .155291     0.23   0.821    -.2692199    .3395097
            105  |  -.1590598   .1332892    -1.19   0.233    -.4203018    .1021823
            106  |   .0027991   .1543214     0.02   0.986    -.2996652    .3052634
            107  |   .1280192   .1288564     0.99   0.320    -.1245348    .3805731
            108  |  -.1185085   .1532692    -0.77   0.439    -.4189106    .1818935
            109  |  -.1087965   .1456933    -0.75   0.455    -.3943502    .1767572
            110  |  -.1261933   .1574808    -0.80   0.423    -.4348499    .1824633
            111  |   -.070849   .1393834    -0.51   0.611    -.3440354    .2023374
            112  |  -.1312428   .1553105    -0.85   0.398    -.4356458    .1731603
            113  |  -.2511933   .1460918    -1.72   0.086     -.537528    .0351413
            114  |  -.1723745   .1356381    -1.27   0.204    -.4382203    .0934712
            115  |  -.2428441   .1341105    -1.81   0.070    -.5056959    .0200076
            116  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            117  |  -.2981884   .1457366    -2.05   0.041     -.583827   -.0125498
            201  |   .0754074   .1890893     0.40   0.690    -.2952008    .4460156
            202  |   -.190091   .1305805    -1.46   0.145    -.4460241     .065842
            203  |   .0361443   .1700073     0.21   0.832     -.297064    .3693525
            204  |  -.1104238    .132449    -0.83   0.404     -.370019    .1491715
            205  |  -.0018905   .1534498    -0.01   0.990    -.3026467    .2988656
            206  |   .0630263   .1501805     0.42   0.675     -.231322    .3573746
            207  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            208  |   -.097888   .1442471    -0.68   0.497    -.3806072    .1848312
            209  |  -.0310754   .1497632    -0.21   0.836    -.3246058     .262455
            210  |   .0382476   .1674371     0.23   0.819    -.2899231    .3664182
            211  |  -.0694449   .1522587    -0.46   0.648    -.3678665    .2289767
            212  |   .0965087   .1849862     0.52   0.602    -.2660577     .459075
            213  |  -.1381447   .1338989    -1.03   0.302    -.4005817    .1242923
            214  |  -.0370975   .1503285    -0.25   0.805     -.331736    .2575411
            215  |   .1241095   .2430552     0.51   0.610    -.3522699     .600489
            217  |  -.1723356   .1376172    -1.25   0.210    -.4420603    .0973891
            218  |   .4728044   .1542255     3.07   0.002     .1705279    .7750808
            219  |   .1347118   .2593141     0.52   0.603    -.3735345    .6429582
            220  |  -.1359233   .1380283    -0.98   0.325    -.4064538    .1346073
            301  |  -.1032851   .1438233    -0.72   0.473    -.3851735    .1786034
            302  |  -.2260116   .1368061    -1.65   0.099    -.4941467    .0421234
            303  |  -.1304058   .1265397    -1.03   0.303    -.3784191    .1176074
            304  |  -.0689836   .1320403    -0.52   0.601    -.3277778    .1898105
            305  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            306  |  -.1137417   .1368945    -0.83   0.406    -.3820499    .1545666
            307  |   .0172396   .1904983     0.09   0.928    -.3561302    .3906094
            308  |  -.0410706   .1483356    -0.28   0.782    -.3318031    .2496619
            309  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            310  |   .1280192   .1288564     0.99   0.320    -.1245348    .3805731
            311  |  -.0809479   .1839138    -0.44   0.660    -.4414124    .2795165
            312  |  -.0666665   .1393361    -0.48   0.632    -.3397602    .2064273
            313  |  -.0456139   .1385768    -0.33   0.742    -.3172195    .2259917
            314  |  -.2771956   .1555095    -1.78   0.075    -.5819887    .0275974
            315  |    .098335   .1688387     0.58   0.560    -.2325827    .4292527
            316  |  -.2511933   .1536689    -1.63   0.102    -.5523789    .0499922
            401  |   7.39e-14   .1660861     0.00   1.000    -.3255228    .3255228
            402  |  -.1395403   .1366819    -1.02   0.307    -.4074318    .1283512
            403  |  -.0751945   .1606718    -0.47   0.640    -.3901055    .2397165
            404  |  -.1774009   .1316142    -1.35   0.178      -.43536    .0805581
            405  |  -.1088247   .1750257    -0.62   0.534    -.4518687    .2342193
            406  |  -.0577293   .1819787    -0.32   0.751     -.414401    .2989423
            408  |  -.1815479   .1342005    -1.35   0.176    -.4445761    .0814802
            410  |  -.2391545   .1435218    -1.67   0.096     -.520452     .042143
            411  |  -.0617348   .1511515    -0.41   0.683    -.3579864    .2345167
            412  |  -.0683316   .2096867    -0.33   0.745      -.47931    .3426468
            413  |  -.0062428   .1441661    -0.04   0.965    -.2888032    .2763177
            414  |   .0944654   .1648573     0.57   0.567    -.2286491    .4175798
            415  |  -.1304058   .1265397    -1.03   0.303    -.3784191    .1176074
            417  |  -.0888996   .1869818    -0.48   0.634    -.4553773    .2775781
            418  |  -.1440841   .1377005    -1.05   0.295    -.4139721    .1258039
            419  |  -.1405047   .1265353    -1.11   0.267    -.3885093    .1074998
            421  |  -.0170967   .1504676    -0.11   0.910    -.3120078    .2778143
            422  |  -.1405047   .1265353    -1.11   0.267    -.3885093    .1074998
            423  |  -.1463638   .1400856    -1.04   0.296    -.4209266     .128199
            424  |  -.1824104   .1261275    -1.45   0.148    -.4296158    .0647949
            425  |  -.1824104   .1261275    -1.45   0.148    -.4296158    .0647949
            501  |  -.1058212   .1534409    -0.69   0.490    -.4065598    .1949175
            502  |  -.0393718   .1813903    -0.22   0.828    -.3948902    .3161467
            503  |   .0881817    .221282     0.40   0.690    -.3455231    .5218864
            504  |  -.2176634   .1419454    -1.53   0.125    -.4958713    .0605445
            505  |  -.0666665   .1393361    -0.48   0.632    -.3397602    .2064273
            506  |   .1608455   .2289238     0.70   0.482     -.287837     .609528
            507  |  -.1077386   .1513896    -0.71   0.477    -.4044568    .1889797
            508  |  -.4355945    .130386    -3.34   0.001    -.6911463   -.1800426
            509  |  -.1298088   .1427911    -0.91   0.363    -.4096742    .1500566
            510  |   .0172706    .174239     0.10   0.921    -.3242316    .3587729
            512  |  -.0546755   .2004753    -0.27   0.785    -.4475998    .3382489
            513  |   .0993964   .2184692     0.45   0.649    -.3287953    .5275881
            514  |  -.2981884   .1457366    -2.05   0.041     -.583827   -.0125498
            515  |  -.1997985    .133916    -1.49   0.136    -.4622691     .062672
            516  |    .112385   .1656862     0.68   0.498     -.212354    .4371239
            517  |  -.0057708   .1599581    -0.04   0.971    -.3192829    .3077413
            518  |  -.2391545   .1435218    -1.67   0.096     -.520452     .042143
            519  |  -.1538476    .127894    -1.20   0.229    -.4045152    .0968201
            522  |  -.2059479   .1370588    -1.50   0.133    -.4745783    .0626824
            523  |  -.3719808   .1288564    -2.89   0.004    -.6245348   -.1194269
            524  |  -.0550693   .1623022    -0.34   0.734    -.3731757    .2630371
            525  |  -.2109308   .1396119    -1.51   0.131    -.4845652    .0627035
            526  |   .1481228   .2735621     0.54   0.588    -.3880491    .6842946
            601  |  -.0492897   .1405568    -0.35   0.726     -.324776    .2261965
            602  |  -.2327294   .1613998    -1.44   0.149    -.5490672    .0836085
            603  |  -.3719808   .1288564    -2.89   0.004    -.6245348   -.1194269
            604  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            605  |   .0738186   .1480743     0.50   0.618    -.2164018     .364039
            606  |  -.1026224   .2020871    -0.51   0.612    -.4987058     .293461
            608  |  -.0271956   .1681722    -0.16   0.872     -.356807    .3024157
            609  |   .3493964   .1263497     2.77   0.006     .1017556    .5970372
            611  |  -.1916665   .1376606    -1.39   0.164    -.4614762    .0781433
            612  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            613  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            614  |  -.1268696   .1317768    -0.96   0.336    -.3851474    .1314081
            615  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            616  |   .0172706   .1751287     0.10   0.921    -.3259753    .3605166
            618  |  -.2549625   .1374387    -1.86   0.064    -.5243374    .0144124
            619  |   .0172706   .1751287     0.10   0.921    -.3259753    .3605166
            621  |   .1280192   .1288564     0.99   0.320    -.1245348    .3805731
            622  |  -.0577293   .1481355    -0.39   0.697    -.3480697     .232611
            623  |  -.1362922   .1956734    -0.70   0.486    -.5198051    .2472206
            627  |   -.224396   .1406766    -1.60   0.111     -.500117     .051325
            628  |   -.136523   .1666103    -0.82   0.413    -.4630731    .1900271
            701  |  -.4037877    .128133    -3.15   0.002    -.6549237   -.1526516
            702  |  -.1170168   .1424627    -0.82   0.411    -.3962386    .1622051
            703  |  -.0429552    .136202    -0.32   0.752    -.3099062    .2239957
            704  |  -.1688405   .1351401    -1.25   0.212    -.4337101    .0960292
            705  |  -.2008985   .1361918    -1.48   0.140    -.4678294    .0660325
            706  |  -.1442439   .1517345    -0.95   0.342     -.441638    .1531502
            707  |  -.1501126   .1349237    -1.11   0.266    -.4145582     .114333
            708  |  -.1733781   .1338061    -1.30   0.195    -.4356334    .0888771
            709  |  -.1315218   .1744767    -0.75   0.451    -.4734899    .2104463
            710  |  -.2391545   .1361123    -1.76   0.079    -.5059296    .0276206
            711  |  -.2183981   .1319167    -1.66   0.098    -.4769501     .040154
            712  |   -.023033   .1366927    -0.17   0.866    -.2909458    .2448798
            713  |    .025604   .1907412     0.13   0.893    -.3482418    .3994498
            714  |  -.0357377   .1701179    -0.21   0.834    -.3691625    .2976872
            715  |  -.1708089   .1322868    -1.29   0.197    -.4300862    .0884685
            716  |  -.1757096   .1347162    -1.30   0.192    -.4397485    .0883294
            717  |  -.1362922   .1554324    -0.88   0.381    -.4409341    .1683496
            718  |  -.0577293   .1481355    -0.39   0.697    -.3480697     .232611
            719  |   .0101847    .151289     0.07   0.946    -.2863362    .3067057
            720  |  -.1442589   .1332637    -1.08   0.279    -.4054509    .1169331
            721  |   -.177385   .1393668    -1.27   0.203     -.450539     .095769
            722  |  -.2549625   .1382798    -1.84   0.065    -.5259859    .0160609
            723  |  -.1281754   .1402641    -0.91   0.361    -.4030881    .1467372
            724  |  -.0934779   .1267115    -0.74   0.461    -.3418278    .1548721
            725  |  -.1405047   .1265353    -1.11   0.267    -.3885093    .1074998
            726  |  -.0934779   .1267115    -0.74   0.461    -.3418278    .1548721
            727  |   .0559324   .1654878     0.34   0.735    -.2684176    .3802824
            801  |   -.052385   .1818304    -0.29   0.773    -.4087661     .303996
            803  |   .7422706   .1305935     5.68   0.000      .486312    .9982292
            804  |   -.033601   .1677904    -0.20   0.841    -.3624641    .2952621
            805  |  -.0709971   .1954399    -0.36   0.716    -.4540522     .312058
            806  |   .0611592    .166326     0.37   0.713    -.2648338    .3871521
            807  |  -.0889106   .1348402    -0.66   0.510    -.3531926    .1753713
            808  |  -.0927353   .1478661    -0.63   0.531    -.3825476     .197077
            809  |  -.2612922    .149751    -1.74   0.081    -.5547989    .0322144
            810  |   .1608455   .2670526     0.60   0.547     -.362568     .684259
            811  |  -.1483978   .1343572    -1.10   0.269     -.411733    .1149375
            812  |    .117377   .2087098     0.56   0.574    -.2916867    .5264406
            813  |  -.0342124   .1718457    -0.20   0.842    -.3710237     .302599
            814  |  -.2577294   .1305935    -1.97   0.048     -.513688   -.0017708
            815  |  -.0275994   .1761483    -0.16   0.875    -.3728439     .317645
            816  |   -.194879   .1339863    -1.45   0.146    -.4574873    .0677292
            817  |   .0732287    .166894     0.44   0.661    -.2538774    .4003349
            818  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            819  |  -.0552873   .1604068    -0.34   0.730    -.3696789    .2591043
            820  |  -.2612922    .149751    -1.74   0.081    -.5547989    .0322144
            821  |   .7422706   .1305935     5.68   0.000      .486312    .9982292
            822  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            823  |  -.0932887    .146311    -0.64   0.524    -.3800529    .1934755
            825  |  -.2549625   .1382798    -1.84   0.065    -.5259859    .0160609
            826  |  -.3719808   .1288564    -2.89   0.004    -.6245348   -.1194269
            901  |   .1565221    .219845     0.71   0.476    -.2743662    .5874105
            902  |  -.2391545   .1361123    -1.76   0.079    -.5059296    .0276206
            903  |   .0417716   .1543041     0.27   0.787    -.2606589    .3442021
            904  |   .0394031   .1492999     0.26   0.792    -.2532194    .3320256
            905  |  -.0427196   .1597107    -0.27   0.789    -.3557469    .2703077
            906  |  -.0111421   .1408189    -0.08   0.937     -.287142    .2648578
            907  |  -.0887875   .1373278    -0.65   0.518     -.357945    .1803699
            908  |   .1109607   .1525402     0.73   0.467    -.1880125    .4099339
            909  |   .1722141   .1410495     1.22   0.222    -.1042379    .4486661
            910  |   .0609187   .1656551     0.37   0.713    -.2637594    .3855968
            911  |  -.0666665   .1785184    -0.37   0.709    -.4165561    .2832232
            912  |   .0159093   .1461178     0.11   0.913    -.2704763    .3022949
            913  |  -.0323401   .1432634    -0.23   0.821    -.3131313     .248451
           1001  |  -.0196455   .1523856    -0.13   0.897    -.3183158    .2790248
           1002  |    -.16035   .1382999    -1.16   0.246    -.4314129    .1107128
           1003  |  -.0695687   .1402624    -0.50   0.620     -.344478    .2053405
           1004  |   -.052385   .1774497    -0.30   0.768    -.4001801      .29541
           1005  |  -.1691707   .1311113    -1.29   0.197    -.4261441    .0878027
           1006  |  -.2219833   .1338135    -1.66   0.097     -.484253    .0402864
           1007  |  -.2274122   .1363434    -1.67   0.095    -.4946403     .039816
           1008  |  -.1921371   .1349251    -1.42   0.154    -.4565855    .0723113
           1009  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
           1010  |  -.2092238   .1430894    -1.46   0.144    -.4896738    .0712262
           1011  |  -.2549625   .1374387    -1.86   0.064    -.5243374    .0144124
                 |
           _cons |   .3719808   .1288564     2.89   0.004     .1194269    .6245348
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------
(est6 stored)

. sum digitborrow1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
digitborrow1 |        668    .2889222    .4536013          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.289"

. estadd local district_FE "Yes", replace

added macro:
        e(district_FE) : "Yes"

. estadd local survey_FE   "Yes", replace

added macro:
          e(survey_FE) : "Yes"

. estadd local controls    "PD Lasso", replace

added macro:
           e(controls) : "PD Lasso"

. estadd local rw_stat "", replace

added macro:
            e(rw_stat) : ""

. estadd local lee_bounds "", replace

added macro:
         e(lee_bounds) : ""

. estadd local im_bounds "", replace

added macro:
          e(im_bounds) : ""

. 
. *dyna fig
. pdslasso digitborrow1 c.tmt_all#c.round1 c.tmt_all#c.round2 (i.districtX i.dateinterviewend female0 
> akan0 married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var digitborrow1...
Warning: unable to store lasso estimation
Selected: 8112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round1...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2122020.dateinterviewend 3122020.dateinterviewend
          4122020.dateinterviewend 5122020.dateinterviewend 6122020.dateinterviewend
          7122020.dateinterviewend 29112020.dateinterviewend 30112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round2...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2112020.dateinterviewend 3112020.dateinterviewend
          4112020.dateinterviewend 5112020.dateinterviewend 6112020.dateinterviewend
          7112020.dateinterviewend 8112020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend 11112020.dateinterviewend 29112020.dateinterviewend
          30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (2):                         c.tmt_all#c.round1 c.tmt_all#c.round2
High-dim controls (32):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend female0 akan0 married0 ageYrs0 jhs0
                                       hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (19):                1122020.dateinterviewend 2112020.dateinterviewend
                                       2122020.dateinterviewend 3112020.dateinterviewend
                                       3122020.dateinterviewend 4112020.dateinterviewend
                                       4122020.dateinterviewend 5112020.dateinterviewend
                                       5122020.dateinterviewend 6112020.dateinterviewend
                                       6122020.dateinterviewend 7112020.dateinterviewend
                                       7122020.dateinterviewend 8112020.dateinterviewend
                                       9112020.dateinterviewend 10112020.dateinterviewend
                                       11112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

Structural equation:

OLS using CHS lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
      digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |   -.211712   .0216819    -9.76   0.000    -.2542078   -.1692163
                   |
c.tmt_all#c.round2 |  -.2143511   .0252937    -8.47   0.000    -.2639258   -.1647764
------------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
      digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.1949713   .0227407    -8.57   0.000    -.2395422   -.1504004
                   |
c.tmt_all#c.round2 |  -.2162631   .0268051    -8.07   0.000       -.2688   -.1637261
------------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
      digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |   -.196973   .0229329    -8.59   0.000    -.2419207   -.1520254
                   |
c.tmt_all#c.round2 |  -.2423716   .0275013    -8.81   0.000    -.2962731   -.1884701
                   |
  dateinterviewend |
          1122020  |   -.007423   .0519875    -0.14   0.886    -.1093167    .0944707
          2112020  |   .0242781   .0522505     0.46   0.642     -.078131    .1266872
          2122020  |   .1495231   .0561295     2.66   0.008     .0395112    .2595349
          3112020  |  -.0673192   .0488275    -1.38   0.168    -.1630194    .0283811
          3122020  |   .0991054   .0581702     1.70   0.088    -.0149061    .2131169
          4112020  |   .0185181   .0494055     0.37   0.708    -.0783149    .1153511
          4122020  |   .1076268   .0592127     1.82   0.069     -.008428    .2236816
          5112020  |  -.0225107   .0500423    -0.45   0.653    -.1205917    .0755704
          5122020  |   .0976151   .0586231     1.67   0.096    -.0172841    .2125142
          6112020  |    .055055   .0558212     0.99   0.324    -.0543526    .1644626
          6122020  |    .046159   .0636972     0.72   0.469    -.0786852    .1710032
          7112020  |   -.012709   .0512592    -0.25   0.804    -.1131751    .0877571
          7122020  |   .2564758   .0997413     2.57   0.010     .0609865    .4519652
          8112020  |  -.0967644   .0470787    -2.06   0.040     -.189037   -.0044917
          9112020  |  -.1138153   .0572001    -1.99   0.047    -.2259255   -.0017051
         10112020  |  -.0743824   .0503202    -1.48   0.139    -.1730082    .0242434
         11112020  |  -.1841178   .0581977    -3.16   0.002    -.2981832   -.0700524
         29112020  |   .0829168   .0599403     1.38   0.167    -.0345639    .2003976
         30112020  |  -.0022236    .052269    -0.04   0.966     -.104669    .1002218
                   |
         districtX |
              102  |   .2308478   .2612198     0.88   0.377    -.2811335    .7428292
              103  |  -.2034347   .1177885    -1.73   0.084    -.4342959    .0274265
              104  |    .014867   .1538635     0.10   0.923    -.2866999    .3164339
              105  |  -.1883718   .1235275    -1.52   0.127    -.4304812    .0537376
              106  |  -.0018562   .1515451    -0.01   0.990     -.298879    .2951667
              107  |   .1614952   .1189896     1.36   0.175    -.0717201    .3947105
              108  |  -.1119875   .1434828    -0.78   0.435    -.3932086    .1692335
              109  |  -.1122883   .1370762    -0.82   0.413    -.3809527    .1563761
              110  |  -.1594872   .1623588    -0.98   0.326    -.4777045    .1587301
              111  |    -.09775   .1332776    -0.73   0.463    -.3589693    .1634693
              112  |  -.1365629   .1493467    -0.91   0.361     -.429277    .1561512
              113  |  -.2948091   .1333537    -2.21   0.027    -.5561776   -.0334407
              114  |  -.1933924   .1261093    -1.53   0.125    -.4405621    .0537773
              115  |  -.2300327   .1226277    -1.88   0.061    -.4703786    .0103131
              116  |  -.2062581   .1175225    -1.76   0.079     -.436598    .0240818
              117  |  -.3519788   .1233204    -2.85   0.004    -.5936824   -.1102753
              201  |   .0541635   .1825488     0.30   0.767    -.3036255    .4119524
              202  |  -.2231529   .1206167    -1.85   0.064    -.4595573    .0132516
              203  |   .0083149   .1618945     0.05   0.959    -.3089925    .3256223
              204  |  -.1433028   .1243249    -1.15   0.249    -.3869751    .1003695
              205  |  -.0231048   .1490739    -0.15   0.877    -.3152843    .2690747
              206  |   .0290291   .1451707     0.20   0.842    -.2555003    .3135584
              207  |  -.1518008   .1173377    -1.29   0.196    -.3817785    .0781769
              208  |  -.1130981   .1364651    -0.83   0.407    -.3805649    .1543687
              209  |  -.0398091   .1292473    -0.31   0.758    -.2931292     .213511
              210  |   .0244526   .1541344     0.16   0.874    -.2776453    .3265505
              211  |  -.0948148   .1439554    -0.66   0.510    -.3769622    .1873327
              212  |   .0868401   .1733283     0.50   0.616    -.2528772    .4265574
              213  |  -.1646551   .1253792    -1.31   0.189    -.4103937    .0810836
              214  |  -.0677006   .1423731    -0.48   0.634    -.3467467    .2113455
              215  |   .0806358   .2275622     0.35   0.723     -.365378    .5266496
              217  |   -.207931   .1227366    -1.69   0.090    -.4484903    .0326283
              218  |   .4164596   .1608905     2.59   0.010       .10112    .7317993
              219  |   .1339245   .2531346     0.53   0.597    -.3622102    .6300592
              220  |  -.1538019   .1289238    -1.19   0.233    -.4064878     .098884
              301  |  -.1206961   .1305283    -0.92   0.355     -.376527    .1351347
              302  |  -.2345579   .1255977    -1.87   0.062    -.4807249     .011609
              303  |  -.1178892    .116754    -1.01   0.313    -.3467229    .1109444
              304  |  -.0808647   .1213708    -0.67   0.505    -.3187472    .1570177
              305  |  -.2138196   .1179818    -1.81   0.070    -.4450596    .0174205
              306  |   -.131442   .1277031    -1.03   0.303    -.3817355    .1188515
              307  |   .0011008   .1818656     0.01   0.995    -.3553492    .3575508
              308  |   -.059671    .141197    -0.42   0.673    -.3364119    .2170699
              309  |  -.2366812    .118298    -2.00   0.045     -.468541   -.0048214
              310  |   .1313786   .1214286     1.08   0.279    -.1066171    .3693743
              311  |  -.1165203   .1660918    -0.70   0.483    -.4420541    .2090136
              312  |  -.1227386   .1273067    -0.96   0.335    -.3722552    .1267779
              313  |  -.0472008   .1265011    -0.37   0.709    -.2951384    .2007367
              314  |  -.2834065   .1475663    -1.92   0.055    -.5726311    .0058181
              315  |   .1247205   .1412763     0.88   0.377     -.152176    .4016169
              316  |  -.2246597   .1410309    -1.59   0.111    -.5010751    .0517557
              401  |  -.0103346   .1608292    -0.06   0.949    -.3255541    .3048849
              402  |  -.1546805   .1303795    -1.19   0.235    -.4102196    .1008585
              403  |  -.0792263   .1555551    -0.51   0.611    -.3841088    .2256561
              404  |   -.165998   .1220363    -1.36   0.174    -.4051847    .0731887
              405  |  -.1239237   .1596216    -0.78   0.438    -.4367763    .1889288
              406  |  -.0791706    .180434    -0.44   0.661    -.4328147    .2744736
              408  |   -.193749   .1230773    -1.57   0.115     -.434976    .0474781
              410  |  -.2542629   .1505254    -1.69   0.091    -.5492873    .0407616
              411  |  -.0837571   .1404425    -0.60   0.551    -.3590193    .1915051
              412  |  -.0866054   .2134227    -0.41   0.685    -.5049063    .3316955
              413  |  -.0453601   .1355898    -0.33   0.738    -.3111111     .220391
              414  |   .0599323   .1611649     0.37   0.710    -.2559451    .3758097
              415  |  -.1636879   .1166151    -1.40   0.160    -.3922492    .0648735
              417  |  -.1499553   .1717056    -0.87   0.382    -.4864921    .1865816
              418  |  -.1558653   .1247114    -1.25   0.211    -.4002952    .0885645
              419  |  -.1773229   .1165887    -1.52   0.128    -.4058326    .0511867
              421  |  -.0561779   .1388326    -0.40   0.686    -.3282847    .2159289
              422  |  -.1987445   .1202537    -1.65   0.098    -.4344375    .0369484
              423  |  -.1955514   .1332794    -1.47   0.142    -.4567743    .0656715
              424  |  -.2107272   .1163908    -1.81   0.070    -.4388491    .0173947
              425  |  -.1902128   .1164348    -1.63   0.102    -.4184208    .0379951
              501  |  -.1390416   .1451493    -0.96   0.338     -.423529    .1454458
              502  |  -.0780519   .1735795    -0.45   0.653    -.4182615    .2621578
              503  |   .0495002   .2132947     0.23   0.816    -.3685497    .4675501
              504  |  -.2269635   .1395854    -1.63   0.104    -.5005458    .0466189
              505  |  -.1093623   .1278361    -0.86   0.392    -.3599163    .1411918
              506  |   .1116541   .2192414     0.51   0.611    -.3180512    .5413595
              507  |  -.1457194   .1409735    -1.03   0.301    -.4220223    .1305836
              508  |   -.469948   .1203992    -3.90   0.000    -.7059261     -.23397
              509  |  -.1587203   .1350082    -1.18   0.240    -.4233315     .105891
              510  |  -.0268458   .1609451    -0.17   0.868    -.3422924    .2886009
              512  |  -.1293845   .2044615    -0.63   0.527    -.5301217    .2713527
              513  |   .0418568   .2076343     0.20   0.840     -.365099    .4488126
              514  |   -.257087   .1413449    -1.82   0.069    -.5341179    .0199439
              515  |  -.2367098   .1257172    -1.88   0.060     -.483111    .0096913
              516  |   .0495508   .1572032     0.32   0.753    -.2585619    .3576634
              517  |  -.0425307   .1504126    -0.28   0.777    -.3373341    .2522726
              518  |  -.2559366   .1321276    -1.94   0.053     -.514902    .0030288
              519  |  -.1910408   .1190884    -1.60   0.109    -.4244498    .0423682
              522  |  -.2724782   .1606436    -1.70   0.090    -.5873339    .0423775
              523  |   -.474622   .1212272    -3.92   0.000    -.7122228   -.2370211
              524  |   -.071581   .1469622    -0.49   0.626    -.3596217    .2164596
              525  |  -.2275723    .132467    -1.72   0.086    -.4872029    .0320583
              526  |   .1275969   .2519399     0.51   0.613    -.3661963    .6213901
              601  |  -.0661104   .1330845    -0.50   0.619    -.3269513    .1947305
              602  |   -.326831   .1586797    -2.06   0.039    -.6378375   -.0158244
              603  |  -.4137914   .1225481    -3.38   0.001    -.6539813   -.1736014
              604  |  -.1878792    .117862    -1.59   0.111    -.4188844     .043126
              605  |   .0424256   .1365142     0.31   0.756    -.2251374    .3099886
              606  |  -.1540859   .2063408    -0.75   0.455    -.5585066    .2503347
              608  |  -.0941146   .1447959    -0.65   0.516    -.3779093    .1896801
              609  |   .2450504   .1186711     2.06   0.039     .0124592    .4776415
              611  |  -.2515065    .127612    -1.97   0.049    -.5016215   -.0013915
              612  |  -.0920414   .1156596    -0.80   0.426    -.3187301    .1346472
              613  |  -.2549496   .1186711    -2.15   0.032    -.4875408   -.0223585
              614  |  -.1502249   .1214312    -1.24   0.216    -.3882256    .0877759
              615  |  -.1705145   .1169428    -1.46   0.145    -.3997182    .0586892
              616  |  -.0566384   .1383963    -0.41   0.682    -.3278902    .2146133
              618  |   -.285323   .1307359    -2.18   0.029    -.5415607   -.0290853
              619  |  -.0368115   .1625514    -0.23   0.821    -.3554063    .2817833
              621  |   .1109421   .1193169     0.93   0.352    -.1229147    .3447988
              622  |  -.0930559   .1507472    -0.62   0.537     -.388515    .2024033
              623  |  -.1746242    .187343    -0.93   0.351    -.5418097    .1925612
              627  |    -.23988   .1342884    -1.79   0.074    -.5030804    .0233204
              628  |  -.1954151   .1568238    -1.25   0.213    -.5027841    .1119539
              701  |  -.4098851   .1181209    -3.47   0.001    -.6413978   -.1783725
              702  |  -.1572148   .1326011    -1.19   0.236    -.4171082    .1026786
              703  |  -.1084122   .1304824    -0.83   0.406    -.3641531    .1473287
              704  |  -.2108535   .1250229    -1.69   0.092     -.455894    .0341869
              705  |  -.2642606   .1256707    -2.10   0.035    -.5105707   -.0179505
              706  |  -.1871073   .1396181    -1.34   0.180    -.4607536    .0865391
              707  |  -.2147356   .1255155    -1.71   0.087    -.4607414    .0312703
              708  |  -.2109321    .123586    -1.71   0.088    -.4531563     .031292
              709  |  -.1091601   .1600034    -0.68   0.495    -.4227609    .2044408
              710  |  -.2785854   .1289838    -2.16   0.031    -.5313891   -.0257818
              711  |  -.2496882   .1216017    -2.05   0.040    -.4880232   -.0113532
              712  |  -.0905187    .130934    -0.69   0.489    -.3471447    .1661073
              713  |  -.0096877   .1813424    -0.05   0.957    -.3651123    .3457368
              714  |  -.0760495   .1565189    -0.49   0.627    -.3828209    .2307218
              715  |  -.2040053   .1212311    -1.68   0.092    -.4416138    .0336032
              716  |  -.2165296   .1266001    -1.71   0.087    -.4646611     .031602
              717  |  -.1699644   .1532648    -1.11   0.267    -.4703579     .130429
              718  |  -.0944647   .1440478    -0.66   0.512    -.3767932    .1878639
              719  |  -.0450793   .1515218    -0.30   0.766    -.3420566     .251898
              720  |  -.1789057   .1247913    -1.43   0.152    -.4234922    .0656808
              721  |  -.2371238   .1299547    -1.82   0.068    -.4918303    .0175827
              722  |  -.3007334   .1301179    -2.31   0.021    -.5557598   -.0457069
              723  |  -.1777242    .127972    -1.39   0.165    -.4285447    .0730963
              724  |    -.17904   .1177239    -1.52   0.128    -.4097746    .0516946
              725  |  -.1806806   .1187369    -1.52   0.128    -.4134005    .0520394
              726  |  -.1538311   .1170328    -1.31   0.189    -.3832112     .075549
              727  |   .0249016   .1587693     0.16   0.875    -.2862805    .3360836
              801  |  -.0718649   .1674379    -0.43   0.668    -.4000373    .2563074
              803  |   .7244314    .120417     6.02   0.000     .4884185    .9604444
              804  |  -.0422856    .159261    -0.27   0.791    -.3544313    .2698602
              805  |  -.1150588   .1631426    -0.71   0.481    -.4348125    .2046948
              806  |   .0668104   .1614293     0.41   0.679    -.2495853     .383206
              807  |  -.1223502   .1212388    -1.01   0.313    -.3599738    .1152734
              808  |  -.1207624   .1369098    -0.88   0.378    -.3891006    .1475758
              809  |  -.2639403    .169179    -1.56   0.119     -.595525    .0676444
              810  |   .1004222   .2571785     0.39   0.696    -.4036384    .6044828
              811  |  -.1857814   .1261725    -1.47   0.141     -.433075    .0615122
              812  |   .0748125   .1846692     0.41   0.685    -.2871324    .4367575
              813  |  -.0517615   .1631554    -0.32   0.751    -.3715401    .2680172
              814  |  -.2755686    .120417    -2.29   0.022    -.5115815   -.0395556
              815  |  -.0456179   .1663596    -0.27   0.784    -.3716768     .280441
              816  |  -.2141109   .1285824    -1.67   0.096    -.4661277    .0379059
              817  |   .0028991   .1507222     0.02   0.985     -.292511    .2983093
              818  |  -.1582082    .117132    -1.35   0.177    -.3877826    .0713663
              819  |  -.0816772   .1522133    -0.54   0.592    -.3800097    .2166553
              820  |   -.302561   .1424163    -2.12   0.034    -.5816917   -.0234302
              821  |   .7244314    .120417     6.02   0.000     .4884185    .9604444
              822  |  -.1117579    .116969    -0.96   0.339    -.3410129    .1174971
              823  |   -.139765   .1381045    -1.01   0.312    -.4104448    .1309147
              825  |  -.2896547   .1301527    -2.23   0.026    -.5447492   -.0345601
              826  |  -.4273879   .1248086    -3.42   0.001    -.6720082   -.1827676
              901  |   .0961689   .2128046     0.45   0.651    -.3209205    .5132582
              902  |  -.2092298   .1260532    -1.66   0.097    -.4562895      .03783
              903  |   .0073854   .1403757     0.05   0.958     -.267746    .2825168
              904  |   .0058669   .1378659     0.04   0.966    -.2643453    .2760791
              905  |  -.0960115   .1506973    -0.64   0.524    -.3913727    .1993497
              906  |  -.0391468   .1288213    -0.30   0.761     -.291632    .2133384
              907  |  -.1173499     .12695    -0.92   0.355    -.3661674    .1314676
              908  |   .1073579   .1413276     0.76   0.447    -.1696391    .3843549
              909  |   .1357354   .1302756     1.04   0.297       -.1196    .3910708
              910  |   .0658126   .1633018     0.40   0.687    -.2542531    .3858783
              911  |  -.0799967   .1790251    -0.45   0.655    -.4308794     .270886
              912  |   .0154731    .137445     0.11   0.910    -.2539141    .2848604
              913  |  -.0564217   .1355181    -0.42   0.677    -.3220322    .2091889
             1001  |  -.0908457   .1479869    -0.61   0.539    -.3808948    .1992033
             1002  |  -.1748074   .1295518    -1.35   0.177    -.4287242    .0791093
             1003  |  -.0812323   .1338588    -0.61   0.544    -.3435907    .1811261
             1004  |  -.0952197   .1825995    -0.52   0.602    -.4531082    .2626687
             1005  |  -.2079506   .1215973    -1.71   0.087     -.446277    .0303758
             1006  |  -.2560893   .1220348    -2.10   0.036    -.4952731   -.0169055
             1007  |    -.25778   .1239679    -2.08   0.038    -.5007527   -.0148073
             1008  |  -.2153631   .1260061    -1.71   0.087    -.4623305    .0316044
             1009  |  -.1152895   .1168217    -0.99   0.324    -.3442559    .1136769
             1010  |  -.2309536   .1330866    -1.74   0.083    -.4917986    .0298914
             1011  |  -.2638999   .1347305    -1.96   0.050    -.5279667     .000167
                   |
             _cons |   .3723329   .1272232     2.93   0.003       .12298    .6216859
------------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    c.tmt_all#c.round1 c.tmt_all#c.round2
------------------------------------------------------------------------------

. coefplot, keep(c.tmt_all#c.round1 c.tmt_all#c.round2) yline(0, lcolor(black) lw(thin) lp(dash)) vert
> ical xlab(, angle(45) labsize(medium)) level(90) graphregion(color(white)) plotregion(fcolor(white))
>  ylab(, nogrid) ///
> coeflabels(c.tmt_all#c.round1="Endline (round 1): Assignment" c.tmt_all#c.round2="Endline (round 2):
>  Assignment") title("Survey-level: seek or borrow mobile credit 0-1")

. gr export "${replication_dir}/Output/Figures/figure_a6_3.eps", replace // meta_digitborrow
file
    /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replication/3-replicati
    > on-package/Output/Figures/figure_a6_3.eps saved as EPS format

. 
. *robust-indivi-level clustering?
. pdslasso digitborrow1 tmt_all (i.districtX i.dateinterviewend female0 akan0 married0 ageYrs0 jhs0 hh
> size0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var digitborrow1...
Warning: unable to store lasso estimation
Selected: 8112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (32):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend female0 akan0 married0 ageYrs0 jhs0
                                       hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (3):                 5122020.dateinterviewend 8112020.dateinterviewend
                                       30112020.dateinterviewend
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0080418     -0.1618655
        30112020  |       0.0391798      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.2243115   .0181153   -12.38   0.000    -.2598169   -.1888061
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.2212111   .0183335   -12.07   0.000    -.2571442    -.185278
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
    digitborrow1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |  -.2213772   .0185022   -11.96   0.000     -.257641   -.1851135
                 |
dateinterviewend |
        5122020  |   .0636136   .0392011     1.62   0.105    -.0132191    .1404464
        8112020  |  -.1142514   .0233655    -4.89   0.000     -.160047   -.0684559
       30112020  |  -.0403956   .0215096    -1.88   0.060    -.0825536    .0017625
                 |
       districtX |
            102  |   .2488067   .2988089     0.83   0.405     -.336848    .8344613
            103  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            104  |   .0351449    .155291     0.23   0.821    -.2692199    .3395097
            105  |  -.1590598   .1332892    -1.19   0.233    -.4203018    .1021823
            106  |   .0027991   .1543214     0.02   0.986    -.2996652    .3052634
            107  |   .1280192   .1288564     0.99   0.320    -.1245348    .3805731
            108  |  -.1185085   .1532692    -0.77   0.439    -.4189106    .1818935
            109  |  -.1087965   .1456933    -0.75   0.455    -.3943502    .1767572
            110  |  -.1261933   .1574808    -0.80   0.423    -.4348499    .1824633
            111  |   -.070849   .1393834    -0.51   0.611    -.3440354    .2023374
            112  |  -.1312428   .1553105    -0.85   0.398    -.4356458    .1731603
            113  |  -.2511933   .1460918    -1.72   0.086     -.537528    .0351413
            114  |  -.1723745   .1356381    -1.27   0.204    -.4382203    .0934712
            115  |  -.2428441   .1341105    -1.81   0.070    -.5056959    .0200076
            116  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            117  |  -.2981884   .1457366    -2.05   0.041     -.583827   -.0125498
            201  |   .0754074   .1890893     0.40   0.690    -.2952008    .4460156
            202  |   -.190091   .1305805    -1.46   0.145    -.4460241     .065842
            203  |   .0361443   .1700073     0.21   0.832     -.297064    .3693525
            204  |  -.1104238    .132449    -0.83   0.404     -.370019    .1491715
            205  |  -.0018905   .1534498    -0.01   0.990    -.3026467    .2988656
            206  |   .0630263   .1501805     0.42   0.675     -.231322    .3573746
            207  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            208  |   -.097888   .1442471    -0.68   0.497    -.3806072    .1848312
            209  |  -.0310754   .1497632    -0.21   0.836    -.3246058     .262455
            210  |   .0382476   .1674371     0.23   0.819    -.2899231    .3664182
            211  |  -.0694449   .1522587    -0.46   0.648    -.3678665    .2289767
            212  |   .0965087   .1849862     0.52   0.602    -.2660577     .459075
            213  |  -.1381447   .1338989    -1.03   0.302    -.4005817    .1242923
            214  |  -.0370975   .1503285    -0.25   0.805     -.331736    .2575411
            215  |   .1241095   .2430552     0.51   0.610    -.3522699     .600489
            217  |  -.1723356   .1376172    -1.25   0.210    -.4420603    .0973891
            218  |   .4728044   .1542255     3.07   0.002     .1705279    .7750808
            219  |   .1347118   .2593141     0.52   0.603    -.3735345    .6429582
            220  |  -.1359233   .1380283    -0.98   0.325    -.4064538    .1346073
            301  |  -.1032851   .1438233    -0.72   0.473    -.3851735    .1786034
            302  |  -.2260116   .1368061    -1.65   0.099    -.4941467    .0421234
            303  |  -.1304058   .1265397    -1.03   0.303    -.3784191    .1176074
            304  |  -.0689836   .1320403    -0.52   0.601    -.3277778    .1898105
            305  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            306  |  -.1137417   .1368945    -0.83   0.406    -.3820499    .1545666
            307  |   .0172396   .1904983     0.09   0.928    -.3561302    .3906094
            308  |  -.0410706   .1483356    -0.28   0.782    -.3318031    .2496619
            309  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            310  |   .1280192   .1288564     0.99   0.320    -.1245348    .3805731
            311  |  -.0809479   .1839138    -0.44   0.660    -.4414124    .2795165
            312  |  -.0666665   .1393361    -0.48   0.632    -.3397602    .2064273
            313  |  -.0456139   .1385768    -0.33   0.742    -.3172195    .2259917
            314  |  -.2771956   .1555095    -1.78   0.075    -.5819887    .0275974
            315  |    .098335   .1688387     0.58   0.560    -.2325827    .4292527
            316  |  -.2511933   .1536689    -1.63   0.102    -.5523789    .0499922
            401  |   7.39e-14   .1660861     0.00   1.000    -.3255228    .3255228
            402  |  -.1395403   .1366819    -1.02   0.307    -.4074318    .1283512
            403  |  -.0751945   .1606718    -0.47   0.640    -.3901055    .2397165
            404  |  -.1774009   .1316142    -1.35   0.178      -.43536    .0805581
            405  |  -.1088247   .1750257    -0.62   0.534    -.4518687    .2342193
            406  |  -.0577293   .1819787    -0.32   0.751     -.414401    .2989423
            408  |  -.1815479   .1342005    -1.35   0.176    -.4445761    .0814802
            410  |  -.2391545   .1435218    -1.67   0.096     -.520452     .042143
            411  |  -.0617348   .1511515    -0.41   0.683    -.3579864    .2345167
            412  |  -.0683316   .2096867    -0.33   0.745      -.47931    .3426468
            413  |  -.0062428   .1441661    -0.04   0.965    -.2888032    .2763177
            414  |   .0944654   .1648573     0.57   0.567    -.2286491    .4175798
            415  |  -.1304058   .1265397    -1.03   0.303    -.3784191    .1176074
            417  |  -.0888996   .1869818    -0.48   0.634    -.4553773    .2775781
            418  |  -.1440841   .1377005    -1.05   0.295    -.4139721    .1258039
            419  |  -.1405047   .1265353    -1.11   0.267    -.3885093    .1074998
            421  |  -.0170967   .1504676    -0.11   0.910    -.3120078    .2778143
            422  |  -.1405047   .1265353    -1.11   0.267    -.3885093    .1074998
            423  |  -.1463638   .1400856    -1.04   0.296    -.4209266     .128199
            424  |  -.1824104   .1261275    -1.45   0.148    -.4296158    .0647949
            425  |  -.1824104   .1261275    -1.45   0.148    -.4296158    .0647949
            501  |  -.1058212   .1534409    -0.69   0.490    -.4065598    .1949175
            502  |  -.0393718   .1813903    -0.22   0.828    -.3948902    .3161467
            503  |   .0881817    .221282     0.40   0.690    -.3455231    .5218864
            504  |  -.2176634   .1419454    -1.53   0.125    -.4958713    .0605445
            505  |  -.0666665   .1393361    -0.48   0.632    -.3397602    .2064273
            506  |   .1608455   .2289238     0.70   0.482     -.287837     .609528
            507  |  -.1077386   .1513896    -0.71   0.477    -.4044568    .1889797
            508  |  -.4355945    .130386    -3.34   0.001    -.6911463   -.1800426
            509  |  -.1298088   .1427911    -0.91   0.363    -.4096742    .1500566
            510  |   .0172706    .174239     0.10   0.921    -.3242316    .3587729
            512  |  -.0546755   .2004753    -0.27   0.785    -.4475998    .3382489
            513  |   .0993964   .2184692     0.45   0.649    -.3287953    .5275881
            514  |  -.2981884   .1457366    -2.05   0.041     -.583827   -.0125498
            515  |  -.1997985    .133916    -1.49   0.136    -.4622691     .062672
            516  |    .112385   .1656862     0.68   0.498     -.212354    .4371239
            517  |  -.0057708   .1599581    -0.04   0.971    -.3192829    .3077413
            518  |  -.2391545   .1435218    -1.67   0.096     -.520452     .042143
            519  |  -.1538476    .127894    -1.20   0.229    -.4045152    .0968201
            522  |  -.2059479   .1370588    -1.50   0.133    -.4745783    .0626824
            523  |  -.3719808   .1288564    -2.89   0.004    -.6245348   -.1194269
            524  |  -.0550693   .1623022    -0.34   0.734    -.3731757    .2630371
            525  |  -.2109308   .1396119    -1.51   0.131    -.4845652    .0627035
            526  |   .1481228   .2735621     0.54   0.588    -.3880491    .6842946
            601  |  -.0492897   .1405568    -0.35   0.726     -.324776    .2261965
            602  |  -.2327294   .1613998    -1.44   0.149    -.5490672    .0836085
            603  |  -.3719808   .1288564    -2.89   0.004    -.6245348   -.1194269
            604  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            605  |   .0738186   .1480743     0.50   0.618    -.2164018     .364039
            606  |  -.1026224   .2020871    -0.51   0.612    -.4987058     .293461
            608  |  -.0271956   .1681722    -0.16   0.872     -.356807    .3024157
            609  |   .3493964   .1263497     2.77   0.006     .1017556    .5970372
            611  |  -.1916665   .1376606    -1.39   0.164    -.4614762    .0781433
            612  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            613  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            614  |  -.1268696   .1317768    -0.96   0.336    -.3851474    .1314081
            615  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            616  |   .0172706   .1751287     0.10   0.921    -.3259753    .3605166
            618  |  -.2549625   .1374387    -1.86   0.064    -.5243374    .0144124
            619  |   .0172706   .1751287     0.10   0.921    -.3259753    .3605166
            621  |   .1280192   .1288564     0.99   0.320    -.1245348    .3805731
            622  |  -.0577293   .1481355    -0.39   0.697    -.3480697     .232611
            623  |  -.1362922   .1956734    -0.70   0.486    -.5198051    .2472206
            627  |   -.224396   .1406766    -1.60   0.111     -.500117     .051325
            628  |   -.136523   .1666103    -0.82   0.413    -.4630731    .1900271
            701  |  -.4037877    .128133    -3.15   0.002    -.6549237   -.1526516
            702  |  -.1170168   .1424627    -0.82   0.411    -.3962386    .1622051
            703  |  -.0429552    .136202    -0.32   0.752    -.3099062    .2239957
            704  |  -.1688405   .1351401    -1.25   0.212    -.4337101    .0960292
            705  |  -.2008985   .1361918    -1.48   0.140    -.4678294    .0660325
            706  |  -.1442439   .1517345    -0.95   0.342     -.441638    .1531502
            707  |  -.1501126   .1349237    -1.11   0.266    -.4145582     .114333
            708  |  -.1733781   .1338061    -1.30   0.195    -.4356334    .0888771
            709  |  -.1315218   .1744767    -0.75   0.451    -.4734899    .2104463
            710  |  -.2391545   .1361123    -1.76   0.079    -.5059296    .0276206
            711  |  -.2183981   .1319167    -1.66   0.098    -.4769501     .040154
            712  |   -.023033   .1366927    -0.17   0.866    -.2909458    .2448798
            713  |    .025604   .1907412     0.13   0.893    -.3482418    .3994498
            714  |  -.0357377   .1701179    -0.21   0.834    -.3691625    .2976872
            715  |  -.1708089   .1322868    -1.29   0.197    -.4300862    .0884685
            716  |  -.1757096   .1347162    -1.30   0.192    -.4397485    .0883294
            717  |  -.1362922   .1554324    -0.88   0.381    -.4409341    .1683496
            718  |  -.0577293   .1481355    -0.39   0.697    -.3480697     .232611
            719  |   .0101847    .151289     0.07   0.946    -.2863362    .3067057
            720  |  -.1442589   .1332637    -1.08   0.279    -.4054509    .1169331
            721  |   -.177385   .1393668    -1.27   0.203     -.450539     .095769
            722  |  -.2549625   .1382798    -1.84   0.065    -.5259859    .0160609
            723  |  -.1281754   .1402641    -0.91   0.361    -.4030881    .1467372
            724  |  -.0934779   .1267115    -0.74   0.461    -.3418278    .1548721
            725  |  -.1405047   .1265353    -1.11   0.267    -.3885093    .1074998
            726  |  -.0934779   .1267115    -0.74   0.461    -.3418278    .1548721
            727  |   .0559324   .1654878     0.34   0.735    -.2684176    .3802824
            801  |   -.052385   .1818304    -0.29   0.773    -.4087661     .303996
            803  |   .7422706   .1305935     5.68   0.000      .486312    .9982292
            804  |   -.033601   .1677904    -0.20   0.841    -.3624641    .2952621
            805  |  -.0709971   .1954399    -0.36   0.716    -.4540522     .312058
            806  |   .0611592    .166326     0.37   0.713    -.2648338    .3871521
            807  |  -.0889106   .1348402    -0.66   0.510    -.3531926    .1753713
            808  |  -.0927353   .1478661    -0.63   0.531    -.3825476     .197077
            809  |  -.2612922    .149751    -1.74   0.081    -.5547989    .0322144
            810  |   .1608455   .2670526     0.60   0.547     -.362568     .684259
            811  |  -.1483978   .1343572    -1.10   0.269     -.411733    .1149375
            812  |    .117377   .2087098     0.56   0.574    -.2916867    .5264406
            813  |  -.0342124   .1718457    -0.20   0.842    -.3710237     .302599
            814  |  -.2577294   .1305935    -1.97   0.048     -.513688   -.0017708
            815  |  -.0275994   .1761483    -0.16   0.875    -.3728439     .317645
            816  |   -.194879   .1339863    -1.45   0.146    -.4574873    .0677292
            817  |   .0732287    .166894     0.44   0.661    -.2538774    .4003349
            818  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            819  |  -.0552873   .1604068    -0.34   0.730    -.3696789    .2591043
            820  |  -.2612922    .149751    -1.74   0.081    -.5547989    .0322144
            821  |   .7422706   .1305935     5.68   0.000      .486312    .9982292
            822  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
            823  |  -.0932887    .146311    -0.64   0.524    -.3800529    .1934755
            825  |  -.2549625   .1382798    -1.84   0.065    -.5259859    .0160609
            826  |  -.3719808   .1288564    -2.89   0.004    -.6245348   -.1194269
            901  |   .1565221    .219845     0.71   0.476    -.2743662    .5874105
            902  |  -.2391545   .1361123    -1.76   0.079    -.5059296    .0276206
            903  |   .0417716   .1543041     0.27   0.787    -.2606589    .3442021
            904  |   .0394031   .1492999     0.26   0.792    -.2532194    .3320256
            905  |  -.0427196   .1597107    -0.27   0.789    -.3557469    .2703077
            906  |  -.0111421   .1408189    -0.08   0.937     -.287142    .2648578
            907  |  -.0887875   .1373278    -0.65   0.518     -.357945    .1803699
            908  |   .1109607   .1525402     0.73   0.467    -.1880125    .4099339
            909  |   .1722141   .1410495     1.22   0.222    -.1042379    .4486661
            910  |   .0609187   .1656551     0.37   0.713    -.2637594    .3855968
            911  |  -.0666665   .1785184    -0.37   0.709    -.4165561    .2832232
            912  |   .0159093   .1461178     0.11   0.913    -.2704763    .3022949
            913  |  -.0323401   .1432634    -0.23   0.821    -.3131313     .248451
           1001  |  -.0196455   .1523856    -0.13   0.897    -.3183158    .2790248
           1002  |    -.16035   .1382999    -1.16   0.246    -.4314129    .1107128
           1003  |  -.0695687   .1402624    -0.50   0.620     -.344478    .2053405
           1004  |   -.052385   .1774497    -0.30   0.768    -.4001801      .29541
           1005  |  -.1691707   .1311113    -1.29   0.197    -.4261441    .0878027
           1006  |  -.2219833   .1338135    -1.66   0.097     -.484253    .0402864
           1007  |  -.2274122   .1363434    -1.67   0.095    -.4946403     .039816
           1008  |  -.1921371   .1349251    -1.42   0.154    -.4565855    .0723113
           1009  |  -.1506036   .1263497    -1.19   0.233    -.3982444    .0970372
           1010  |  -.2092238   .1430894    -1.46   0.144    -.4896738    .0712262
           1011  |  -.2549625   .1374387    -1.86   0.064    -.5243374    .0144124
                 |
           _cons |   .3719808   .1288564     2.89   0.004     .1194269    .6245348
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------

.         
. 
.         leebounds digitloan1 tmt_all, level(90) cieffect tight() 

Lee (2009) treatment effect bounds

Number of obs.                     =   2260
Number of selected obs.            =   2045
Trimming porportion                =   0.0576
Effect 90% conf. interval          : [-0.0928  -0.0153]

------------------------------------------------------------------------------
  digitloan1 | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
tmt_all      |
       lower |  -.0793413   .0104649    -7.58   0.000    -.0965546    -.062128
       upper |   -.030795   .0120749    -2.55   0.011    -.0506564   -.0109335
------------------------------------------------------------------------------

.         local lee_lower = string(e(b)[1,1], "%15.3fc") // Lee (2009)

.         local lee_upper = string(e(b)[1,2], "%15.3fc")

.         local lee_bounds = "[`lee_lower'; `lee_upper']" 

.         local im_lower = string(e(cilower), "%15.3fc") // Imbens-Manski (2004)

.         local im_upper = string(e(ciupper), "%15.3fc")

.         local im_bounds = "[`im_lower'; `im_upper']"

. 
. eststo: reg digitloan1 tmt_all, r cluster(districtX)

Linear regression                               Number of obs     =      2,045
                                                F(1, 191)         =       8.23
                                                Prob > F          =     0.0046
                                                R-squared         =     0.0046
                                                Root MSE          =     .23089

                            (Std. err. adjusted for 192 clusters in districtX)
------------------------------------------------------------------------------
             |               Robust
  digitloan1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.0335897   .0117051    -2.87   0.005    -.0566776   -.0105018
       _cons |   .0793413   .0145029     5.47   0.000      .050735    .1079477
------------------------------------------------------------------------------
(est7 stored)

. sum digitloan1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  digitloan1 |        668    .0793413    .2704733          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.079"

. estadd local district_FE "No", replace

added macro:
        e(district_FE) : "No"

. estadd local survey_FE   "No", replace

added macro:
          e(survey_FE) : "No"

. estadd local controls    "None", replace

added macro:
           e(controls) : "None"

. estadd local rw_stat `rw_digitloan1', replace

added macro:
            e(rw_stat) : "0.008"

. estadd local lee_bounds `lee_bounds', replace

added macro:
         e(lee_bounds) : "[-0.079; -0.031]"

. estadd local im_bounds `im_bounds', replace

added macro:
          e(im_bounds) : "[-0.093; -0.015]"

. 
. eststo: pdslasso digitloan1 tmt_all (i.districtX i.dateinterviewend female0 akan0 married0 ageYrs0 j
> hs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var digitloan1...
Selected: incomegrp0
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (32):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend female0 akan0 married0 ageYrs0 jhs0
                                       hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (3):                 5122020.dateinterviewend 30112020.dateinterviewend incomegrp0
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step1_digitloan1
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
       incomegrp0 |       0.0004564      0.0313548
---------------------------------------------------

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0080418     -0.1618655
        30112020  |       0.0391798      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
  digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.0364863   .0120194    -3.04   0.002    -.0600439   -.0129288
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
  digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |    -.03469    .011783    -2.94   0.003    -.0577843   -.0115958
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
      digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |  -.0347352   .0118755    -2.92   0.003    -.0580107   -.0114596
                 |
dateinterviewend |
        5122020  |   .0471139   .0252985     1.86   0.063    -.0024702     .096698
       30112020  |  -.0304896   .0129629    -2.35   0.019    -.0558964   -.0050828
                 |
      incomegrp0 |   .0326172   .0080808     4.04   0.000     .0167791    .0484553
                 |
       districtX |
            102  |  -.0601985   .0665995    -0.90   0.366    -.1907312    .0703342
            103  |   .1705753   .1421751     1.20   0.230    -.1080827    .4492333
            104  |   .3249576   .1477897     2.20   0.028     .0352951      .61462
            105  |   .0109015   .0268058     0.41   0.684     -.041637      .06344
            106  |  -.0264456   .0229341    -1.15   0.249    -.0713956    .0185044
            107  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            108  |  -.0408749   .0188635    -2.17   0.030    -.0778466   -.0039032
            109  |   -.004282   .0106201    -0.40   0.687     -.025097    .0165329
            110  |   .0050358   .0130366     0.39   0.699    -.0205155    .0305871
            111  |   .1061025   .1160163     0.91   0.360    -.1212852    .3334901
            112  |  -.0232383    .018233    -1.27   0.202    -.0589742    .0124977
            113  |  -.0275813   .0197503    -1.40   0.163    -.0662912    .0111286
            114  |   .0971998   .0587505     1.65   0.098     -.017949    .2123486
            115  |  -.0187187   .0142227    -1.32   0.188    -.0465946    .0091573
            116  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            117  |  -.0192482    .010287    -1.87   0.061    -.0394103     .000914
            201  |   .0724152   .0701716     1.03   0.302    -.0651187     .209949
            202  |   .0438663   .0488403     0.90   0.369    -.0518589    .1395916
            203  |   .2572062   .1261103     2.04   0.041     .0100346    .5043777
            204  |   .0758973    .082926     0.92   0.360    -.0866347    .2384293
            205  |   .1381924   .1421852     0.97   0.331    -.1404855    .4168703
            206  |   .0865485   .0839996     1.03   0.303    -.0780877    .2511846
            207  |  -.0178362   .0113428    -1.57   0.116    -.0400676    .0043953
            208  |  -.0036053   .0111372    -0.32   0.746    -.0254338    .0182232
            209  |  -.0386792   .0149617    -2.59   0.010    -.0680035   -.0093549
            210  |   .1269411   .0960413     1.32   0.186    -.0612964    .3151787
            211  |   .0642601   .0741614     0.87   0.386    -.0810936    .2096137
            212  |   .0692105   .0650303     1.06   0.287    -.0582465    .1966675
            213  |   .0844935   .0583773     1.45   0.148    -.0299239     .198911
            214  |   .1241128   .0696123     1.78   0.075    -.0123248    .2605504
            215  |  -.0104405   .0211357    -0.49   0.621    -.0518657    .0309847
            217  |   .0017541   .0109814     0.16   0.873     -.019769    .0232772
            218  |   .2193264   .1689891     1.30   0.194    -.1118862    .5505389
            219  |   .1749509    .140572     1.24   0.213    -.1005652    .4504669
            220  |   .0657786   .0606639     1.08   0.278    -.0531204    .1846776
            301  |  -.0225657   .0160141    -1.41   0.159    -.0539527    .0088213
            302  |   .0761797   .0956597     0.80   0.426    -.1113098    .2636693
            303  |  -.0025914   .0113899    -0.23   0.820    -.0249151    .0197324
            304  |   .0138936   .0190843     0.73   0.467    -.0235109    .0512982
            305  |   .2484724   .1668344     1.49   0.136    -.0785171    .5754619
            306  |   .0832435   .0559085     1.49   0.137    -.0263352    .1928222
            307  |   .1104574   .0879032     1.26   0.209    -.0618297    .2827446
            308  |   .0354494   .0571661     0.62   0.535    -.0765942    .1474929
            309  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            310  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            311  |  -.0020571   .0122896    -0.17   0.867    -.0261442      .02203
            312  |  -.0183657   .0224135    -0.82   0.413    -.0622953    .0255639
            313  |   .0454226   .0633733     0.72   0.474    -.0787869     .169632
            314  |  -.0143651   .0225507    -0.64   0.524    -.0585636    .0298335
            315  |  -.0046497   .0116831    -0.40   0.691    -.0275481    .0182487
            316  |   .0050358   .0198931     0.25   0.800     -.033954    .0440256
            401  |   .0527902   .0709637     0.74   0.457     -.086296    .1918764
            402  |   .0691439   .0651691     1.06   0.289    -.0585853     .196873
            403  |  -.0112212   .0125377    -0.89   0.371    -.0357946    .0133522
            404  |   .0003056   .0190486     0.02   0.987     -.037029    .0376403
            405  |   -.018637   .0217775    -0.86   0.392    -.0613201     .024046
            406  |  -.0022336   .0113241    -0.20   0.844    -.0244285    .0199613
            408  |  -.0096278   .0111699    -0.86   0.389    -.0315204    .0122648
            410  |   .1421761   .1947861     0.73   0.465    -.2395977    .5239498
            411  |  -.0089577   .0103667    -0.86   0.388     -.029276    .0113607
            412  |  -.0155221   .0182216    -0.85   0.394    -.0512359    .0201917
            413  |  -.0313925   .0241821    -1.30   0.194    -.0787885    .0160035
            414  |  -.0400376   .0440577    -0.91   0.363    -.1263891    .0463139
            415  |   .0300258   .0100142     3.00   0.003     .0103983    .0496533
            417  |  -.0568721   .0236174    -2.41   0.016    -.1031613   -.0105828
            418  |  -.0103096   .0163697    -0.63   0.529    -.0423936    .0217744
            419  |   .0224034   .0106965     2.09   0.036     .0014386    .0433682
            421  |  -.0230512   .0171558    -1.34   0.179     -.056676    .0105735
            422  |   .0224034   .0106965     2.09   0.036     .0014386    .0433682
            423  |  -.0115959    .014277    -0.81   0.417    -.0395783    .0163864
            424  |   -.008776   .0124122    -0.71   0.480    -.0331034    .0155515
            425  |   -.008776   .0124122    -0.71   0.480    -.0331034    .0155515
            501  |   .0458088   .0693126     0.66   0.509    -.0900413     .181659
            502  |   .1340376   .1415315     0.95   0.344     -.143359    .4114341
            503  |  -.0044625   .0184515    -0.24   0.809    -.0406268    .0317017
            504  |  -.0025882   .0118766    -0.22   0.827     -.025866    .0206896
            505  |  -.0183657    .019498    -0.94   0.346    -.0565811    .0198498
            506  |   .0943635   .0875538     1.08   0.281    -.0772387    .2659657
            507  |   -.005617   .0168256    -0.33   0.739    -.0385946    .0273607
            508  |  -.0670681   .0242966    -2.76   0.006    -.1146886   -.0194476
            509  |  -.0037804    .011411    -0.33   0.740    -.0261454    .0185847
            510  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            512  |  -.0044625   .0123569    -0.36   0.718    -.0286816    .0197565
            513  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            514  |  -.0736101   .0214928    -3.42   0.001    -.1157352   -.0314849
            515  |   .0891802    .091905     0.97   0.332    -.0909504    .2693107
            516  |   .0027277   .0119294     0.23   0.819    -.0206536    .0261089
            517  |  -.0323132   .0124118    -2.60   0.009    -.0566399   -.0079866
            518  |   .0008869   .0138575     0.06   0.949    -.0262732    .0280471
            519  |  -.0413931   .0273979    -1.51   0.131    -.0950919    .0123057
            522  |   .0060972   .0121302     0.50   0.615    -.0176776     .029872
            523  |  -.0525713   .0147198    -3.57   0.000    -.0814216    -.023721
            524  |  -.0199242   .0176972    -1.13   0.260    -.0546102    .0147617
            525  |   .0024934   .0188385     0.13   0.895    -.0344293    .0394162
            526  |  -.0085359   .0105689    -0.81   0.419    -.0292505    .0121788
            601  |  -.0155221   .0161593    -0.96   0.337    -.0471938    .0161496
            602  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            603  |  -.0525713   .0147198    -3.57   0.000    -.0814216    -.023721
            604  |  -.0178362   .0113428    -1.57   0.116    -.0400676    .0043953
            605  |   .0530941   .0621235     0.85   0.393    -.0686657    .1748539
            606  |  -.0187439   .0251984    -0.74   0.457    -.0681318     .030644
            608  |  -.0306736   .0122072    -2.51   0.012    -.0545993   -.0067479
            609  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            611  |  -.0102114   .0117887    -0.87   0.386    -.0333169    .0128941
            612  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            613  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            614  |     -.0138   .0096992    -1.42   0.155      -.03281    .0052101
            615  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            616  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            618  |  -.0084758   .0150884    -0.56   0.574    -.0380486    .0210969
            619  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            621  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            622  |   .0032026   .0130873     0.24   0.807    -.0224481    .0288533
            623  |  -.0107409   .0169276    -0.63   0.526    -.0439183    .0224365
            627  |  -.0076698   .0205529    -0.37   0.709    -.0479526    .0326131
            628  |  -.0128694   .0143147    -0.90   0.369    -.0409256    .0151868
            701  |  -.0435111   .0145739    -2.99   0.003    -.0720754   -.0149468
            702  |   -.002163   .0114428    -0.19   0.850    -.0245905    .0202645
            703  |  -.0052665   .0113662    -0.46   0.643    -.0275438    .0170109
            704  |  -.0004215   .0105752    -0.04   0.968    -.0211486    .0203055
            705  |   .0099084    .012626     0.78   0.433    -.0148381    .0346549
            706  |  -.0166301   .0180855    -0.92   0.358     -.052077    .0188167
            707  |  -.0141932   .0149249    -0.95   0.342    -.0434455     .015059
            708  |  -.0166595   .0125297    -1.33   0.184    -.0412172    .0078982
            709  |  -.0409929   .0213141    -1.92   0.054    -.0827678    .0007819
            710  |   .0008869   .0118763     0.07   0.940    -.0223902    .0241641
            711  |  -.0124874   .0118451    -1.05   0.292    -.0357035    .0107287
            712  |  -.0280631   .0193308    -1.45   0.147    -.0659508    .0098247
            713  |  -.0185422   .0215038    -0.86   0.389    -.0606889    .0236046
            714  |   .0586386   .0613707     0.96   0.339    -.0616457    .1789229
            715  |   .0154889    .037747     0.41   0.682    -.0584939    .0894718
            716  |  -.0008503   .0107448    -0.08   0.937    -.0219096     .020209
            717  |  -.0025866   .0128009    -0.20   0.840    -.0276759    .0225027
            718  |   .0032026   .0130873     0.24   0.807    -.0224481    .0288533
            719  |  -.0229712   .0174738    -1.31   0.189    -.0572192    .0112769
            720  |  -.0038692    .011789    -0.33   0.743    -.0269751    .0192368
            721  |   .0060972   .0117301     0.52   0.603    -.0168933    .0290877
            722  |  -.0084758   .0150884    -0.56   0.574    -.0380486    .0210969
            723  |   .0003072   .0119817     0.03   0.980    -.0231764    .0237908
            724  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            725  |   .0224034   .0106965     2.09   0.036     .0014386    .0433682
            726  |  -.0178362   .0113428    -1.57   0.116    -.0400676    .0043953
            727  |   .0050358    .011265     0.45   0.655    -.0170431    .0271148
            801  |  -.0183657   .0195389    -0.94   0.347    -.0566611    .0199298
            803  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            804  |  -.0277619    .016329    -1.70   0.089    -.0597662    .0042425
            805  |  -.0324201   .0243365    -1.33   0.183    -.0801188    .0152786
            806  |  -.0387777   .0170798    -2.27   0.023    -.0722535   -.0053019
            807  |   .0635997   .0778932     0.82   0.414    -.0890681    .2162675
            808  |   .0634518   .0733777     0.86   0.387    -.0803658    .2072693
            809  |  -.0515123   .0145613    -3.54   0.000    -.0800519   -.0229728
            810  |  -.0121599   .0165295    -0.74   0.462    -.0445571    .0202373
            811  |   .0170384   .0546433     0.31   0.755    -.0900605    .1241373
            812  |  -.0318307   .0165586    -1.92   0.055    -.0642849    .0006236
            813  |   .1036756   .1002147     1.03   0.301    -.0927416    .3000928
            814  |  -.1178056   .0270714    -4.35   0.000    -.1708647   -.0647466
            815  |  -.0349445   .0175355    -1.99   0.046    -.0693135   -.0005755
            816  |   .2013105    .155954     1.29   0.197    -.1043537    .5069748
            817  |  -.0192482    .010287    -1.87   0.061    -.0394103     .000914
            818  |  -.0830705   .0244271    -3.40   0.001    -.1309466   -.0351943
            819  |  -.0245208   .0168947    -1.45   0.147    -.0576338    .0085921
            820  |   .1658705   .2264385     0.73   0.464    -.2779408    .6096819
            821  |  -.0851885   .0202353    -4.21   0.000     -.124849    -.045528
            822  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            823  |  -.0322684   .0197713    -1.63   0.103    -.0710194    .0064826
            825  |  -.0247844    .018837    -1.32   0.188    -.0617043    .0121355
            826  |  -.0525713   .0147198    -3.57   0.000    -.0814216    -.023721
            901  |  -.0667619   .0237866    -2.81   0.005    -.1133828    -.020141
            902  |  -.0056365   .0151592    -0.37   0.710    -.0353479    .0240749
            903  |   .1165172   .0666239     1.75   0.080    -.0140633    .2470976
            904  |   .2541111   .0763163     3.33   0.001     .1045339    .4036884
            905  |   .1044628   .0750112     1.39   0.164    -.0425564     .251482
            906  |   .1581572   .0680525     2.32   0.020     .0247769    .2915376
            907  |   .0394968   .0386939     1.02   0.307    -.0363418    .1153354
            908  |   .3398169    .106988     3.18   0.001     .1301242    .5495096
            909  |   .3363931   .0885249     3.80   0.000     .1628874    .5098987
            910  |   .2144642   .1208913     1.77   0.076    -.0224785    .4514068
            911  |   .2153258   .2237671     0.96   0.336    -.2232496    .6539011
            912  |   .0668201   .0646585     1.03   0.301    -.0599082    .1935484
            913  |   .1891835   .0817928     2.31   0.021     .0288727    .3494944
           1001  |   .0032026   .0130873     0.24   0.807    -.0224481    .0288533
           1002  |  -.0274234   .0133477    -2.05   0.040    -.0535843   -.0012624
           1003  |   .0040192    .012548     0.32   0.749    -.0205744    .0286127
           1004  |   .0903258   .1061617     0.85   0.395    -.1177474    .2983989
           1005  |  -.0011905     .01208    -0.10   0.921    -.0248668    .0224858
           1006  |  -.0003477   .0124023    -0.03   0.978    -.0246557    .0239603
           1007  |   .0772983   .0711104     1.09   0.277    -.0620756    .2166722
           1008  |  -.0115867   .0135115    -0.86   0.391    -.0380688    .0148954
           1009  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
           1010  |   .0004319    .014651     0.03   0.976    -.0282835    .0291473
           1011  |  -.0166301   .0180855    -0.92   0.358     -.052077    .0188167
                 |
           _cons |   -.012663   .0149291    -0.85   0.396    -.0419236    .0165976
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------
(est8 stored)

. sum digitloan1 if tmt_all==0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  digitloan1 |        668    .0793413    .2704733          0          1

. estadd local control_mean = string(`r(mean)', "%15.3fc"), replace

added macro:
       e(control_mean) : "0.079"

. estadd local district_FE "Yes", replace

added macro:
        e(district_FE) : "Yes"

. estadd local survey_FE   "Yes", replace

added macro:
          e(survey_FE) : "Yes"

. estadd local controls    "PD Lasso", replace

added macro:
           e(controls) : "PD Lasso"

. estadd local rw_stat "", replace

added macro:
            e(rw_stat) : ""

. estadd local lee_bounds "", replace

added macro:
         e(lee_bounds) : ""

. estadd local im_bounds "", replace

added macro:
          e(im_bounds) : ""

. 
. *dyna fig
. pdslasso digitloan1 c.tmt_all#c.round1 c.tmt_all#c.round2 (i.districtX i.dateinterviewend female0 ak
> an0 married0 ageYrs0 jhs0 hhsize0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var digitloan1...
Selected: incomegrp0
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round1...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2122020.dateinterviewend 3122020.dateinterviewend
          4122020.dateinterviewend 5122020.dateinterviewend 6122020.dateinterviewend
          7122020.dateinterviewend 29112020.dateinterviewend 30112020.dateinterviewend
2.  (PDS/CHS) Selecting HD controls for exog regressor c.tmt_all#c.round2...
Warning: unable to store lasso estimation
Selected: 1122020.dateinterviewend 2112020.dateinterviewend 3112020.dateinterviewend
          4112020.dateinterviewend 5112020.dateinterviewend 6112020.dateinterviewend
          7112020.dateinterviewend 8112020.dateinterviewend 9112020.dateinterviewend
          10112020.dateinterviewend 11112020.dateinterviewend 29112020.dateinterviewend
          30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (2):                         c.tmt_all#c.round1 c.tmt_all#c.round2
High-dim controls (32):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend female0 akan0 married0 ageYrs0 jhs0
                                       hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (20):                1122020.dateinterviewend 2112020.dateinterviewend
                                       2122020.dateinterviewend 3112020.dateinterviewend
                                       3122020.dateinterviewend 4112020.dateinterviewend
                                       4122020.dateinterviewend 5112020.dateinterviewend
                                       5122020.dateinterviewend 6112020.dateinterviewend
                                       6122020.dateinterviewend 7112020.dateinterviewend
                                       7122020.dateinterviewend 8112020.dateinterviewend
                                       9112020.dateinterviewend 10112020.dateinterviewend
                                       11112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend incomegrp0
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step1_digitloan1
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
       incomegrp0 |       0.0004564      0.0313548
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
        digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.0297428   .0145878    -2.04   0.041    -.0583343   -.0011513
                   |
c.tmt_all#c.round2 |  -.0389689   .0157433    -2.48   0.013    -.0698252   -.0081125
------------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
        digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.0279057    .014803    -1.89   0.059     -.056919    .0011077
                   |
c.tmt_all#c.round2 |  -.0370972   .0160424    -2.31   0.021    -.0685397   -.0056548
------------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                  (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------------
                   |               Robust
        digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
c.tmt_all#c.round1 |  -.0272293    .014782    -1.84   0.065    -.0562015     .001743
                   |
c.tmt_all#c.round2 |   -.040627   .0167869    -2.42   0.016    -.0735287   -.0077253
                   |
  dateinterviewend |
          1122020  |  -.0200737   .0306285    -0.66   0.512    -.0801046    .0399571
          2112020  |   .0113374   .0330175     0.34   0.731    -.0533757    .0760505
          2122020  |   .0129768   .0363805     0.36   0.721    -.0583276    .0842813
          3112020  |  -.0148696   .0296178    -0.50   0.616    -.0729194    .0431802
          3122020  |   .0063458   .0326057     0.19   0.846    -.0575602    .0702519
          4112020  |  -.0271898   .0315014    -0.86   0.388    -.0889315    .0345518
          4122020  |   .0492111   .0417639     1.18   0.239    -.0326447     .131067
          5112020  |  -.0277775   .0336453    -0.83   0.409    -.0937209     .038166
          5122020  |   .0396549    .035966     1.10   0.270    -.0308373    .1101471
          6112020  |  -.0063584   .0318487    -0.20   0.842    -.0687807    .0560639
          6122020  |  -.0264815   .0381652    -0.69   0.488     -.101284    .0483209
          7112020  |    .041242   .0370758     1.11   0.266    -.0314251    .1139092
          7122020  |   .0211731     .04714     0.45   0.653    -.0712196    .1135658
          8112020  |  -.0451888   .0312467    -1.45   0.148    -.1064311    .0160536
          9112020  |  -.0428031    .042243    -1.01   0.311    -.1255979    .0399917
         10112020  |   -.068208   .0328755    -2.07   0.038    -.1326427   -.0037732
         11112020  |  -.0394253   .0283258    -1.39   0.164    -.0949429    .0160922
         29112020  |  -.0275968   .0381446    -0.72   0.469    -.1023589    .0471653
         30112020  |  -.0339962    .029233    -1.16   0.245    -.0912917    .0232994
                   |
        incomegrp0 |   .0329603   .0080512     4.09   0.000     .0171802    .0487404
                   |
         districtX |
              102  |  -.0516346   .0733675    -0.70   0.482    -.1954322     .092163
              103  |   .1700233   .1339144     1.27   0.204    -.0924441    .4324906
              104  |   .3270997   .1435655     2.28   0.023     .0457164     .608483
              105  |   .0146054   .0266191     0.55   0.583    -.0375672    .0667779
              106  |  -.0329004   .0208946    -1.57   0.115     -.073853    .0080522
              107  |   .0073569   .0221306     0.33   0.740    -.0360184    .0507321
              108  |  -.0364531   .0228537    -1.60   0.111    -.0812456    .0083393
              109  |   .0005903   .0138747     0.04   0.966    -.0266037    .0277843
              110  |    .002552   .0173182     0.15   0.883     -.031391     .036495
              111  |   .1038789   .1126214     0.92   0.356    -.1168551    .3246129
              112  |  -.0313428   .0174463    -1.80   0.072    -.0655368    .0028512
              113  |  -.0335521   .0207277    -1.62   0.106    -.0741777    .0070735
              114  |   .1089556   .0654982     1.66   0.096    -.0194186    .2373298
              115  |   .0062068   .0180462     0.34   0.731     -.029163    .0415766
              116  |   .0147724   .0185531     0.80   0.426    -.0215909    .0511357
              117  |  -.0262142   .0177593    -1.48   0.140    -.0610218    .0085934
              201  |   .0734309    .067822     1.08   0.279    -.0594978    .2063596
              202  |   .0353377   .0484936     0.73   0.466    -.0597079    .1303833
              203  |   .2558007   .1231227     2.08   0.038     .0144846    .4971167
              204  |   .0750951   .0830791     0.90   0.366    -.0877369     .237927
              205  |   .1359251   .1447718     0.94   0.348    -.1478224    .4196726
              206  |   .0743995   .0839402     0.89   0.375    -.0901203    .2389194
              207  |  -.0038177    .020447    -0.19   0.852    -.0438932    .0362578
              208  |  -.0079928   .0147564    -0.54   0.588    -.0369148    .0209292
              209  |  -.0268292     .02346    -1.14   0.253    -.0728099    .0191516
              210  |   .1290584   .0992485     1.30   0.193    -.0654651    .3235819
              211  |   .0670352   .0754081     0.89   0.374    -.0807619    .2148323
              212  |    .071515   .0622775     1.15   0.251    -.0505467    .1935766
              213  |   .0816699   .0607456     1.34   0.179    -.0373893     .200729
              214  |   .1293326   .0713684     1.81   0.070    -.0105468     .269212
              215  |  -.0052955   .0203259    -0.26   0.794    -.0451335    .0345426
              217  |   .0073084   .0171803     0.43   0.671    -.0263643    .0409811
              218  |   .2236355   .1750104     1.28   0.201    -.1193786    .5666495
              219  |   .1911479   .1397942     1.37   0.172    -.0828437    .4651394
              220  |   .0693089   .0630571     1.10   0.272    -.0542808    .1928986
              301  |  -.0223927   .0180901    -1.24   0.216    -.0578486    .0130632
              302  |   .0800678   .0920384     0.87   0.384    -.1003242    .2604598
              303  |  -.0018847   .0163263    -0.12   0.908    -.0338837    .0301143
              304  |   .0167968   .0202737     0.83   0.407    -.0229389    .0565324
              305  |   .2490737    .168437     1.48   0.139    -.0810567    .5792041
              306  |    .082711   .0543388     1.52   0.128    -.0237911    .1892131
              307  |   .1118813   .0896314     1.25   0.212     -.063793    .2875555
              308  |   .0357638   .0602384     0.59   0.553    -.0823012    .1538288
              309  |   .0137492   .0188577     0.73   0.466    -.0232111    .0507095
              310  |  -.0172486   .0191584    -0.90   0.368    -.0547984    .0203013
              311  |   -.006348   .0183837    -0.35   0.730    -.0423793    .0296833
              312  |   -.011535   .0268491    -0.43   0.667    -.0641583    .0410882
              313  |   .0605287   .0624259     0.97   0.332    -.0618238    .1828813
              314  |   .0106605   .0352175     0.30   0.762    -.0583646    .0796855
              315  |   .0189539   .0155532     1.22   0.223    -.0115298    .0494376
              316  |   .0239655   .0283489     0.85   0.398    -.0315972    .0795282
              401  |    .049065   .0717719     0.68   0.494    -.0916054    .1897354
              402  |   .0820416   .0649807     1.26   0.207    -.0453183    .2094014
              403  |  -.0077075   .0176609    -0.44   0.663    -.0423223    .0269072
              404  |   .0102377   .0180199     0.57   0.570    -.0250808    .0455561
              405  |  -.0158432   .0230236    -0.69   0.491    -.0609686    .0292822
              406  |   .0008196   .0156997     0.05   0.958    -.0299513    .0315904
              408  |   -.005899   .0152369    -0.39   0.699    -.0357627    .0239648
              410  |   .1609955   .2054067     0.78   0.433    -.2415942    .5635851
              411  |   -.004889   .0140467    -0.35   0.728      -.03242    .0226419
              412  |  -.0233103   .0169248    -1.38   0.168    -.0564824    .0098618
              413  |  -.0349236   .0301445    -1.16   0.247    -.0940058    .0241586
              414  |  -.0350562   .0432146    -0.81   0.417    -.1197552    .0496428
              415  |   .0179721   .0156881     1.15   0.252    -.0127759    .0487201
              417  |  -.0754223   .0219134    -3.44   0.001    -.1183718   -.0324728
              418  |  -.0083838    .017872    -0.47   0.639    -.0434122    .0266447
              419  |   .0176653   .0148527     1.19   0.234    -.0114455     .046776
              421  |  -.0294609   .0168882    -1.74   0.081    -.0625612    .0036393
              422  |   .0254924   .0180436     1.41   0.158    -.0098724    .0608573
              423  |  -.0136828   .0178144    -0.77   0.442    -.0485984    .0212329
              424  |   .0004102   .0169147     0.02   0.981     -.032742    .0335624
              425  |    .000704   .0187861     0.04   0.970    -.0361162    .0375241
              501  |   .0415758   .0717304     0.58   0.562    -.0990132    .1821647
              502  |   .1381337   .1454411     0.95   0.342    -.1469256    .4231931
              503  |  -.0058059   .0262158    -0.22   0.825    -.0571879     .045576
              504  |  -.0082617   .0159159    -0.52   0.604    -.0394563    .0229329
              505  |  -.0218012   .0287512    -0.76   0.448    -.0781525    .0345501
              506  |    .083181   .0884482     0.94   0.347    -.0901743    .2565363
              507  |  -.0042472   .0194817    -0.22   0.827    -.0424306    .0339363
              508  |  -.0669403   .0255465    -2.62   0.009    -.1170105   -.0168702
              509  |   .0073061   .0195526     0.37   0.709    -.0310162    .0456284
              510  |    .000979   .0164645     0.06   0.953    -.0312908    .0332487
              512  |  -.0042579   .0229059    -0.19   0.853    -.0491527    .0406369
              513  |  -.0122704   .0256201    -0.48   0.632    -.0624849     .037944
              514  |  -.0386576   .0313882    -1.23   0.218    -.1001773    .0228621
              515  |   .0843547   .0822939     1.03   0.305    -.0769384    .2456479
              516  |   -.013153   .0178276    -0.74   0.461    -.0480944    .0217884
              517  |  -.0339723   .0156099    -2.18   0.030    -.0645671   -.0033775
              518  |   .0189948   .0212148     0.90   0.371    -.0225855     .060575
              519  |  -.0332582   .0243079    -1.37   0.171    -.0809009    .0143844
              522  |   .0043097   .0246419     0.17   0.861    -.0439875     .052607
              523  |  -.0635549   .0212707    -2.99   0.003    -.1052447   -.0218651
              524  |  -.0157577   .0235158    -0.67   0.503    -.0618479    .0303324
              525  |   .0141023   .0235742     0.60   0.550    -.0321023    .0603069
              526  |  -.0152104   .0255743    -0.59   0.552    -.0653352    .0349144
              601  |  -.0042319    .017782    -0.24   0.812     -.039084    .0306202
              602  |   -.003923   .0258834    -0.15   0.880    -.0546535    .0468075
              603  |  -.0464473    .021487    -2.16   0.031    -.0885611   -.0043336
              604  |  -.0187455    .019722    -0.95   0.342       -.0574    .0199089
              605  |   .0529166   .0610131     0.87   0.386    -.0666669    .1725001
              606  |  -.0318349   .0287525    -1.11   0.268    -.0881888     .024519
              608  |  -.0412042   .0160356    -2.57   0.010    -.0726333   -.0097751
              609  |   .0033335   .0186662     0.18   0.858    -.0332515    .0399185
              611  |  -.0064449   .0160517    -0.40   0.688    -.0379056    .0250158
              612  |   .0380811   .0183901     2.07   0.038     .0020372     .074125
              613  |   .0033335   .0186662     0.18   0.858    -.0332515    .0399185
              614  |  -.0056643   .0129971    -0.44   0.663    -.0311382    .0198095
              615  |   .0215558   .0187932     1.15   0.251    -.0152782    .0583898
              616  |  -.0021334   .0196052    -0.11   0.913    -.0405588     .036292
              618  |   -.019076   .0178395    -1.07   0.285    -.0540408    .0158888
              619  |  -.0232239   .0180268    -1.29   0.198    -.0585557    .0121079
              621  |  -.0346657   .0221756    -1.56   0.118     -.078129    .0087976
              622  |  -.0046729   .0153864    -0.30   0.761    -.0348296    .0254839
              623  |  -.0244754   .0219505    -1.12   0.265    -.0674977    .0185468
              627  |   -.012598   .0260543    -0.48   0.629    -.0636635    .0384675
              628  |  -.0200497   .0212883    -0.94   0.346    -.0617741    .0216747
              701  |  -.0332242   .0198692    -1.67   0.094     -.072167    .0057187
              702  |  -.0079425    .017628    -0.45   0.652    -.0424928    .0266077
              703  |  -.0154743   .0162794    -0.95   0.342    -.0473814    .0164327
              704  |   .0016065    .016699     0.10   0.923    -.0311229    .0343358
              705  |  -.0187095   .0225931    -0.83   0.408    -.0629912    .0255722
              706  |  -.0202791   .0222406    -0.91   0.362    -.0638698    .0233116
              707  |  -.0277873   .0193483    -1.44   0.151    -.0657093    .0101347
              708  |  -.0192475   .0171795    -1.12   0.263    -.0529187    .0144236
              709  |  -.0269428   .0195165    -1.38   0.167    -.0651944    .0113088
              710  |  -.0101338   .0221751    -0.46   0.648    -.0535962    .0333285
              711  |  -.0072428   .0165989    -0.44   0.663     -.039776    .0252905
              712  |  -.0307795    .021415    -1.44   0.151     -.072752    .0111931
              713  |  -.0378651   .0257446    -1.47   0.141    -.0883235    .0125933
              714  |    .055561   .0611343     0.91   0.363      -.06426     .175382
              715  |   .0206823   .0371608     0.56   0.578    -.0521515     .093516
              716  |  -.0094007   .0176406    -0.53   0.594    -.0439756    .0251743
              717  |  -.0075347   .0163549    -0.46   0.645    -.0395898    .0245204
              718  |   .0055763   .0227526     0.25   0.806     -.039018    .0501705
              719  |  -.0238107   .0206934    -1.15   0.250    -.0643691    .0167477
              720  |  -.0089281   .0186837    -0.48   0.633    -.0455475    .0276913
              721  |   .0150284   .0187061     0.80   0.422    -.0216349    .0516918
              722  |   .0017477   .0196887     0.09   0.929    -.0368414    .0403369
              723  |  -.0119884   .0151429    -0.79   0.429     -.041668    .0176911
              724  |   .0227486   .0194301     1.17   0.242    -.0153336    .0608309
              725  |   .0085314   .0155962     0.55   0.584    -.0220365    .0390993
              726  |  -.0068961   .0192397    -0.36   0.720    -.0446052    .0308129
              727  |   .0273924   .0193631     1.41   0.157    -.0105586    .0653435
              801  |  -.0106475   .0252861    -0.42   0.674    -.0602074    .0389124
              803  |   .0179033   .0248778     0.72   0.472    -.0308563     .066663
              804  |  -.0191886   .0182525    -1.05   0.293    -.0549628    .0165856
              805  |  -.0348391   .0247184    -1.41   0.159    -.0832862     .013608
              806  |  -.0299307   .0183193    -1.63   0.102     -.065836    .0059745
              807  |   .0793818   .0812255     0.98   0.328    -.0798173    .2385809
              808  |   .0743335   .0767206     0.97   0.333    -.0760362    .2247031
              809  |  -.0403424   .0206458    -1.95   0.051    -.0808074    .0001225
              810  |  -.0318992    .022125    -1.44   0.149    -.0752634     .011465
              811  |   .0219061   .0552691     0.40   0.692    -.0864194    .1302315
              812  |  -.0346039   .0203273    -1.70   0.089    -.0744447    .0052369
              813  |   .1192208   .1019045     1.17   0.242    -.0805084      .31895
              814  |  -.0809775    .031522    -2.57   0.010    -.1427594   -.0191956
              815  |  -.0378391    .023721    -1.60   0.111    -.0843314    .0086533
              816  |   .2120799   .1543538     1.37   0.169    -.0904479    .5146077
              817  |  -.0093952   .0176022    -0.53   0.594    -.0438948    .0251044
              818  |  -.0686064   .0282023    -2.43   0.015    -.1238818   -.0133309
              819  |  -.0245255   .0163952    -1.50   0.135    -.0566596    .0076086
              820  |   .1657273   .2409531     0.69   0.492     -.306532    .6379866
              821  |  -.0480172    .027186    -1.77   0.077    -.1013009    .0052664
              822  |   .0507835   .0191031     2.66   0.008     .0133421     .088225
              823  |  -.0342558   .0245489    -1.40   0.163    -.0823708    .0138591
              825  |   -.009818    .023147    -0.42   0.671    -.0551853    .0355493
              826  |  -.0538873   .0253375    -2.13   0.033    -.1035479   -.0042267
              901  |  -.0563365   .0276933    -2.03   0.042    -.1106144   -.0020587
              902  |   .0255619   .0209914     1.22   0.223    -.0155806    .0667044
              903  |   .1227392   .0643148     1.91   0.056    -.0033155    .2487939
              904  |   .2495665   .0740742     3.37   0.001     .1043838    .3947492
              905  |   .1029176   .0750987     1.37   0.171    -.0442732    .2501083
              906  |   .1651103   .0674863     2.45   0.014     .0328395     .297381
              907  |   .0476745   .0352924     1.35   0.177    -.0214973    .1168462
              908  |   .3401673   .1012432     3.36   0.001     .1417344    .5386003
              909  |   .3405663   .0904682     3.76   0.000      .163252    .5178807
              910  |   .2362192   .1245356     1.90   0.058    -.0078661    .4803046
              911  |    .233643   .2289498     1.02   0.307    -.2150905    .6823764
              912  |   .0839122   .0649272     1.29   0.196    -.0433428    .2111672
              913  |   .2070941   .0815284     2.54   0.011     .0473014    .3668869
             1001  |  -.0036386   .0210663    -0.17   0.863    -.0449278    .0376505
             1002  |  -.0317941   .0147337    -2.16   0.031    -.0606717   -.0029166
             1003  |   .0063027   .0199065     0.32   0.752    -.0327134    .0453187
             1004  |   .0866395   .1194733     0.73   0.468    -.1475239    .3208029
             1005  |   .0036103    .019495     0.19   0.853    -.0345993    .0418198
             1006  |  -.0062701   .0151034    -0.42   0.678    -.0358723    .0233321
             1007  |   .0751796   .0720747     1.04   0.297    -.0660842    .2164433
             1008  |  -.0100283    .017053    -0.59   0.556    -.0434515     .023395
             1009  |   .0241144   .0171759     1.40   0.160    -.0095498    .0577786
             1010  |   .0033423   .0165497     0.20   0.840    -.0290945     .035779
             1011  |   -.016181   .0225664    -0.72   0.473    -.0604103    .0280483
                   |
             _cons |  -.0056748   .0265537    -0.21   0.831    -.0577191    .0463695
------------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    c.tmt_all#c.round1 c.tmt_all#c.round2
------------------------------------------------------------------------------

. coefplot, keep(c.tmt_all#c.round1 c.tmt_all#c.round2) yline(0, lcolor(black) lw(thin) lp(dash)) vert
> ical xlab(, angle(45) labsize(medium)) level(90) graphregion(color(white)) plotregion(fcolor(white))
>  ylab(, nogrid) ///
> coeflabels(c.tmt_all#c.round1="Endline (round 1): Assignment" c.tmt_all#c.round2="Endline (round 2):
>  Assignment") title("Survey-level: seek digital loan 0-1")

. gr export "${replication_dir}/Output/Figures/figure_a6_4.eps", replace // meta_digitloan
file
    /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replication/3-replicati
    > on-package/Output/Figures/figure_a6_4.eps saved as EPS format

.         
. *robust-indivi-level clustering?
. pdslasso digitloan1 tmt_all (i.districtX i.dateinterviewend female0 akan0 married0 ageYrs0 jhs0 hhsi
> ze0 selfEmploy0 informal0 incomegrp0), ///
>     partial(i.districtX) ///
>     cluster(caseidx) ///
>     rlasso
Partialling out unpenalized controls...
1.  (PDS/CHS) Selecting HD controls for dep var digitloan1...
Selected: incomegrp0
2.  (PDS/CHS) Selecting HD controls for exog regressor tmt_all...
Selected: 5122020.dateinterviewend 30112020.dateinterviewend


Estimation results:

Specification:
Regularization method:                 lasso
Penalty loadings:                      cluster-lasso
Number of observations:                2,018
Number of clusters:                    1,049
Exogenous (1):                         tmt_all
High-dim controls (32):                1112020b.dateinterviewend 1122020.dateinterviewend
                                       2112020.dateinterviewend 2122020.dateinterviewend
                                       3112020.dateinterviewend 3122020.dateinterviewend
                                       4112020.dateinterviewend 4122020.dateinterviewend
                                       5112020.dateinterviewend 5122020.dateinterviewend
                                       6112020.dateinterviewend 6122020.dateinterviewend
                                       7112020.dateinterviewend 7122020.dateinterviewend
                                       8112020.dateinterviewend 8122020.dateinterviewend
                                       9112020.dateinterviewend 9122020.dateinterviewend
                                       10112020.dateinterviewend 11112020.dateinterviewend
                                       28112020.dateinterviewend 29112020.dateinterviewend
                                       30112020.dateinterviewend female0 akan0 married0 ageYrs0 jhs0
                                       hhsize0 selfEmploy0 informal0 incomegrp0
Selected controls (3):                 5122020.dateinterviewend 30112020.dateinterviewend incomegrp0
Partialled-out controls (192):         101b.districtX 102.districtX 103.districtX 104.districtX
                                       105.districtX 106.districtX 107.districtX 108.districtX
                                       109.districtX 110.districtX 111.districtX 112.districtX
                                       113.districtX 114.districtX 115.districtX 116.districtX
                                       117.districtX 201.districtX 202.districtX 203.districtX
                                       204.districtX 205.districtX 206.districtX 207.districtX
                                       208.districtX 209.districtX 210.districtX 211.districtX
                                       212.districtX 213.districtX 214.districtX 215.districtX
                                       217.districtX 218.districtX 219.districtX 220.districtX
                                       301.districtX 302.districtX 303.districtX 304.districtX
                                       305.districtX 306.districtX 307.districtX 308.districtX
                                       309.districtX 310.districtX 311.districtX 312.districtX
                                       313.districtX 314.districtX 315.districtX 316.districtX
                                       401.districtX 402.districtX 403.districtX 404.districtX
                                       405.districtX 406.districtX 408.districtX 410.districtX
                                       411.districtX 412.districtX 413.districtX 414.districtX
                                       415.districtX 417.districtX 418.districtX 419.districtX
                                       421.districtX 422.districtX 423.districtX 424.districtX
                                       425.districtX 501.districtX 502.districtX 503.districtX
                                       504.districtX 505.districtX 506.districtX 507.districtX
                                       508.districtX 509.districtX 510.districtX 512.districtX
                                       513.districtX 514.districtX 515.districtX 516.districtX
                                       517.districtX 518.districtX 519.districtX 522.districtX
                                       523.districtX 524.districtX 525.districtX 526.districtX
                                       601.districtX 602.districtX 603.districtX 604.districtX
                                       605.districtX 606.districtX 608.districtX 609.districtX
                                       611.districtX 612.districtX 613.districtX 614.districtX
                                       615.districtX 616.districtX 618.districtX 619.districtX
                                       621.districtX 622.districtX 623.districtX 627.districtX
                                       628.districtX 701.districtX 702.districtX 703.districtX
                                       704.districtX 705.districtX 706.districtX 707.districtX
                                       708.districtX 709.districtX 710.districtX 711.districtX
                                       712.districtX 713.districtX 714.districtX 715.districtX
                                       716.districtX 717.districtX 718.districtX 719.districtX
                                       720.districtX 721.districtX 722.districtX 723.districtX
                                       724.districtX 725.districtX 726.districtX 727.districtX
                                       801.districtX 803.districtX 804.districtX 805.districtX
                                       806.districtX 807.districtX 808.districtX 809.districtX
                                       810.districtX 811.districtX 812.districtX 813.districtX
                                       814.districtX 815.districtX 816.districtX 817.districtX
                                       818.districtX 819.districtX 820.districtX 821.districtX
                                       822.districtX 823.districtX 825.districtX 826.districtX
                                       901.districtX 902.districtX 903.districtX 904.districtX
                                       905.districtX 906.districtX 907.districtX 908.districtX
                                       909.districtX 910.districtX 911.districtX 912.districtX
                                       913.districtX 1001.districtX 1002.districtX 1003.districtX
                                       1004.districtX 1005.districtX 1006.districtX 1007.districtX
                                       1008.districtX 1009.districtX 1010.districtX 1011.districtX

lasso estimation(s):

_pdslasso_step1_digitloan1
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
       incomegrp0 |       0.0004564      0.0313548
---------------------------------------------------

_pdslasso_step2_tmt_all
---------------------------------------------------
         Selected |           Lasso   Post-est OLS
------------------+--------------------------------
 dateinterviewend |
         5122020  |      -0.0080418     -0.1618655
        30112020  |       0.0391798      0.1464320
---------------------------------------------------

Structural equation:

OLS using CHS lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
  digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |  -.0364863   .0120194    -3.04   0.002    -.0600439   -.0129288
------------------------------------------------------------------------------

OLS using CHS post-lasso-orthogonalized vars
                            (Std. err. adjusted for 1,049 clusters in caseidx)
------------------------------------------------------------------------------
             |               Robust
  digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     tmt_all |    -.03469    .011783    -2.94   0.003    -.0577843   -.0115958
------------------------------------------------------------------------------

OLS with PDS-selected variables and full regressor set
                                (Std. err. adjusted for 1,049 clusters in caseidx)
----------------------------------------------------------------------------------
                 |               Robust
      digitloan1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         tmt_all |  -.0347352   .0118755    -2.92   0.003    -.0580107   -.0114596
                 |
dateinterviewend |
        5122020  |   .0471139   .0252985     1.86   0.063    -.0024702     .096698
       30112020  |  -.0304896   .0129629    -2.35   0.019    -.0558964   -.0050828
                 |
      incomegrp0 |   .0326172   .0080808     4.04   0.000     .0167791    .0484553
                 |
       districtX |
            102  |  -.0601985   .0665995    -0.90   0.366    -.1907312    .0703342
            103  |   .1705753   .1421751     1.20   0.230    -.1080827    .4492333
            104  |   .3249576   .1477897     2.20   0.028     .0352951      .61462
            105  |   .0109015   .0268058     0.41   0.684     -.041637      .06344
            106  |  -.0264456   .0229341    -1.15   0.249    -.0713956    .0185044
            107  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            108  |  -.0408749   .0188635    -2.17   0.030    -.0778466   -.0039032
            109  |   -.004282   .0106201    -0.40   0.687     -.025097    .0165329
            110  |   .0050358   .0130366     0.39   0.699    -.0205155    .0305871
            111  |   .1061025   .1160163     0.91   0.360    -.1212852    .3334901
            112  |  -.0232383    .018233    -1.27   0.202    -.0589742    .0124977
            113  |  -.0275813   .0197503    -1.40   0.163    -.0662912    .0111286
            114  |   .0971998   .0587505     1.65   0.098     -.017949    .2123486
            115  |  -.0187187   .0142227    -1.32   0.188    -.0465946    .0091573
            116  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            117  |  -.0192482    .010287    -1.87   0.061    -.0394103     .000914
            201  |   .0724152   .0701716     1.03   0.302    -.0651187     .209949
            202  |   .0438663   .0488403     0.90   0.369    -.0518589    .1395916
            203  |   .2572062   .1261103     2.04   0.041     .0100346    .5043777
            204  |   .0758973    .082926     0.92   0.360    -.0866347    .2384293
            205  |   .1381924   .1421852     0.97   0.331    -.1404855    .4168703
            206  |   .0865485   .0839996     1.03   0.303    -.0780877    .2511846
            207  |  -.0178362   .0113428    -1.57   0.116    -.0400676    .0043953
            208  |  -.0036053   .0111372    -0.32   0.746    -.0254338    .0182232
            209  |  -.0386792   .0149617    -2.59   0.010    -.0680035   -.0093549
            210  |   .1269411   .0960413     1.32   0.186    -.0612964    .3151787
            211  |   .0642601   .0741614     0.87   0.386    -.0810936    .2096137
            212  |   .0692105   .0650303     1.06   0.287    -.0582465    .1966675
            213  |   .0844935   .0583773     1.45   0.148    -.0299239     .198911
            214  |   .1241128   .0696123     1.78   0.075    -.0123248    .2605504
            215  |  -.0104405   .0211357    -0.49   0.621    -.0518657    .0309847
            217  |   .0017541   .0109814     0.16   0.873     -.019769    .0232772
            218  |   .2193264   .1689891     1.30   0.194    -.1118862    .5505389
            219  |   .1749509    .140572     1.24   0.213    -.1005652    .4504669
            220  |   .0657786   .0606639     1.08   0.278    -.0531204    .1846776
            301  |  -.0225657   .0160141    -1.41   0.159    -.0539527    .0088213
            302  |   .0761797   .0956597     0.80   0.426    -.1113098    .2636693
            303  |  -.0025914   .0113899    -0.23   0.820    -.0249151    .0197324
            304  |   .0138936   .0190843     0.73   0.467    -.0235109    .0512982
            305  |   .2484724   .1668344     1.49   0.136    -.0785171    .5754619
            306  |   .0832435   .0559085     1.49   0.137    -.0263352    .1928222
            307  |   .1104574   .0879032     1.26   0.209    -.0618297    .2827446
            308  |   .0354494   .0571661     0.62   0.535    -.0765942    .1474929
            309  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            310  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            311  |  -.0020571   .0122896    -0.17   0.867    -.0261442      .02203
            312  |  -.0183657   .0224135    -0.82   0.413    -.0622953    .0255639
            313  |   .0454226   .0633733     0.72   0.474    -.0787869     .169632
            314  |  -.0143651   .0225507    -0.64   0.524    -.0585636    .0298335
            315  |  -.0046497   .0116831    -0.40   0.691    -.0275481    .0182487
            316  |   .0050358   .0198931     0.25   0.800     -.033954    .0440256
            401  |   .0527902   .0709637     0.74   0.457     -.086296    .1918764
            402  |   .0691439   .0651691     1.06   0.289    -.0585853     .196873
            403  |  -.0112212   .0125377    -0.89   0.371    -.0357946    .0133522
            404  |   .0003056   .0190486     0.02   0.987     -.037029    .0376403
            405  |   -.018637   .0217775    -0.86   0.392    -.0613201     .024046
            406  |  -.0022336   .0113241    -0.20   0.844    -.0244285    .0199613
            408  |  -.0096278   .0111699    -0.86   0.389    -.0315204    .0122648
            410  |   .1421761   .1947861     0.73   0.465    -.2395977    .5239498
            411  |  -.0089577   .0103667    -0.86   0.388     -.029276    .0113607
            412  |  -.0155221   .0182216    -0.85   0.394    -.0512359    .0201917
            413  |  -.0313925   .0241821    -1.30   0.194    -.0787885    .0160035
            414  |  -.0400376   .0440577    -0.91   0.363    -.1263891    .0463139
            415  |   .0300258   .0100142     3.00   0.003     .0103983    .0496533
            417  |  -.0568721   .0236174    -2.41   0.016    -.1031613   -.0105828
            418  |  -.0103096   .0163697    -0.63   0.529    -.0423936    .0217744
            419  |   .0224034   .0106965     2.09   0.036     .0014386    .0433682
            421  |  -.0230512   .0171558    -1.34   0.179     -.056676    .0105735
            422  |   .0224034   .0106965     2.09   0.036     .0014386    .0433682
            423  |  -.0115959    .014277    -0.81   0.417    -.0395783    .0163864
            424  |   -.008776   .0124122    -0.71   0.480    -.0331034    .0155515
            425  |   -.008776   .0124122    -0.71   0.480    -.0331034    .0155515
            501  |   .0458088   .0693126     0.66   0.509    -.0900413     .181659
            502  |   .1340376   .1415315     0.95   0.344     -.143359    .4114341
            503  |  -.0044625   .0184515    -0.24   0.809    -.0406268    .0317017
            504  |  -.0025882   .0118766    -0.22   0.827     -.025866    .0206896
            505  |  -.0183657    .019498    -0.94   0.346    -.0565811    .0198498
            506  |   .0943635   .0875538     1.08   0.281    -.0772387    .2659657
            507  |   -.005617   .0168256    -0.33   0.739    -.0385946    .0273607
            508  |  -.0670681   .0242966    -2.76   0.006    -.1146886   -.0194476
            509  |  -.0037804    .011411    -0.33   0.740    -.0261454    .0185847
            510  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            512  |  -.0044625   .0123569    -0.36   0.718    -.0286816    .0197565
            513  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            514  |  -.0736101   .0214928    -3.42   0.001    -.1157352   -.0314849
            515  |   .0891802    .091905     0.97   0.332    -.0909504    .2693107
            516  |   .0027277   .0119294     0.23   0.819    -.0206536    .0261089
            517  |  -.0323132   .0124118    -2.60   0.009    -.0566399   -.0079866
            518  |   .0008869   .0138575     0.06   0.949    -.0262732    .0280471
            519  |  -.0413931   .0273979    -1.51   0.131    -.0950919    .0123057
            522  |   .0060972   .0121302     0.50   0.615    -.0176776     .029872
            523  |  -.0525713   .0147198    -3.57   0.000    -.0814216    -.023721
            524  |  -.0199242   .0176972    -1.13   0.260    -.0546102    .0147617
            525  |   .0024934   .0188385     0.13   0.895    -.0344293    .0394162
            526  |  -.0085359   .0105689    -0.81   0.419    -.0292505    .0121788
            601  |  -.0155221   .0161593    -0.96   0.337    -.0471938    .0161496
            602  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            603  |  -.0525713   .0147198    -3.57   0.000    -.0814216    -.023721
            604  |  -.0178362   .0113428    -1.57   0.116    -.0400676    .0043953
            605  |   .0530941   .0621235     0.85   0.393    -.0686657    .1748539
            606  |  -.0187439   .0251984    -0.74   0.457    -.0681318     .030644
            608  |  -.0306736   .0122072    -2.51   0.012    -.0545993   -.0067479
            609  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            611  |  -.0102114   .0117887    -0.87   0.386    -.0333169    .0128941
            612  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            613  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            614  |     -.0138   .0096992    -1.42   0.155      -.03281    .0052101
            615  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            616  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            618  |  -.0084758   .0150884    -0.56   0.574    -.0380486    .0210969
            619  |  -.0025866   .0155071    -0.17   0.868      -.03298    .0278068
            621  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            622  |   .0032026   .0130873     0.24   0.807    -.0224481    .0288533
            623  |  -.0107409   .0169276    -0.63   0.526    -.0439183    .0224365
            627  |  -.0076698   .0205529    -0.37   0.709    -.0479526    .0326131
            628  |  -.0128694   .0143147    -0.90   0.369    -.0409256    .0151868
            701  |  -.0435111   .0145739    -2.99   0.003    -.0720754   -.0149468
            702  |   -.002163   .0114428    -0.19   0.850    -.0245905    .0202645
            703  |  -.0052665   .0113662    -0.46   0.643    -.0275438    .0170109
            704  |  -.0004215   .0105752    -0.04   0.968    -.0211486    .0203055
            705  |   .0099084    .012626     0.78   0.433    -.0148381    .0346549
            706  |  -.0166301   .0180855    -0.92   0.358     -.052077    .0188167
            707  |  -.0141932   .0149249    -0.95   0.342    -.0434455     .015059
            708  |  -.0166595   .0125297    -1.33   0.184    -.0412172    .0078982
            709  |  -.0409929   .0213141    -1.92   0.054    -.0827678    .0007819
            710  |   .0008869   .0118763     0.07   0.940    -.0223902    .0241641
            711  |  -.0124874   .0118451    -1.05   0.292    -.0357035    .0107287
            712  |  -.0280631   .0193308    -1.45   0.147    -.0659508    .0098247
            713  |  -.0185422   .0215038    -0.86   0.389    -.0606889    .0236046
            714  |   .0586386   .0613707     0.96   0.339    -.0616457    .1789229
            715  |   .0154889    .037747     0.41   0.682    -.0584939    .0894718
            716  |  -.0008503   .0107448    -0.08   0.937    -.0219096     .020209
            717  |  -.0025866   .0128009    -0.20   0.840    -.0276759    .0225027
            718  |   .0032026   .0130873     0.24   0.807    -.0224481    .0288533
            719  |  -.0229712   .0174738    -1.31   0.189    -.0572192    .0112769
            720  |  -.0038692    .011789    -0.33   0.743    -.0269751    .0192368
            721  |   .0060972   .0117301     0.52   0.603    -.0168933    .0290877
            722  |  -.0084758   .0150884    -0.56   0.574    -.0380486    .0210969
            723  |   .0003072   .0119817     0.03   0.980    -.0231764    .0237908
            724  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            725  |   .0224034   .0106965     2.09   0.036     .0014386    .0433682
            726  |  -.0178362   .0113428    -1.57   0.116    -.0400676    .0043953
            727  |   .0050358    .011265     0.45   0.655    -.0170431    .0271148
            801  |  -.0183657   .0195389    -0.94   0.347    -.0566611    .0199298
            803  |  -.0199542   .0124289    -1.61   0.108    -.0443143     .004406
            804  |  -.0277619    .016329    -1.70   0.089    -.0597662    .0042425
            805  |  -.0324201   .0243365    -1.33   0.183    -.0801188    .0152786
            806  |  -.0387777   .0170798    -2.27   0.023    -.0722535   -.0053019
            807  |   .0635997   .0778932     0.82   0.414    -.0890681    .2162675
            808  |   .0634518   .0733777     0.86   0.387    -.0803658    .2072693
            809  |  -.0515123   .0145613    -3.54   0.000    -.0800519   -.0229728
            810  |  -.0121599   .0165295    -0.74   0.462    -.0445571    .0202373
            811  |   .0170384   .0546433     0.31   0.755    -.0900605    .1241373
            812  |  -.0318307   .0165586    -1.92   0.055    -.0642849    .0006236
            813  |   .1036756   .1002147     1.03   0.301    -.0927416    .3000928
            814  |  -.1178056   .0270714    -4.35   0.000    -.1708647   -.0647466
            815  |  -.0349445   .0175355    -1.99   0.046    -.0693135   -.0005755
            816  |   .2013105    .155954     1.29   0.197    -.1043537    .5069748
            817  |  -.0192482    .010287    -1.87   0.061    -.0394103     .000914
            818  |  -.0830705   .0244271    -3.40   0.001    -.1309466   -.0351943
            819  |  -.0245208   .0168947    -1.45   0.147    -.0576338    .0085921
            820  |   .1658705   .2264385     0.73   0.464    -.2779408    .6096819
            821  |  -.0851885   .0202353    -4.21   0.000     -.124849    -.045528
            822  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
            823  |  -.0322684   .0197713    -1.63   0.103    -.0710194    .0064826
            825  |  -.0247844    .018837    -1.32   0.188    -.0617043    .0121355
            826  |  -.0525713   .0147198    -3.57   0.000    -.0814216    -.023721
            901  |  -.0667619   .0237866    -2.81   0.005    -.1133828    -.020141
            902  |  -.0056365   .0151592    -0.37   0.710    -.0353479    .0240749
            903  |   .1165172   .0666239     1.75   0.080    -.0140633    .2470976
            904  |   .2541111   .0763163     3.33   0.001     .1045339    .4036884
            905  |   .1044628   .0750112     1.39   0.164    -.0425564     .251482
            906  |   .1581572   .0680525     2.32   0.020     .0247769    .2915376
            907  |   .0394968   .0386939     1.02   0.307    -.0363418    .1153354
            908  |   .3398169    .106988     3.18   0.001     .1301242    .5495096
            909  |   .3363931   .0885249     3.80   0.000     .1628874    .5098987
            910  |   .2144642   .1208913     1.77   0.076    -.0224785    .4514068
            911  |   .2153258   .2237671     0.96   0.336    -.2232496    .6539011
            912  |   .0668201   .0646585     1.03   0.301    -.0599082    .1935484
            913  |   .1891835   .0817928     2.31   0.021     .0288727    .3494944
           1001  |   .0032026   .0130873     0.24   0.807    -.0224481    .0288533
           1002  |  -.0274234   .0133477    -2.05   0.040    -.0535843   -.0012624
           1003  |   .0040192    .012548     0.32   0.749    -.0205744    .0286127
           1004  |   .0903258   .1061617     0.85   0.395    -.1177474    .2983989
           1005  |  -.0011905     .01208    -0.10   0.921    -.0248668    .0224858
           1006  |  -.0003477   .0124023    -0.03   0.978    -.0246557    .0239603
           1007  |   .0772983   .0711104     1.09   0.277    -.0620756    .2166722
           1008  |  -.0115867   .0135115    -0.86   0.391    -.0380688    .0148954
           1009  |    .014781   .0095156     1.55   0.120    -.0038692    .0334312
           1010  |   .0004319    .014651     0.03   0.976    -.0282835    .0291473
           1011  |  -.0166301   .0180855    -0.92   0.358     -.052077    .0188167
                 |
           _cons |   -.012663   .0149291    -0.85   0.396    -.0419236    .0165976
----------------------------------------------------------------------------------
Standard errors and test statistics valid for the following variables only:
    tmt_all
------------------------------------------------------------------------------

.         
. 
. 
. 
. esttab using "${replication_dir}/Output/Tables/table_2_esttab.tex", ///
>         keep(tmt_all)                                                                   ///
>         style(tex)                                                                                  
>     ///
>         nogaps                                                                                      
>     ///
>         nobaselevels                                                                            ///
>         noconstant                                                                                  
>     ///
>         label                                                                                   ///
>         varwidth(50)                                                                            ///
>         wrap                                                                                        
>     ///
>         nomtitles /// mlabels(`mylabels')                                                           
>             ///
>         mgroups("Unable to Call, 7days 0-1" "Unable to Call, COVID19 0-1" ///
>                         "Borrow SOS Airtime 0-1" "Seek Digital Loan 0-1", ///
>                         pattern(1 0 1 0 1 0 1 0)                                        ///
>                         prefix(\multicolumn{@span}{c}{)                         ///
>                         suffix(}) span                                                          ///
>                         erepeat(\cmidrule(lr){@span}))                          ///
>         cells (b(fmt(3) star) se(fmt(3) par))                           ///
>         stats(N                                                                                     
>     ///
>                   district_FE                                                                   ///
>                   survey_FE                                                                     ///
>                   controls                                                                      ///
>                   control_mean                                                                  ///
>                   lee_bounds                                                                    ///
>                   im_bounds                                                                     ///
>                   rw_stat,                                                                          
>     ///
>                   fmt(%9.0f %9.3f %9.3f %9.3f %9.3f %9.3f %9.3f %9.3f) ///
>                   labels("Observations"                                                 ///
>                                  "District FE" ///
>                                  "Survey Date FE" ///
>                                  "Controls"       ///
>                                  "Mean of dep. variable (control)" ///
>                                  "Lee 2009 Attrition Bounds" ///
>                                  "Imbens-Manski 2004" ///
>                                  "p-value: Romano-Wolf Correction" )) ///
>         replace
(tabulating estimates stored by eststo; specify "." to tabulate the active results)
(output written to /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replicatio
> n/3-replication-package/Output/Tables/table_2_esttab.tex)

. 
.         
. log close
      name:  <unnamed>
       log:  /Users/yazenkashlan/Documents/GitHub/Annan-and-Archibong-2021/MS20211400-replication/3-re
> plication-package/Output/table2_logfile.log
  log type:  text
 closed on:   1 Feb 2026, 21:17:58
------------------------------------------------------------------------------------------------------
